Contents of the .debug_aranges section:

  Length:                   36
  Version:                  2
  Offset into .debug_info:  0x9f4
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00002762 000042ec 
    00006a98 000001dc 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb1fd
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006e36 00000004 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb2b8
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006cd6 00000028 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb373
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006cfe 00000010 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb42e
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000271a 00000016 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb4e9
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006d0e 00000014 
    00000000 00000000 
  Length:                   28
  Version:                  2

    <9bc>   DW_AT_name        : (indirect string, offset: 0x35c): USBINT
    <9c0>   DW_AT_decl_file   : 0
    <9c1>   DW_AT_decl_line   : 0
    <9c2>   DW_AT_type        : <0x14>
    <9c6>   DW_AT_external    : 1
    <9c7>   DW_AT_location    : 5 byte block: 3 da 0 80 0 	(DW_OP_addr: 8000da)
 <1><9cd>: Abbrev Number: 142 (DW_TAG_variable)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x363): USBSTA
    <9d3>   DW_AT_decl_file   : 0
    <9d4>   DW_AT_decl_line   : 0
    <9d5>   DW_AT_type        : <0x14>
    <9d9>   DW_AT_external    : 1
    <9da>   DW_AT_location    : 5 byte block: 3 d9 0 80 0 	(DW_OP_addr: 8000d9)
 <1><9e0>: Abbrev Number: 143 (DW_TAG_variable)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x36a): UHWCON
    <9e6>   DW_AT_decl_file   : 0
    <9e7>   DW_AT_decl_line   : 0
    <9e8>   DW_AT_type        : <0x14>
    <9ec>   DW_AT_external    : 1
    <9ed>   DW_AT_location    : 5 byte block: 3 d7 0 80 0 	(DW_OP_addr: 8000d7)
 <1><9f3>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f4:
   Length:        0xa805 (32-bit)
   Version:       2
   Abbrev Offset: 0x96a
   Pointer Size:  4
 <0><9ff>: Abbrev Number: 132 (DW_TAG_compile_unit)
    <a01>   DW_AT_producer    : (indirect string, offset: 0xddc): GNU GIMPLE 7.3.0 -mn-flash=1 -mcall-prologues -mstrict-X -mmcu=avr5 -mn-flash=1 -mno-skip-bug -mmcu=avr5 -g -Os -Os -fmath-errno -fsigned-zeros -ftrapping-math -fno-trapv -fno-openmp -fno-openacc -fno-exceptions -fuse-linker-plugin -fltrans
    <a05>   DW_AT_language    : 4	(C++)
    <a06>   DW_AT_name        : (indirect string, offset: 0xf21): <artificial>
    <a0a>   DW_AT_comp_dir    : (indirect string, offset: 0x1b05): C:\Users\Brown\Documents\GitHub\arduboy_minigolf
    <a0e>   DW_AT_ranges      : 0x7d8
    <a12>   DW_AT_low_pc      : 0x0
    <a16>   DW_AT_entry_pc    : 0x0
    <a1a>   DW_AT_stmt_list   : 0x1a
 <1><a1e>: Abbrev Number: 94 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : u8
    <a22>   DW_AT_decl_file   : 27
    <a23>   DW_AT_decl_line   : 29
    <a24>   DW_AT_type        : <0xa32>
 <1><a28>: Abbrev Number: 7 (DW_TAG_const_type)
    <a29>   DW_AT_type        : <0xa1e>
 <1><a2d>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <a2e>   DW_AT_type        : <0xa1e>
 <1><a32>: Abbrev Number: 54 (DW_TAG_base_type)
    <a33>   DW_AT_byte_size   : 1
    <a34>   DW_AT_encoding    : 8	(unsigned char)
    <a35>   DW_AT_name        : (indirect string, offset: 0xa08): unsigned char
 <1><a39>: Abbrev Number: 48 (DW_TAG_structure_type)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x1c6c): ArduboyTones
    <a3e>   DW_AT_byte_size   : 1
    <a3f>   DW_AT_decl_file   : 29
    <a40>   DW_AT_decl_line   : 162
    <a41>   DW_AT_sibling     : <0xac4>
 <2><a45>: Abbrev Number: 133 (DW_TAG_subprogram)
    <a47>   DW_AT_name        : (indirect string, offset: 0x388): tone
    <a4b>   DW_AT_decl_file   : 6
    <a4c>   DW_AT_decl_line   : 84
    <a4d>   DW_AT_declaration : 1
    <a4e>   DW_AT_sibling     : <0xa67>
 <3><a52>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a53>   DW_AT_type        : <0xdec>
 <3><a57>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a58>   DW_AT_type        : <0xdec>
 <3><a5c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a5d>   DW_AT_type        : <0xdec>
 <3><a61>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a62>   DW_AT_type        : <0xdec>
 <3><a66>: Abbrev Number: 0
 <2><a67>: Abbrev Number: 90 (DW_TAG_subprogram)
    <a68>   DW_AT_name        : (indirect string, offset: 0xd39): __base_ctor 
    <a6c>   DW_AT_decl_file   : 6
    <a6d>   DW_AT_decl_line   : 59
    <a6e>   DW_AT_declaration : 1
    <a6f>   DW_AT_object_pointer: <0xa77>
    <a73>   DW_AT_sibling     : <0xa83>
 <3><a77>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <a78>   DW_AT_type        : <0x231d>
    <a7c>   DW_AT_artificial  : 1
 <3><a7d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a7e>   DW_AT_type        : <0x2328>
 <3><a82>: Abbrev Number: 0
 <2><a83>: Abbrev Number: 134 (DW_TAG_subprogram)
    <a85>   DW_AT_name        : (indirect string, offset: 0x141d): _ZN12ArduboyTones7getNextEv.part.0
    <a89>   DW_AT_type        : <0xdec>
    <a8d>   DW_AT_artificial  : 1
    <a8e>   DW_AT_accessibility: 3	(private)
    <a8f>   DW_AT_declaration : 1
 <2><a90>: Abbrev Number: 135 (DW_TAG_subprogram)
    <a92>   DW_AT_name        : (indirect string, offset: 0x802): getNext
    <a96>   DW_AT_decl_file   : 6
    <a97>   DW_AT_decl_line   : 261
    <a99>   DW_AT_type        : <0xdec>
    <a9d>   DW_AT_accessibility: 3	(private)
    <a9e>   DW_AT_declaration : 1
 <2><a9f>: Abbrev Number: 85 (DW_TAG_subprogram)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x218b): noTone
    <aa4>   DW_AT_decl_file   : 6
    <aa5>   DW_AT_decl_line   : 131
    <aa6>   DW_AT_declaration : 1
 <2><aa7>: Abbrev Number: 85 (DW_TAG_subprogram)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x1357): nextTone
    <aac>   DW_AT_decl_file   : 6
    <aad>   DW_AT_decl_line   : 162
    <aae>   DW_AT_declaration : 1
 <2><aaf>: Abbrev Number: 136 (DW_TAG_subprogram)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x388): tone
    <ab5>   DW_AT_decl_file   : 6
    <ab6>   DW_AT_decl_line   : 73
    <ab7>   DW_AT_declaration : 1
 <3><ab8>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ab9>   DW_AT_type        : <0xdec>
 <3><abd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <abe>   DW_AT_type        : <0xdec>
 <3><ac2>: Abbrev Number: 0
 <2><ac3>: Abbrev Number: 0
 <1><ac4>: Abbrev Number: 95 (DW_TAG_structure_type)
    <ac5>   DW_AT_name        : (indirect string, offset: 0xd10): Print
    <ac9>   DW_AT_byte_size   : 4
    <aca>   DW_AT_decl_file   : 19
    <acb>   DW_AT_decl_line   : 37
    <acc>   DW_AT_containing_type: <0xac4>
    <ad0>   DW_AT_sibling     : <0xaf1>
 <2><ad4>: Abbrev Number: 113 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xd0a): _vptr.Print
    <ad9>   DW_AT_type        : <0xb06>
    <add>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <ae0>   DW_AT_artificial  : 1
 <2><ae1>: Abbrev Number: 58 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x43d): write_error
    <ae6>   DW_AT_decl_file   : 19
    <ae7>   DW_AT_decl_line   : 40
    <ae8>   DW_AT_type        : <0xafe>
    <aec>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <aef>   DW_AT_accessibility: 3	(private)
 <2><af0>: Abbrev Number: 0
 <1><af1>: Abbrev Number: 137 (DW_TAG_subroutine_type)
    <af3>   DW_AT_type        : <0xafe>
    <af7>   DW_AT_sibling     : <0xafe>
 <2><afb>: Abbrev Number: 138 (DW_TAG_unspecified_parameters)
 <2><afd>: Abbrev Number: 0
 <1><afe>: Abbrev Number: 139 (DW_TAG_base_type)
    <b00>   DW_AT_byte_size   : 2
    <b01>   DW_AT_encoding    : 5	(signed)
    <b02>   DW_AT_name        : int
 <1><b06>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <b07>   DW_AT_byte_size   : 2
    <b08>   DW_AT_type        : <0xb0c>
 <1><b0c>: Abbrev Number: 140 (DW_TAG_pointer_type)
    <b0e>   DW_AT_byte_size   : 2
    <b0f>   DW_AT_name        : (indirect string, offset: 0x4b0): __vtbl_ptr_type
    <b13>   DW_AT_type        : <0xaf1>
 <1><b17>: Abbrev Number: 95 (DW_TAG_structure_type)
    <b18>   DW_AT_name        : (indirect string, offset: 0xf3f): Stream
    <b1c>   DW_AT_byte_size   : 12
    <b1d>   DW_AT_decl_file   : 26
    <b1e>   DW_AT_decl_line   : 49
    <b1f>   DW_AT_containing_type: <0xb4f>
    <b23>   DW_AT_sibling     : <0xb4f>
 <2><b27>: Abbrev Number: 114 (DW_TAG_inheritance)
    <b28>   DW_AT_type        : <0xb4f>
    <b2c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <b2f>   DW_AT_accessibility: 1	(public)
 <2><b30>: Abbrev Number: 58 (DW_TAG_member)
    <b31>   DW_AT_name        : (indirect string, offset: 0x112e): _timeout
    <b35>   DW_AT_decl_file   : 26
    <b36>   DW_AT_decl_line   : 52
    <b37>   DW_AT_type        : <0xb7a>
    <b3b>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <b3e>   DW_AT_accessibility: 2	(protected)
 <2><b3f>: Abbrev Number: 58 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0x1f1d): _startMillis
    <b44>   DW_AT_decl_file   : 26
    <b45>   DW_AT_decl_line   : 53
    <b46>   DW_AT_type        : <0xb7a>
    <b4a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <b4d>   DW_AT_accessibility: 2	(protected)
 <2><b4e>: Abbrev Number: 0
 <1><b4f>: Abbrev Number: 141 (DW_TAG_structure_type)
    <b51>   DW_AT_name        : (indirect string, offset: 0xd10): Print
    <b55>   DW_AT_declaration : 1
    <b56>   DW_AT_sibling     : <0xb7a>
 <2><b5a>: Abbrev Number: 142 (DW_TAG_subprogram)
    <b5c>   DW_AT_external    : 1
    <b5d>   DW_AT_name        : (indirect string, offset: 0x20c6): setWriteError
    <b61>   DW_AT_decl_file   : 19
    <b62>   DW_AT_decl_line   : 44
    <b63>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x209f): _ZN5Print13setWriteErrorEi
    <b67>   DW_AT_accessibility: 2	(protected)
    <b68>   DW_AT_declaration : 1
    <b69>   DW_AT_object_pointer: <0xb6d>
 <3><b6d>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <b6e>   DW_AT_type        : <0x6aee>
    <b72>   DW_AT_artificial  : 1
 <3><b73>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <b74>   DW_AT_type        : <0xafe>
 <3><b78>: Abbrev Number: 0
 <2><b79>: Abbrev Number: 0
 <1><b7a>: Abbrev Number: 54 (DW_TAG_base_type)
    <b7b>   DW_AT_byte_size   : 4
    <b7c>   DW_AT_encoding    : 7	(unsigned)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x196b): long unsigned int
 <1><b81>: Abbrev Number: 44 (DW_TAG_typedef)
    <b82>   DW_AT_name        : (indirect string, offset: 0x8f8): uint8_t
    <b86>   DW_AT_decl_file   : 28
    <b87>   DW_AT_decl_line   : 126
    <b88>   DW_AT_type        : <0xa32>
 <1><b8c>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <b8d>   DW_AT_type        : <0xb81>
 <1><b91>: Abbrev Number: 7 (DW_TAG_const_type)
    <b92>   DW_AT_type        : <0xb81>
 <1><b96>: Abbrev Number: 95 (DW_TAG_structure_type)
    <b97>   DW_AT_name        : (indirect string, offset: 0x15dd): Serial_
    <b9b>   DW_AT_byte_size   : 80
    <b9c>   DW_AT_decl_file   : 27
    <b9d>   DW_AT_decl_line   : 90
    <b9e>   DW_AT_containing_type: <0xb4f>
    <ba2>   DW_AT_sibling     : <0xd41>
 <2><ba6>: Abbrev Number: 114 (DW_TAG_inheritance)
    <ba7>   DW_AT_type        : <0xb17>
    <bab>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <bae>   DW_AT_accessibility: 1	(public)
 <2><baf>: Abbrev Number: 58 (DW_TAG_member)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x1d9d): peek_buffer
    <bb4>   DW_AT_decl_file   : 27
    <bb5>   DW_AT_decl_line   : 93
    <bb6>   DW_AT_type        : <0xafe>
    <bba>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <bbd>   DW_AT_accessibility: 3	(private)
 <2><bbe>: Abbrev Number: 12 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x50f): _rx_buffer_head
    <bc3>   DW_AT_decl_file   : 27
    <bc4>   DW_AT_decl_line   : 110
    <bc5>   DW_AT_type        : <0xb8c>
    <bc9>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><bcc>: Abbrev Number: 12 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x1609): _rx_buffer_tail
    <bd1>   DW_AT_decl_file   : 27
    <bd2>   DW_AT_decl_line   : 111
    <bd3>   DW_AT_type        : <0xb8c>
    <bd7>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
 <2><bda>: Abbrev Number: 12 (DW_TAG_member)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x198c): _rx_buffer
    <bdf>   DW_AT_decl_file   : 27
    <be0>   DW_AT_decl_line   : 112
    <be1>   DW_AT_type        : <0xd41>
    <be5>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><be8>: Abbrev Number: 90 (DW_TAG_subprogram)
    <be9>   DW_AT_name        : (indirect string, offset: 0xd39): __base_ctor 
    <bed>   DW_AT_decl_file   : 27
    <bee>   DW_AT_decl_line   : 95
    <bef>   DW_AT_declaration : 1
    <bf0>   DW_AT_object_pointer: <0xbf8>
    <bf4>   DW_AT_sibling     : <0xbff>
 <3><bf8>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <bf9>   DW_AT_type        : <0x22f9>
    <bfd>   DW_AT_artificial  : 1
 <3><bfe>: Abbrev Number: 0
 <2><bff>: Abbrev Number: 91 (DW_TAG_subprogram)
    <c00>   DW_AT_name        : (indirect string, offset: 0x11eb): write
    <c04>   DW_AT_decl_file   : 4
    <c05>   DW_AT_decl_line   : 216
    <c06>   DW_AT_type        : <0x112c>
    <c0a>   DW_AT_virtuality  : 1	(virtual)
    <c0b>   DW_AT_vtable_elem_location: 2 byte block: 10 0 	(DW_OP_constu: 0)
    <c0e>   DW_AT_containing_type: <0xb96>
    <c12>   DW_AT_declaration : 1
    <c13>   DW_AT_object_pointer: <0xc1b>
    <c17>   DW_AT_sibling     : <0xc27>
 <3><c1b>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c1c>   DW_AT_type        : <0x22f9>
    <c20>   DW_AT_artificial  : 1
 <3><c21>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <c22>   DW_AT_type        : <0xb81>
 <3><c26>: Abbrev Number: 0
 <2><c27>: Abbrev Number: 143 (DW_TAG_subprogram)
    <c29>   DW_AT_name        : (indirect string, offset: 0x1a89): flush
    <c2d>   DW_AT_decl_file   : 4
    <c2e>   DW_AT_decl_line   : 211
    <c2f>   DW_AT_virtuality  : 1	(virtual)
    <c30>   DW_AT_vtable_elem_location: 2 byte block: 10 3 	(DW_OP_constu: 3)
    <c33>   DW_AT_containing_type: <0xb96>
    <c37>   DW_AT_declaration : 1
    <c38>   DW_AT_object_pointer: <0xc40>
    <c3c>   DW_AT_sibling     : <0xc47>
 <3><c40>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c41>   DW_AT_type        : <0x22f9>
    <c45>   DW_AT_artificial  : 1
 <3><c46>: Abbrev Number: 0
 <2><c47>: Abbrev Number: 91 (DW_TAG_subprogram)
    <c48>   DW_AT_name        : (indirect string, offset: 0x1e63): availableForWrite
    <c4c>   DW_AT_decl_file   : 4
    <c4d>   DW_AT_decl_line   : 206
    <c4e>   DW_AT_type        : <0xafe>
    <c52>   DW_AT_virtuality  : 1	(virtual)
    <c53>   DW_AT_vtable_elem_location: 2 byte block: 10 2 	(DW_OP_constu: 2)
    <c56>   DW_AT_containing_type: <0xb96>
    <c5a>   DW_AT_declaration : 1
    <c5b>   DW_AT_object_pointer: <0xc63>
    <c5f>   DW_AT_sibling     : <0xc6a>
 <3><c63>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c64>   DW_AT_type        : <0x22f9>
    <c68>   DW_AT_artificial  : 1
 <3><c69>: Abbrev Number: 0
 <2><c6a>: Abbrev Number: 115 (DW_TAG_subprogram)
    <c6b>   DW_AT_name        : (indirect string, offset: 0xbd1): _ZN7Serial_4readEv.part.2
    <c6f>   DW_AT_type        : <0xafe>
    <c73>   DW_AT_artificial  : 1
    <c74>   DW_AT_declaration : 1
 <2><c75>: Abbrev Number: 91 (DW_TAG_subprogram)
    <c76>   DW_AT_name        : (indirect string, offset: 0x21b7): read
    <c7a>   DW_AT_decl_file   : 4
    <c7b>   DW_AT_decl_line   : 196
    <c7c>   DW_AT_type        : <0xafe>
    <c80>   DW_AT_virtuality  : 1	(virtual)
    <c81>   DW_AT_vtable_elem_location: 2 byte block: 10 5 	(DW_OP_constu: 5)
    <c84>   DW_AT_containing_type: <0xb96>
    <c88>   DW_AT_declaration : 1
    <c89>   DW_AT_object_pointer: <0xc91>
    <c8d>   DW_AT_sibling     : <0xc98>
 <3><c91>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c92>   DW_AT_type        : <0x22f9>
    <c96>   DW_AT_artificial  : 1
 <3><c97>: Abbrev Number: 0
 <2><c98>: Abbrev Number: 91 (DW_TAG_subprogram)
    <c99>   DW_AT_name        : (indirect string, offset: 0x190f): peek
    <c9d>   DW_AT_decl_file   : 4
    <c9e>   DW_AT_decl_line   : 189
    <c9f>   DW_AT_type        : <0xafe>
    <ca3>   DW_AT_virtuality  : 1	(virtual)
    <ca4>   DW_AT_vtable_elem_location: 2 byte block: 10 6 	(DW_OP_constu: 6)
    <ca7>   DW_AT_containing_type: <0xb96>
    <cab>   DW_AT_declaration : 1
    <cac>   DW_AT_object_pointer: <0xcb4>
    <cb0>   DW_AT_sibling     : <0xcbb>
 <3><cb4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <cb5>   DW_AT_type        : <0x22f9>
    <cb9>   DW_AT_artificial  : 1
 <3><cba>: Abbrev Number: 0
 <2><cbb>: Abbrev Number: 115 (DW_TAG_subprogram)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x94a): _ZN7Serial_9availableEv.part.1
    <cc0>   DW_AT_type        : <0xafe>
    <cc4>   DW_AT_artificial  : 1
    <cc5>   DW_AT_declaration : 1
 <2><cc6>: Abbrev Number: 91 (DW_TAG_subprogram)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x1188): available
    <ccb>   DW_AT_decl_file   : 4
    <ccc>   DW_AT_decl_line   : 181
    <ccd>   DW_AT_type        : <0xafe>
    <cd1>   DW_AT_virtuality  : 1	(virtual)
    <cd2>   DW_AT_vtable_elem_location: 2 byte block: 10 4 	(DW_OP_constu: 4)
    <cd5>   DW_AT_containing_type: <0xb96>
    <cd9>   DW_AT_declaration : 1
    <cda>   DW_AT_object_pointer: <0xce2>
    <cde>   DW_AT_sibling     : <0xce9>
 <3><ce2>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <ce3>   DW_AT_type        : <0x22f9>
    <ce7>   DW_AT_artificial  : 1
 <3><ce8>: Abbrev Number: 0
 <2><ce9>: Abbrev Number: 144 (DW_TAG_subprogram)
    <ceb>   DW_AT_name        : (indirect string, offset: 0x1a10): _ZN7Serial_5writeEPKhj.part.4
    <cef>   DW_AT_type        : <0x112c>
    <cf3>   DW_AT_virtuality  : 1	(virtual)
    <cf4>   DW_AT_vtable_elem_location: 2 byte block: 10 1 	(DW_OP_constu: 1)
    <cf7>   DW_AT_containing_type: <0xb96>
    <cfb>   DW_AT_artificial  : 1
    <cfc>   DW_AT_declaration : 1
    <cfd>   DW_AT_object_pointer: <0xd05>
    <d01>   DW_AT_sibling     : <0xd16>
 <3><d05>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <d06>   DW_AT_type        : <0x22f9>
    <d0a>   DW_AT_artificial  : 1
 <3><d0b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d0c>   DW_AT_type        : <0x1057>
 <3><d10>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d11>   DW_AT_type        : <0x112c>
 <3><d15>: Abbrev Number: 0
 <2><d16>: Abbrev Number: 145 (DW_TAG_subprogram)
    <d18>   DW_AT_name        : (indirect string, offset: 0x11eb): write
    <d1c>   DW_AT_decl_file   : 4
    <d1d>   DW_AT_decl_line   : 221
    <d1e>   DW_AT_type        : <0x112c>
    <d22>   DW_AT_virtuality  : 1	(virtual)
    <d23>   DW_AT_vtable_elem_location: 2 byte block: 10 1 	(DW_OP_constu: 1)
    <d26>   DW_AT_containing_type: <0xb96>
    <d2a>   DW_AT_declaration : 1
    <d2b>   DW_AT_object_pointer: <0xd2f>
 <3><d2f>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <d30>   DW_AT_type        : <0x22f9>
    <d34>   DW_AT_artificial  : 1
 <3><d35>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d36>   DW_AT_type        : <0x1057>
 <3><d3a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d3b>   DW_AT_type        : <0x112c>
 <3><d3f>: Abbrev Number: 0
 <2><d40>: Abbrev Number: 0
 <1><d41>: Abbrev Number: 11 (DW_TAG_array_type)
    <d42>   DW_AT_type        : <0xa32>
    <d46>   DW_AT_sibling     : <0xd51>
 <2><d4a>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <d4b>   DW_AT_type        : <0xd51>
    <d4f>   DW_AT_upper_bound : 63
 <2><d50>: Abbrev Number: 0
 <1><d51>: Abbrev Number: 54 (DW_TAG_base_type)
    <d52>   DW_AT_byte_size   : 2
    <d53>   DW_AT_encoding    : 7	(unsigned)
    <d54>   DW_AT_name        : (indirect string, offset: 0x1970): unsigned int
 <1><d58>: Abbrev Number: 94 (DW_TAG_typedef)
    <d59>   DW_AT_name        : u32
    <d5d>   DW_AT_decl_file   : 27
    <d5e>   DW_AT_decl_line   : 31
    <d5f>   DW_AT_type        : <0xb7a>
 <1><d63>: Abbrev Number: 44 (DW_TAG_typedef)
    <d64>   DW_AT_name        : (indirect string, offset: 0xd17): LineInfo
    <d68>   DW_AT_decl_file   : 4
    <d69>   DW_AT_decl_line   : 32
    <d6a>   DW_AT_type        : <0xd73>
 <1><d6e>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <d6f>   DW_AT_type        : <0xd63>
 <1><d73>: Abbrev Number: 63 (DW_TAG_structure_type)
    <d74>   DW_AT_name        : (indirect string, offset: 0xd17): LineInfo
    <d78>   DW_AT_byte_size   : 8
    <d79>   DW_AT_decl_file   : 4
    <d7a>   DW_AT_decl_line   : 26
    <d7b>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xd16): 8LineInfo
    <d7f>   DW_AT_sibling     : <0xdca>
 <2><d83>: Abbrev Number: 12 (DW_TAG_member)
    <d84>   DW_AT_name        : (indirect string, offset: 0x21a6): dwDTERate
    <d88>   DW_AT_decl_file   : 4
    <d89>   DW_AT_decl_line   : 27
    <d8a>   DW_AT_type        : <0xd58>
    <d8e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><d91>: Abbrev Number: 12 (DW_TAG_member)
    <d92>   DW_AT_name        : (indirect string, offset: 0x219a): bCharFormat
    <d96>   DW_AT_decl_file   : 4
    <d97>   DW_AT_decl_line   : 28
    <d98>   DW_AT_type        : <0xa1e>
    <d9c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><d9f>: Abbrev Number: 12 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x20ba): bParityType
    <da4>   DW_AT_decl_file   : 4
    <da5>   DW_AT_decl_line   : 29
    <da6>   DW_AT_type        : <0xa1e>
    <daa>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><dad>: Abbrev Number: 12 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0xf09): bDataBits
    <db2>   DW_AT_decl_file   : 4
    <db3>   DW_AT_decl_line   : 30
    <db4>   DW_AT_type        : <0xa1e>
    <db8>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><dbb>: Abbrev Number: 12 (DW_TAG_member)
    <dbc>   DW_AT_name        : (indirect string, offset: 0xd4f): lineState
    <dc0>   DW_AT_decl_file   : 4
    <dc1>   DW_AT_decl_line   : 31
    <dc2>   DW_AT_type        : <0xa1e>
    <dc6>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><dc9>: Abbrev Number: 0
 <1><dca>: Abbrev Number: 48 (DW_TAG_structure_type)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x1663): USBDevice_
    <dcf>   DW_AT_byte_size   : 1
    <dd0>   DW_AT_decl_file   : 30
    <dd1>   DW_AT_decl_line   : 58
    <dd2>   DW_AT_sibling     : <0xdec>
 <2><dd6>: Abbrev Number: 146 (DW_TAG_subprogram)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x158e): attach
    <ddc>   DW_AT_decl_file   : 2
    <ddd>   DW_AT_decl_line   : 809
    <ddf>   DW_AT_declaration : 1
    <de0>   DW_AT_object_pointer: <0xde4>
 <3><de4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <de5>   DW_AT_type        : <0x1f54>
    <de9>   DW_AT_artificial  : 1
 <3><dea>: Abbrev Number: 0
 <2><deb>: Abbrev Number: 0
 <1><dec>: Abbrev Number: 44 (DW_TAG_typedef)
    <ded>   DW_AT_name        : (indirect string, offset: 0xaa4): uint16_t
    <df1>   DW_AT_decl_file   : 28
    <df2>   DW_AT_decl_line   : 128
    <df3>   DW_AT_type        : <0xd51>
 <1><df7>: Abbrev Number: 7 (DW_TAG_const_type)
    <df8>   DW_AT_type        : <0xdec>
 <1><dfc>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <dfd>   DW_AT_type        : <0xdec>
 <1><e01>: Abbrev Number: 48 (DW_TAG_structure_type)
    <e02>   DW_AT_name        : (indirect string, offset: 0x1f98): Arduboy2Audio
    <e06>   DW_AT_byte_size   : 1
    <e07>   DW_AT_decl_file   : 31
    <e08>   DW_AT_decl_line   : 73
    <e09>   DW_AT_sibling     : <0xe42>
 <2><e0d>: Abbrev Number: 147 (DW_TAG_subprogram)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xdad): enabled
    <e13>   DW_AT_decl_file   : 1
    <e14>   DW_AT_decl_line   : 56
    <e15>   DW_AT_type        : <0x1c0a>
    <e19>   DW_AT_declaration : 1
 <2><e1a>: Abbrev Number: 116 (DW_TAG_subprogram)
    <e1b>   DW_AT_name        : off
    <e1f>   DW_AT_decl_file   : 1
    <e20>   DW_AT_decl_line   : 23
    <e21>   DW_AT_declaration : 1
 <2><e22>: Abbrev Number: 116 (DW_TAG_subprogram)
    <e23>   DW_AT_name        : on
    <e26>   DW_AT_decl_file   : 1
    <e27>   DW_AT_decl_line   : 11
    <e28>   DW_AT_declaration : 1
 <2><e29>: Abbrev Number: 85 (DW_TAG_subprogram)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x19fc): saveOnOff
    <e2e>   DW_AT_decl_file   : 1
    <e2f>   DW_AT_decl_line   : 43
    <e30>   DW_AT_declaration : 1
 <2><e31>: Abbrev Number: 85 (DW_TAG_subprogram)
    <e32>   DW_AT_name        : (indirect string, offset: 0x1fcb): toggle
    <e36>   DW_AT_decl_file   : 1
    <e37>   DW_AT_decl_line   : 35
    <e38>   DW_AT_declaration : 1
 <2><e39>: Abbrev Number: 85 (DW_TAG_subprogram)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x1700): begin
    <e3e>   DW_AT_decl_file   : 1
    <e3f>   DW_AT_decl_line   : 48
    <e40>   DW_AT_declaration : 1
 <2><e41>: Abbrev Number: 0
 <1><e42>: Abbrev Number: 82 (DW_TAG_structure_type)
    <e43>   DW_AT_name        : (indirect string, offset: 0x1208): Arduboy2Core
    <e47>   DW_AT_byte_size   : 1
    <e48>   DW_AT_decl_file   : 32
    <e49>   DW_AT_decl_line   : 513
    <e4b>   DW_AT_sibling     : <0xf4d>
 <2><e4f>: Abbrev Number: 84 (DW_TAG_subprogram)
    <e50>   DW_AT_name        : (indirect string, offset: 0x1595): sendLCDCommand
    <e54>   DW_AT_decl_file   : 5
    <e55>   DW_AT_decl_line   : 1116
    <e57>   DW_AT_declaration : 1
    <e58>   DW_AT_sibling     : <0xe62>
 <3><e5c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e5d>   DW_AT_type        : <0xb81>
 <3><e61>: Abbrev Number: 0
 <2><e62>: Abbrev Number: 84 (DW_TAG_subprogram)
    <e63>   DW_AT_name        : (indirect string, offset: 0x1f50): digitalWriteRGB
    <e67>   DW_AT_decl_file   : 5
    <e68>   DW_AT_decl_line   : 1285
    <e6a>   DW_AT_declaration : 1
    <e6b>   DW_AT_sibling     : <0xe7f>
 <3><e6f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e70>   DW_AT_type        : <0xb81>
 <3><e74>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e75>   DW_AT_type        : <0xb81>
 <3><e79>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e7a>   DW_AT_type        : <0xb81>
 <3><e7e>: Abbrev Number: 0
 <2><e7f>: Abbrev Number: 84 (DW_TAG_subprogram)
    <e80>   DW_AT_name        : (indirect string, offset: 0x1f50): digitalWriteRGB
    <e84>   DW_AT_decl_file   : 5
    <e85>   DW_AT_decl_line   : 1311
    <e87>   DW_AT_declaration : 1
    <e88>   DW_AT_sibling     : <0xe97>
 <3><e8c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e8d>   DW_AT_type        : <0xb81>
 <3><e91>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e92>   DW_AT_type        : <0xb81>
 <3><e96>: Abbrev Number: 0
 <2><e97>: Abbrev Number: 84 (DW_TAG_subprogram)
    <e98>   DW_AT_name        : (indirect string, offset: 0x1da9): paintScreen
    <e9c>   DW_AT_decl_file   : 5
    <e9d>   DW_AT_decl_line   : 705
    <e9f>   DW_AT_declaration : 1
    <ea0>   DW_AT_sibling     : <0xeaf>
 <3><ea4>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ea5>   DW_AT_type        : <0x2003>
 <3><ea9>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <eaa>   DW_AT_type        : <0x1c0a>
 <3><eae>: Abbrev Number: 0
 <2><eaf>: Abbrev Number: 84 (DW_TAG_subprogram)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x1075): delayByte
    <eb4>   DW_AT_decl_file   : 5
    <eb5>   DW_AT_decl_line   : 1400
    <eb7>   DW_AT_declaration : 1
    <eb8>   DW_AT_sibling     : <0xec2>
 <3><ebc>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ebd>   DW_AT_type        : <0xb81>
 <3><ec1>: Abbrev Number: 0
 <2><ec2>: Abbrev Number: 148 (DW_TAG_subprogram)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x192e): buttonsState
    <ec8>   DW_AT_decl_file   : 5
    <ec9>   DW_AT_decl_line   : 1337
    <ecb>   DW_AT_type        : <0xb81>
    <ecf>   DW_AT_declaration : 1
 <2><ed0>: Abbrev Number: 84 (DW_TAG_subprogram)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x1923): delayShort
    <ed5>   DW_AT_decl_file   : 5
    <ed6>   DW_AT_decl_line   : 1391
    <ed8>   DW_AT_declaration : 1
    <ed9>   DW_AT_sibling     : <0xee3>
 <3><edd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ede>   DW_AT_type        : <0xdec>
 <3><ee2>: Abbrev Number: 0
 <2><ee3>: Abbrev Number: 85 (DW_TAG_subprogram)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xa7f): boot
    <ee8>   DW_AT_decl_file   : 5
    <ee9>   DW_AT_decl_line   : 157
    <eea>   DW_AT_declaration : 1
 <2><eeb>: Abbrev Number: 104 (DW_TAG_subprogram)
    <eec>   DW_AT_name        : (indirect string, offset: 0x185c): bootPowerSaving
    <ef0>   DW_AT_decl_file   : 5
    <ef1>   DW_AT_decl_line   : 521
    <ef3>   DW_AT_accessibility: 2	(protected)
    <ef4>   DW_AT_declaration : 1
 <2><ef5>: Abbrev Number: 104 (DW_TAG_subprogram)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x16af): bootOLED
    <efa>   DW_AT_decl_file   : 5
    <efb>   DW_AT_decl_line   : 361
    <efd>   DW_AT_accessibility: 2	(protected)
    <efe>   DW_AT_declaration : 1
 <2><eff>: Abbrev Number: 104 (DW_TAG_subprogram)
    <f00>   DW_AT_name        : (indirect string, offset: 0x48e): bootSPI
    <f04>   DW_AT_decl_file   : 5
    <f05>   DW_AT_decl_line   : 429
    <f07>   DW_AT_accessibility: 2	(protected)
    <f08>   DW_AT_declaration : 1
 <2><f09>: Abbrev Number: 149 (DW_TAG_subprogram)
    <f0b>   DW_AT_name        : (indirect string, offset: 0xadb): bootPins
    <f0f>   DW_AT_decl_file   : 5
    <f10>   DW_AT_decl_line   : 192
    <f11>   DW_AT_accessibility: 2	(protected)
    <f12>   DW_AT_declaration : 1
 <2><f13>: Abbrev Number: 84 (DW_TAG_subprogram)
    <f14>   DW_AT_name        : (indirect string, offset: 0x1c8e): SPItransfer
    <f18>   DW_AT_decl_file   : 5
    <f19>   DW_AT_decl_line   : 437
    <f1b>   DW_AT_declaration : 1
    <f1c>   DW_AT_sibling     : <0xf26>
 <3><f20>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <f21>   DW_AT_type        : <0xb81>
 <3><f25>: Abbrev Number: 0
 <2><f26>: Abbrev Number: 150 (DW_TAG_subprogram)
    <f28>   DW_AT_name        : (indirect string, offset: 0x1d8d): idle
    <f2c>   DW_AT_decl_file   : 5
    <f2d>   DW_AT_decl_line   : 514
    <f2f>   DW_AT_declaration : 1
 <2><f30>: Abbrev Number: 117 (DW_TAG_subprogram)
    <f31>   DW_AT_external    : 1
    <f32>   DW_AT_name        : (indirect string, offset: 0x1263): LCDCommandMode
    <f36>   DW_AT_decl_file   : 25
    <f37>   DW_AT_decl_line   : 575
    <f39>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xd59): _ZN12Arduboy2Core14LCDCommandModeEv
    <f3d>   DW_AT_declaration : 1
 <2><f3e>: Abbrev Number: 117 (DW_TAG_subprogram)
    <f3f>   DW_AT_external    : 1
    <f40>   DW_AT_name        : (indirect string, offset: 0x1102): LCDDataMode
    <f44>   DW_AT_decl_file   : 25
    <f45>   DW_AT_decl_line   : 545
    <f47>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1097): _ZN12Arduboy2Core11LCDDataModeEv
    <f4b>   DW_AT_declaration : 1
 <2><f4c>: Abbrev Number: 0
 <1><f4d>: Abbrev Number: 44 (DW_TAG_typedef)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xaa5): int16_t
    <f52>   DW_AT_decl_file   : 28
    <f53>   DW_AT_decl_line   : 127
    <f54>   DW_AT_type        : <0xafe>
 <1><f58>: Abbrev Number: 7 (DW_TAG_const_type)
    <f59>   DW_AT_type        : <0xf4d>
 <1><f5d>: Abbrev Number: 48 (DW_TAG_structure_type)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xc28): dvec3
    <f62>   DW_AT_byte_size   : 6
    <f63>   DW_AT_decl_file   : 10
    <f64>   DW_AT_decl_line   : 255
    <f65>   DW_AT_sibling     : <0xf8e>
 <2><f69>: Abbrev Number: 29 (DW_TAG_member)
    <f6a>   DW_AT_name        : x
    <f6c>   DW_AT_decl_file   : 10
    <f6d>   DW_AT_decl_line   : 255
    <f6e>   DW_AT_type        : <0xf4d>
    <f72>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><f75>: Abbrev Number: 29 (DW_TAG_member)
    <f76>   DW_AT_name        : y
    <f78>   DW_AT_decl_file   : 10
    <f79>   DW_AT_decl_line   : 255
    <f7a>   DW_AT_type        : <0xf4d>
    <f7e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><f81>: Abbrev Number: 29 (DW_TAG_member)
    <f82>   DW_AT_name        : z
    <f84>   DW_AT_decl_file   : 10
    <f85>   DW_AT_decl_line   : 255
    <f86>   DW_AT_type        : <0xf4d>
    <f8a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><f8d>: Abbrev Number: 0
 <1><f8e>: Abbrev Number: 48 (DW_TAG_structure_type)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x1f2a): LockEP
    <f93>   DW_AT_byte_size   : 1
    <f94>   DW_AT_decl_file   : 2
    <f95>   DW_AT_decl_line   : 197
    <f96>   DW_AT_sibling     : <0xfdf>
 <2><f9a>: Abbrev Number: 58 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0xb91): _sreg
    <f9f>   DW_AT_decl_file   : 2
    <fa0>   DW_AT_decl_line   : 199
    <fa1>   DW_AT_type        : <0xa1e>
    <fa5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <fa8>   DW_AT_accessibility: 3	(private)
 <2><fa9>: Abbrev Number: 90 (DW_TAG_subprogram)
    <faa>   DW_AT_name        : (indirect string, offset: 0xd39): __base_ctor 
    <fae>   DW_AT_decl_file   : 2
    <faf>   DW_AT_decl_line   : 201
    <fb0>   DW_AT_declaration : 1
    <fb1>   DW_AT_object_pointer: <0xfb9>
    <fb5>   DW_AT_sibling     : <0xfc5>
 <3><fb9>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <fba>   DW_AT_type        : <0x237b>
    <fbe>   DW_AT_artificial  : 1
 <3><fbf>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <fc0>   DW_AT_type        : <0xa1e>
 <3><fc4>: Abbrev Number: 0
 <2><fc5>: Abbrev Number: 151 (DW_TAG_subprogram)
    <fc7>   DW_AT_external    : 1
    <fc8>   DW_AT_name        : (indirect string, offset: 0x8d4): __base_dtor 
    <fcc>   DW_AT_decl_file   : 2
    <fcd>   DW_AT_decl_line   : 206
    <fce>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xd2a): _ZN6LockEPD2Ev
    <fd2>   DW_AT_declaration : 1
    <fd3>   DW_AT_object_pointer: <0xfd7>
 <3><fd7>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <fd8>   DW_AT_type        : <0x237b>
    <fdc>   DW_AT_artificial  : 1
 <3><fdd>: Abbrev Number: 0
 <2><fde>: Abbrev Number: 0
 <1><fdf>: Abbrev Number: 95 (DW_TAG_structure_type)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x12c3): PluggableUSBModule
    <fe4>   DW_AT_byte_size   : 10
    <fe5>   DW_AT_decl_file   : 33
    <fe6>   DW_AT_decl_line   : 28
    <fe7>   DW_AT_containing_type: <0xfdf>
    <feb>   DW_AT_sibling     : <0x1057>
 <2><fef>: Abbrev Number: 113 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x12bd): _vptr.PluggableUSBModule
    <ff4>   DW_AT_type        : <0xb06>
    <ff8>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <ffb>   DW_AT_artificial  : 1
 <2><ffc>: Abbrev Number: 58 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x13fb): pluggedInterface
    <1001>   DW_AT_decl_file   : 33
    <1002>   DW_AT_decl_line   : 40
    <1003>   DW_AT_type        : <0xb81>
    <1007>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <100a>   DW_AT_accessibility: 2	(protected)
 <2><100b>: Abbrev Number: 58 (DW_TAG_member)
    <100c>   DW_AT_name        : (indirect string, offset: 0x12a1): pluggedEndpoint
    <1010>   DW_AT_decl_file   : 33
    <1011>   DW_AT_decl_line   : 41
    <1012>   DW_AT_type        : <0xb81>
    <1016>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
    <1019>   DW_AT_accessibility: 2	(protected)
 <2><101a>: Abbrev Number: 58 (DW_TAG_member)
    <101b>   DW_AT_name        : (indirect string, offset: 0x8eb): numEndpoints
    <101f>   DW_AT_decl_file   : 33
    <1020>   DW_AT_decl_line   : 43
    <1021>   DW_AT_type        : <0xb91>
    <1025>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <1028>   DW_AT_accessibility: 2	(protected)
 <2><1029>: Abbrev Number: 58 (DW_TAG_member)
    <102a>   DW_AT_name        : (indirect string, offset: 0x10ea): numInterfaces
    <102e>   DW_AT_decl_file   : 33
    <102f>   DW_AT_decl_line   : 44
    <1030>   DW_AT_type        : <0xb91>
    <1034>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
    <1037>   DW_AT_accessibility: 2	(protected)
 <2><1038>: Abbrev Number: 58 (DW_TAG_member)
    <1039>   DW_AT_name        : (indirect string, offset: 0x207a): endpointType
    <103d>   DW_AT_decl_file   : 33
    <103e>   DW_AT_decl_line   : 45
    <103f>   DW_AT_type        : <0x1057>
    <1043>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
    <1046>   DW_AT_accessibility: 2	(protected)
 <2><1047>: Abbrev Number: 58 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0x217b): next
    <104c>   DW_AT_decl_file   : 33
    <104d>   DW_AT_decl_line   : 47
    <104e>   DW_AT_type        : <0x105d>
    <1052>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <1055>   DW_AT_accessibility: 2	(protected)
 <2><1056>: Abbrev Number: 0
 <1><1057>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <1058>   DW_AT_byte_size   : 2
    <1059>   DW_AT_type        : <0xb91>
 <1><105d>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <105e>   DW_AT_byte_size   : 2
    <105f>   DW_AT_type        : <0xfdf>
 <1><1063>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1064>   DW_AT_name        : (indirect string, offset: 0x71e): PluggableUSB_
    <1068>   DW_AT_byte_size   : 4
    <1069>   DW_AT_decl_file   : 33
    <106a>   DW_AT_decl_line   : 52
    <106b>   DW_AT_sibling     : <0x112c>
 <2><106f>: Abbrev Number: 58 (DW_TAG_member)
    <1070>   DW_AT_name        : (indirect string, offset: 0x49f): lastIf
    <1074>   DW_AT_decl_file   : 33
    <1075>   DW_AT_decl_line   : 62
    <1076>   DW_AT_type        : <0xb81>
    <107a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <107d>   DW_AT_accessibility: 3	(private)
 <2><107e>: Abbrev Number: 58 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0x1fd2): lastEp
    <1083>   DW_AT_decl_file   : 33
    <1084>   DW_AT_decl_line   : 63
    <1085>   DW_AT_type        : <0xb81>
    <1089>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
    <108c>   DW_AT_accessibility: 3	(private)
 <2><108d>: Abbrev Number: 58 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x1440): rootNode
    <1092>   DW_AT_decl_file   : 33
    <1093>   DW_AT_decl_line   : 64
    <1094>   DW_AT_type        : <0x105d>
    <1098>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <109b>   DW_AT_accessibility: 3	(private)
 <2><109c>: Abbrev Number: 90 (DW_TAG_subprogram)
    <109d>   DW_AT_name        : (indirect string, offset: 0xd39): __base_ctor 
    <10a1>   DW_AT_decl_file   : 3
    <10a2>   DW_AT_decl_line   : 106
    <10a3>   DW_AT_declaration : 1
    <10a4>   DW_AT_object_pointer: <0x10ac>
    <10a8>   DW_AT_sibling     : <0x10b3>
 <3><10ac>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10ad>   DW_AT_type        : <0x25a4>
    <10b1>   DW_AT_artificial  : 1
 <3><10b2>: Abbrev Number: 0
 <2><10b3>: Abbrev Number: 96 (DW_TAG_subprogram)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x458): getInterface
    <10b8>   DW_AT_decl_file   : 3
    <10b9>   DW_AT_decl_line   : 28
    <10ba>   DW_AT_type        : <0xafe>
    <10be>   DW_AT_declaration : 1
    <10bf>   DW_AT_object_pointer: <0x10c7>
    <10c3>   DW_AT_sibling     : <0x10d3>
 <3><10c7>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10c8>   DW_AT_type        : <0x25a4>
    <10cc>   DW_AT_artificial  : 1
 <3><10cd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <10ce>   DW_AT_type        : <0x2003>
 <3><10d2>: Abbrev Number: 0
 <2><10d3>: Abbrev Number: 96 (DW_TAG_subprogram)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x122d): getDescriptor
    <10d8>   DW_AT_decl_file   : 3
    <10d9>   DW_AT_decl_line   : 41
    <10da>   DW_AT_type        : <0xafe>
    <10de>   DW_AT_declaration : 1
    <10df>   DW_AT_object_pointer: <0x10e7>
    <10e3>   DW_AT_sibling     : <0x10f3>
 <3><10e7>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10e8>   DW_AT_type        : <0x25a4>
    <10ec>   DW_AT_artificial  : 1
 <3><10ed>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <10ee>   DW_AT_type        : <0x956b>
 <3><10f2>: Abbrev Number: 0
 <2><10f3>: Abbrev Number: 90 (DW_TAG_subprogram)
    <10f4>   DW_AT_name        : (indirect string, offset: 0x4ec): getShortName
    <10f8>   DW_AT_decl_file   : 3
    <10f9>   DW_AT_decl_line   : 53
    <10fa>   DW_AT_declaration : 1
    <10fb>   DW_AT_object_pointer: <0x1103>
    <10ff>   DW_AT_sibling     : <0x110f>
 <3><1103>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1104>   DW_AT_type        : <0x25a4>
    <1108>   DW_AT_artificial  : 1
 <3><1109>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <110a>   DW_AT_type        : <0x95ad>
 <3><110e>: Abbrev Number: 0
 <2><110f>: Abbrev Number: 118 (DW_TAG_subprogram)
    <1110>   DW_AT_name        : (indirect string, offset: 0x11f6): setup
    <1114>   DW_AT_decl_file   : 3
    <1115>   DW_AT_decl_line   : 62
    <1116>   DW_AT_type        : <0x1c0a>
    <111a>   DW_AT_declaration : 1
    <111b>   DW_AT_object_pointer: <0x111f>
 <3><111f>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1120>   DW_AT_type        : <0x25a4>
    <1124>   DW_AT_artificial  : 1
 <3><1125>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1126>   DW_AT_type        : <0x956b>
 <3><112a>: Abbrev Number: 0
 <2><112b>: Abbrev Number: 0
 <1><112c>: Abbrev Number: 44 (DW_TAG_typedef)
    <112d>   DW_AT_name        : (indirect string, offset: 0x396): size_t
    <1131>   DW_AT_decl_file   : 34
    <1132>   DW_AT_decl_line   : 216
    <1133>   DW_AT_type        : <0xd51>
 <1><1137>: Abbrev Number: 44 (DW_TAG_typedef)
    <1138>   DW_AT_name        : (indirect string, offset: 0x186d): USBSetup
    <113c>   DW_AT_decl_file   : 27
    <113d>   DW_AT_decl_line   : 170
    <113e>   DW_AT_type        : <0x1142>
 <1><1142>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1143>   DW_AT_name        : (indirect string, offset: 0x186d): USBSetup
    <1147>   DW_AT_byte_size   : 8
    <1148>   DW_AT_decl_file   : 27
    <1149>   DW_AT_decl_line   : 163
    <114a>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x186c): 8USBSetup
    <114e>   DW_AT_sibling     : <0x11a7>
 <2><1152>: Abbrev Number: 12 (DW_TAG_member)
    <1153>   DW_AT_name        : (indirect string, offset: 0xa16): bmRequestType
    <1157>   DW_AT_decl_file   : 27
    <1158>   DW_AT_decl_line   : 164
    <1159>   DW_AT_type        : <0xb81>
    <115d>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1160>: Abbrev Number: 12 (DW_TAG_member)
    <1161>   DW_AT_name        : (indirect string, offset: 0x1692): bRequest
    <1165>   DW_AT_decl_file   : 27
    <1166>   DW_AT_decl_line   : 165
    <1167>   DW_AT_type        : <0xb81>
    <116b>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><116e>: Abbrev Number: 12 (DW_TAG_member)
    <116f>   DW_AT_name        : (indirect string, offset: 0x66a): wValueL
    <1173>   DW_AT_decl_file   : 27
    <1174>   DW_AT_decl_line   : 166
    <1175>   DW_AT_type        : <0xb81>
    <1179>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><117c>: Abbrev Number: 12 (DW_TAG_member)
    <117d>   DW_AT_name        : (indirect string, offset: 0x64d): wValueH
    <1181>   DW_AT_decl_file   : 27
    <1182>   DW_AT_decl_line   : 167
    <1183>   DW_AT_type        : <0xb81>
    <1187>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><118a>: Abbrev Number: 12 (DW_TAG_member)
    <118b>   DW_AT_name        : (indirect string, offset: 0x1914): wIndex
    <118f>   DW_AT_decl_file   : 27
    <1190>   DW_AT_decl_line   : 168
    <1191>   DW_AT_type        : <0xdec>
    <1195>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1198>: Abbrev Number: 12 (DW_TAG_member)
    <1199>   DW_AT_name        : (indirect string, offset: 0xdd4): wLength
    <119d>   DW_AT_decl_file   : 27
    <119e>   DW_AT_decl_line   : 169
    <119f>   DW_AT_type        : <0xdec>
    <11a3>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><11a6>: Abbrev Number: 0
 <1><11a7>: Abbrev Number: 44 (DW_TAG_typedef)
    <11a8>   DW_AT_name        : (indirect string, offset: 0x186d): USBSetup
    <11ac>   DW_AT_decl_file   : 27
    <11ad>   DW_AT_decl_line   : 170
    <11ae>   DW_AT_type        : <0x11b2>
 <1><11b2>: Abbrev Number: 63 (DW_TAG_structure_type)
    <11b3>   DW_AT_name        : (indirect string, offset: 0x186d): USBSetup
    <11b7>   DW_AT_byte_size   : 8
    <11b8>   DW_AT_decl_file   : 27
    <11b9>   DW_AT_decl_line   : 163
    <11ba>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x186c): 8USBSetup
    <11be>   DW_AT_sibling     : <0x1217>
 <2><11c2>: Abbrev Number: 12 (DW_TAG_member)
    <11c3>   DW_AT_name        : (indirect string, offset: 0xa16): bmRequestType
    <11c7>   DW_AT_decl_file   : 27
    <11c8>   DW_AT_decl_line   : 164
    <11c9>   DW_AT_type        : <0xb81>
    <11cd>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><11d0>: Abbrev Number: 12 (DW_TAG_member)
    <11d1>   DW_AT_name        : (indirect string, offset: 0x1692): bRequest
    <11d5>   DW_AT_decl_file   : 27
    <11d6>   DW_AT_decl_line   : 165
    <11d7>   DW_AT_type        : <0xb81>
    <11db>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><11de>: Abbrev Number: 12 (DW_TAG_member)
    <11df>   DW_AT_name        : (indirect string, offset: 0x66a): wValueL
    <11e3>   DW_AT_decl_file   : 27
    <11e4>   DW_AT_decl_line   : 166
    <11e5>   DW_AT_type        : <0xb81>
    <11e9>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><11ec>: Abbrev Number: 12 (DW_TAG_member)
    <11ed>   DW_AT_name        : (indirect string, offset: 0x64d): wValueH
    <11f1>   DW_AT_decl_file   : 27
    <11f2>   DW_AT_decl_line   : 167
    <11f3>   DW_AT_type        : <0xb81>
    <11f7>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><11fa>: Abbrev Number: 12 (DW_TAG_member)
    <11fb>   DW_AT_name        : (indirect string, offset: 0x1914): wIndex
    <11ff>   DW_AT_decl_file   : 27
    <1200>   DW_AT_decl_line   : 168
    <1201>   DW_AT_type        : <0xdec>
    <1205>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1208>: Abbrev Number: 12 (DW_TAG_member)
    <1209>   DW_AT_name        : (indirect string, offset: 0xdd4): wLength
    <120d>   DW_AT_decl_file   : 27
    <120e>   DW_AT_decl_line   : 169
    <120f>   DW_AT_type        : <0xdec>
    <1213>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1216>: Abbrev Number: 0
 <1><1217>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1218>   DW_AT_name        : (indirect string, offset: 0x823): Arduboy2Base
    <121c>   DW_AT_byte_size   : 1
    <121d>   DW_AT_decl_file   : 35
    <121e>   DW_AT_decl_line   : 211
    <121f>   DW_AT_sibling     : <0x1234>
 <2><1223>: Abbrev Number: 152 (DW_TAG_subprogram)
    <1225>   DW_AT_name        : (indirect string, offset: 0x1c22): display
    <1229>   DW_AT_decl_file   : 36
    <122a>   DW_AT_decl_line   : 1042
    <122c>   DW_AT_declaration : 1
 <3><122d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <122e>   DW_AT_type        : <0x1c0a>
 <3><1232>: Abbrev Number: 0
 <2><1233>: Abbrev Number: 0
 <1><1234>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1235>   DW_AT_name        : (indirect string, offset: 0x1751): EEPROMClass
    <1239>   DW_AT_byte_size   : 1
    <123a>   DW_AT_decl_file   : 22
    <123b>   DW_AT_decl_line   : 116
    <123c>   DW_AT_sibling     : <0x126a>
 <2><1240>: Abbrev Number: 153 (DW_TAG_subprogram)
    <1242>   DW_AT_name        : (indirect string, offset: 0x1166): _ZN11EEPROMClass6updateEih.isra.1
    <1246>   DW_AT_artificial  : 1
    <1247>   DW_AT_declaration : 1
    <1248>   DW_AT_sibling     : <0x1257>
 <3><124c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <124d>   DW_AT_type        : <0xafe>
 <3><1251>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1252>   DW_AT_type        : <0xb81>
 <3><1256>: Abbrev Number: 0
 <2><1257>: Abbrev Number: 154 (DW_TAG_subprogram)
    <1259>   DW_AT_name        : (indirect string, offset: 0x10cb): _ZN11EEPROMClass4readEi.isra.0
    <125d>   DW_AT_type        : <0xb81>
    <1261>   DW_AT_artificial  : 1
    <1262>   DW_AT_declaration : 1
 <3><1263>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1264>   DW_AT_type        : <0xafe>
 <3><1268>: Abbrev Number: 0
 <2><1269>: Abbrev Number: 0
 <1><126a>: Abbrev Number: 48 (DW_TAG_structure_type)
    <126b>   DW_AT_name        : (indirect string, offset: 0x1728): EERef
    <126f>   DW_AT_byte_size   : 2
    <1270>   DW_AT_decl_file   : 22
    <1271>   DW_AT_decl_line   : 36
    <1272>   DW_AT_sibling     : <0x1302>
 <2><1276>: Abbrev Number: 12 (DW_TAG_member)
    <1277>   DW_AT_name        : (indirect string, offset: 0x205c): index
    <127b>   DW_AT_decl_file   : 22
    <127c>   DW_AT_decl_line   : 76
    <127d>   DW_AT_type        : <0xafe>
    <1281>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1284>: Abbrev Number: 96 (DW_TAG_subprogram)
    <1285>   DW_AT_name        : (indirect string, offset: 0x1964): update
    <1289>   DW_AT_decl_file   : 22
    <128a>   DW_AT_decl_line   : 59
    <128b>   DW_AT_type        : <0x9041>
    <128f>   DW_AT_declaration : 1
    <1290>   DW_AT_object_pointer: <0x1298>
    <1294>   DW_AT_sibling     : <0x12a4>
 <3><1298>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1299>   DW_AT_type        : <0x9047>
    <129d>   DW_AT_artificial  : 1
 <3><129e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <129f>   DW_AT_type        : <0xb81>
 <3><12a3>: Abbrev Number: 0
 <2><12a4>: Abbrev Number: 96 (DW_TAG_subprogram)
    <12a5>   DW_AT_name        : (indirect string, offset: 0x900): operator*
    <12a9>   DW_AT_decl_file   : 22
    <12aa>   DW_AT_decl_line   : 42
    <12ab>   DW_AT_type        : <0xb81>
    <12af>   DW_AT_declaration : 1
    <12b0>   DW_AT_object_pointer: <0x12b8>
    <12b4>   DW_AT_sibling     : <0x12bf>
 <3><12b8>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <12b9>   DW_AT_type        : <0x9075>
    <12bd>   DW_AT_artificial  : 1
 <3><12be>: Abbrev Number: 0
 <2><12bf>: Abbrev Number: 155 (DW_TAG_subprogram)
    <12c1>   DW_AT_external    : 1
    <12c2>   DW_AT_name        : (indirect string, offset: 0x1240): operator 3
    <12c6>   DW_AT_decl_file   : 22
    <12c7>   DW_AT_decl_line   : 43
    <12c8>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x13c9): _ZNK5EERefcvhEv
    <12cc>   DW_AT_type        : <0xb81>
    <12d0>   DW_AT_declaration : 1
    <12d1>   DW_AT_object_pointer: <0x12d9>
    <12d5>   DW_AT_sibling     : <0x12e0>
 <3><12d9>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <12da>   DW_AT_type        : <0x9075>
    <12de>   DW_AT_artificial  : 1
 <3><12df>: Abbrev Number: 0
 <2><12e0>: Abbrev Number: 119 (DW_TAG_subprogram)
    <12e1>   DW_AT_external    : 1
    <12e2>   DW_AT_name        : (indirect string, offset: 0x9ba): operator=
    <12e6>   DW_AT_decl_file   : 22
    <12e7>   DW_AT_decl_line   : 47
    <12e8>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xefb): _ZN5EERefaSEh
    <12ec>   DW_AT_type        : <0x9041>
    <12f0>   DW_AT_declaration : 1
    <12f1>   DW_AT_object_pointer: <0x12f5>
 <3><12f5>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <12f6>   DW_AT_type        : <0x9047>
    <12fa>   DW_AT_artificial  : 1
 <3><12fb>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <12fc>   DW_AT_type        : <0xb81>
 <3><1300>: Abbrev Number: 0
 <2><1301>: Abbrev Number: 0
 <1><1302>: Abbrev Number: 7 (DW_TAG_const_type)
    <1303>   DW_AT_type        : <0x126a>
 <1><1307>: Abbrev Number: 44 (DW_TAG_typedef)
    <1308>   DW_AT_name        : (indirect string, offset: 0x8f9): int8_t
    <130c>   DW_AT_decl_file   : 28
    <130d>   DW_AT_decl_line   : 125
    <130e>   DW_AT_type        : <0x1317>
 <1><1312>: Abbrev Number: 7 (DW_TAG_const_type)
    <1313>   DW_AT_type        : <0x1307>
 <1><1317>: Abbrev Number: 54 (DW_TAG_base_type)
    <1318>   DW_AT_byte_size   : 1
    <1319>   DW_AT_encoding    : 6	(signed char)
    <131a>   DW_AT_name        : (indirect string, offset: 0xa0a): signed char
 <1><131e>: Abbrev Number: 48 (DW_TAG_structure_type)
    <131f>   DW_AT_name        : (indirect string, offset: 0x1aac): array
    <1323>   DW_AT_byte_size   : 18
    <1324>   DW_AT_decl_file   : 10
    <1325>   DW_AT_decl_line   : 107
    <1326>   DW_AT_sibling     : <0x1341>
 <2><132a>: Abbrev Number: 29 (DW_TAG_member)
    <132b>   DW_AT_name        : d_
    <132e>   DW_AT_decl_file   : 10
    <132f>   DW_AT_decl_line   : 109
    <1330>   DW_AT_type        : <0x1346>
    <1334>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1337>: Abbrev Number: 156 (DW_TAG_subprogram)
    <1339>   DW_AT_name        : (indirect string, offset: 0x733): _ZNK5arrayIhLj18EE6verifyEj.isra.0
    <133d>   DW_AT_artificial  : 1
    <133e>   DW_AT_accessibility: 3	(private)
    <133f>   DW_AT_declaration : 1
 <2><1340>: Abbrev Number: 0
 <1><1341>: Abbrev Number: 7 (DW_TAG_const_type)
    <1342>   DW_AT_type        : <0x131e>
 <1><1346>: Abbrev Number: 11 (DW_TAG_array_type)
    <1347>   DW_AT_type        : <0xa32>
    <134b>   DW_AT_sibling     : <0x1356>
 <2><134f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1350>   DW_AT_type        : <0xd51>
    <1354>   DW_AT_upper_bound : 17
 <2><1355>: Abbrev Number: 0
 <1><1356>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1357>   DW_AT_name        : (indirect string, offset: 0xc22): dvec2
    <135b>   DW_AT_byte_size   : 4
    <135c>   DW_AT_decl_file   : 10
    <135d>   DW_AT_decl_line   : 252
    <135e>   DW_AT_sibling     : <0x137b>
 <2><1362>: Abbrev Number: 29 (DW_TAG_member)
    <1363>   DW_AT_name        : x
    <1365>   DW_AT_decl_file   : 10
    <1366>   DW_AT_decl_line   : 252
    <1367>   DW_AT_type        : <0xf4d>
    <136b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><136e>: Abbrev Number: 29 (DW_TAG_member)
    <136f>   DW_AT_name        : y
    <1371>   DW_AT_decl_file   : 10
    <1372>   DW_AT_decl_line   : 252
    <1373>   DW_AT_type        : <0xf4d>
    <1377>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><137a>: Abbrev Number: 0
 <1><137b>: Abbrev Number: 48 (DW_TAG_structure_type)
    <137c>   DW_AT_name        : (indirect string, offset: 0x1aac): array
    <1380>   DW_AT_byte_size   : 18
    <1381>   DW_AT_decl_file   : 10
    <1382>   DW_AT_decl_line   : 107
    <1383>   DW_AT_sibling     : <0x1395>
 <2><1387>: Abbrev Number: 29 (DW_TAG_member)
    <1388>   DW_AT_name        : d_
    <138b>   DW_AT_decl_file   : 10
    <138c>   DW_AT_decl_line   : 109
    <138d>   DW_AT_type        : <0x1395>
    <1391>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1394>: Abbrev Number: 0
 <1><1395>: Abbrev Number: 11 (DW_TAG_array_type)
    <1396>   DW_AT_type        : <0xafe>
    <139a>   DW_AT_sibling     : <0x13a5>
 <2><139e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <139f>   DW_AT_type        : <0xd51>
    <13a3>   DW_AT_upper_bound : 8
 <2><13a4>: Abbrev Number: 0
 <1><13a5>: Abbrev Number: 97 (DW_TAG_typedef)
    <13a6>   DW_AT_name        : (indirect string, offset: 0x139c): dmat3
    <13aa>   DW_AT_decl_file   : 10
    <13ab>   DW_AT_decl_line   : 257
    <13ad>   DW_AT_type        : <0x137b>
 <1><13b1>: Abbrev Number: 7 (DW_TAG_const_type)
    <13b2>   DW_AT_type        : <0x13a5>
 <1><13b6>: Abbrev Number: 48 (DW_TAG_structure_type)
    <13b7>   DW_AT_name        : (indirect string, offset: 0x1aac): array
    <13bb>   DW_AT_byte_size   : 9
    <13bc>   DW_AT_decl_file   : 10
    <13bd>   DW_AT_decl_line   : 107
    <13be>   DW_AT_sibling     : <0x13d0>
 <2><13c2>: Abbrev Number: 29 (DW_TAG_member)
    <13c3>   DW_AT_name        : d_
    <13c6>   DW_AT_decl_file   : 10
    <13c7>   DW_AT_decl_line   : 109
    <13c8>   DW_AT_type        : <0x13d0>
    <13cc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><13cf>: Abbrev Number: 0
 <1><13d0>: Abbrev Number: 11 (DW_TAG_array_type)
    <13d1>   DW_AT_type        : <0x1317>
    <13d5>   DW_AT_sibling     : <0x13e0>
 <2><13d9>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <13da>   DW_AT_type        : <0xd51>
    <13de>   DW_AT_upper_bound : 8
 <2><13df>: Abbrev Number: 0
 <1><13e0>: Abbrev Number: 97 (DW_TAG_typedef)
    <13e1>   DW_AT_name        : (indirect string, offset: 0x139d): mat3
    <13e5>   DW_AT_decl_file   : 10
    <13e6>   DW_AT_decl_line   : 256
    <13e8>   DW_AT_type        : <0x13b6>
 <1><13ec>: Abbrev Number: 7 (DW_TAG_const_type)
    <13ed>   DW_AT_type        : <0x13e0>
 <1><13f1>: Abbrev Number: 48 (DW_TAG_structure_type)
    <13f2>   DW_AT_name        : (indirect string, offset: 0xc29): vec3
    <13f6>   DW_AT_byte_size   : 3
    <13f7>   DW_AT_decl_file   : 10
    <13f8>   DW_AT_decl_line   : 253
    <13f9>   DW_AT_sibling     : <0x1422>
 <2><13fd>: Abbrev Number: 29 (DW_TAG_member)
    <13fe>   DW_AT_name        : x
    <1400>   DW_AT_decl_file   : 10
    <1401>   DW_AT_decl_line   : 253
    <1402>   DW_AT_type        : <0x1307>
    <1406>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1409>: Abbrev Number: 29 (DW_TAG_member)
    <140a>   DW_AT_name        : y
    <140c>   DW_AT_decl_file   : 10
    <140d>   DW_AT_decl_line   : 253
    <140e>   DW_AT_type        : <0x1307>
    <1412>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1415>: Abbrev Number: 29 (DW_TAG_member)
    <1416>   DW_AT_name        : z
    <1418>   DW_AT_decl_file   : 10
    <1419>   DW_AT_decl_line   : 253
    <141a>   DW_AT_type        : <0x1307>
    <141e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1421>: Abbrev Number: 0
 <1><1422>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1423>   DW_AT_name        : (indirect string, offset: 0x1351): uvec3
    <1427>   DW_AT_byte_size   : 3
    <1428>   DW_AT_decl_file   : 10
    <1429>   DW_AT_decl_line   : 254
    <142a>   DW_AT_sibling     : <0x1453>
 <2><142e>: Abbrev Number: 29 (DW_TAG_member)
    <142f>   DW_AT_name        : x
    <1431>   DW_AT_decl_file   : 10
    <1432>   DW_AT_decl_line   : 254
    <1433>   DW_AT_type        : <0xb81>
    <1437>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><143a>: Abbrev Number: 29 (DW_TAG_member)
    <143b>   DW_AT_name        : y
    <143d>   DW_AT_decl_file   : 10
    <143e>   DW_AT_decl_line   : 254
    <143f>   DW_AT_type        : <0xb81>
    <1443>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1446>: Abbrev Number: 29 (DW_TAG_member)
    <1447>   DW_AT_name        : z
    <1449>   DW_AT_decl_file   : 10
    <144a>   DW_AT_decl_line   : 254
    <144b>   DW_AT_type        : <0xb81>
    <144f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1452>: Abbrev Number: 0
 <1><1453>: Abbrev Number: 82 (DW_TAG_structure_type)
    <1454>   DW_AT_name        : (indirect string, offset: 0x18bb): phys_box
    <1458>   DW_AT_byte_size   : 8
    <1459>   DW_AT_decl_file   : 10
    <145a>   DW_AT_decl_line   : 261
    <145c>   DW_AT_sibling     : <0x149d>
 <2><1460>: Abbrev Number: 41 (DW_TAG_member)
    <1461>   DW_AT_name        : (indirect string, offset: 0x190a): size
    <1465>   DW_AT_decl_file   : 10
    <1466>   DW_AT_decl_line   : 263
    <1468>   DW_AT_type        : <0x1422>
    <146c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><146f>: Abbrev Number: 59 (DW_TAG_member)
    <1470>   DW_AT_name        : pos
    <1474>   DW_AT_decl_file   : 10
    <1475>   DW_AT_decl_line   : 264
    <1477>   DW_AT_type        : <0x13f1>
    <147b>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><147e>: Abbrev Number: 59 (DW_TAG_member)
    <147f>   DW_AT_name        : yaw
    <1483>   DW_AT_decl_file   : 10
    <1484>   DW_AT_decl_line   : 265
    <1486>   DW_AT_type        : <0xb81>
    <148a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><148d>: Abbrev Number: 41 (DW_TAG_member)
    <148e>   DW_AT_name        : (indirect string, offset: 0x106f): pitch
    <1492>   DW_AT_decl_file   : 10
    <1493>   DW_AT_decl_line   : 266
    <1495>   DW_AT_type        : <0x1307>
    <1499>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><149c>: Abbrev Number: 0
 <1><149d>: Abbrev Number: 7 (DW_TAG_const_type)
    <149e>   DW_AT_type        : <0x1453>
 <1><14a2>: Abbrev Number: 44 (DW_TAG_typedef)
    <14a3>   DW_AT_name        : (indirect string, offset: 0x1f31): uint32_t
    <14a7>   DW_AT_decl_file   : 28
    <14a8>   DW_AT_decl_line   : 130
    <14a9>   DW_AT_type        : <0xb7a>
 <1><14ad>: Abbrev Number: 48 (DW_TAG_structure_type)
    <14ae>   DW_AT_name        : (indirect string, offset: 0x16c7): ctrl
    <14b2>   DW_AT_byte_size   : 2
    <14b3>   DW_AT_decl_file   : 17
    <14b4>   DW_AT_decl_line   : 9
    <14b5>   DW_AT_sibling     : <0x14ee>
 <2><14b9>: Abbrev Number: 12 (DW_TAG_member)
    <14ba>   DW_AT_name        : (indirect string, offset: 0xbf7): dydt
    <14be>   DW_AT_decl_file   : 17
    <14bf>   DW_AT_decl_line   : 11
    <14c0>   DW_AT_type        : <0xf4d>
    <14c4>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14c7>: Abbrev Number: 118 (DW_TAG_subprogram)
    <14c8>   DW_AT_name        : (indirect string, offset: 0x10fd): step
    <14cc>   DW_AT_decl_file   : 17
    <14cd>   DW_AT_decl_line   : 16
    <14ce>   DW_AT_type        : <0xf4d>
    <14d2>   DW_AT_declaration : 1
    <14d3>   DW_AT_object_pointer: <0x14d7>
 <3><14d7>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <14d8>   DW_AT_type        : <0x6651>
    <14dc>   DW_AT_artificial  : 1
 <3><14dd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14de>   DW_AT_type        : <0xf4d>
 <3><14e2>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14e3>   DW_AT_type        : <0xf4d>
 <3><14e7>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14e8>   DW_AT_type        : <0xb81>
 <3><14ec>: Abbrev Number: 0
 <2><14ed>: Abbrev Number: 0
 <1><14ee>: Abbrev Number: 157 (DW_TAG_enumeration_type)
    <14f0>   DW_AT_name        : st
    <14f3>   DW_AT_enum_class  : 1
    <14f4>   DW_AT_encoding    : 7	(unsigned)
    <14f5>   DW_AT_byte_size   : 1
    <14f6>   DW_AT_type        : <0xa32>
    <14fa>   DW_AT_decl_file   : 10
    <14fb>   DW_AT_decl_line   : 333
    <14fd>   DW_AT_sibling     : <0x1545>
 <2><1501>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1502>   DW_AT_name        : (indirect string, offset: 0x3c8): TITLE
    <1506>   DW_AT_const_value : 0
 <2><1507>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1508>   DW_AT_name        : (indirect string, offset: 0xb8b): LEVEL
    <150c>   DW_AT_const_value : 1
 <2><150d>: Abbrev Number: 158 (DW_TAG_enumerator)
    <150f>   DW_AT_name        : AIM
    <1513>   DW_AT_const_value : 2
 <2><1514>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1515>   DW_AT_name        : (indirect string, offset: 0x1808): ROLLING
    <1519>   DW_AT_const_value : 3
 <2><151a>: Abbrev Number: 71 (DW_TAG_enumerator)
    <151b>   DW_AT_name        : (indirect string, offset: 0x1e4e): HOLE
    <151f>   DW_AT_const_value : 4
 <2><1520>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1521>   DW_AT_name        : (indirect string, offset: 0x8bc): SCORE
    <1525>   DW_AT_const_value : 5
 <2><1526>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1527>   DW_AT_name        : (indirect string, offset: 0xab7): MENU
    <152b>   DW_AT_const_value : 6
 <2><152c>: Abbrev Number: 71 (DW_TAG_enumerator)
    <152d>   DW_AT_name        : (indirect string, offset: 0x5d4): OVERVIEW
    <1531>   DW_AT_const_value : 7
 <2><1532>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1533>   DW_AT_name        : (indirect string, offset: 0x1c5f): PITCH
    <1537>   DW_AT_const_value : 8
 <2><1538>: Abbrev Number: 71 (DW_TAG_enumerator)
    <1539>   DW_AT_name        : (indirect string, offset: 0x1e2b): HISCORES
    <153d>   DW_AT_const_value : 9
 <2><153e>: Abbrev Number: 71 (DW_TAG_enumerator)
    <153f>   DW_AT_name        : (indirect string, offset: 0x56a): FX_COURSE
    <1543>   DW_AT_const_value : 10
 <2><1544>: Abbrev Number: 0
 <1><1545>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1546>   DW_AT_name        : (indirect string, offset: 0x1351): uvec3
    <154a>   DW_AT_byte_size   : 3
    <154b>   DW_AT_decl_file   : 10
    <154c>   DW_AT_decl_line   : 254
    <154d>   DW_AT_sibling     : <0x1576>
 <2><1551>: Abbrev Number: 29 (DW_TAG_member)
    <1552>   DW_AT_name        : x
    <1554>   DW_AT_decl_file   : 10
    <1555>   DW_AT_decl_line   : 254
    <1556>   DW_AT_type        : <0xb81>
    <155a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><155d>: Abbrev Number: 29 (DW_TAG_member)
    <155e>   DW_AT_name        : y
    <1560>   DW_AT_decl_file   : 10
    <1561>   DW_AT_decl_line   : 254
    <1562>   DW_AT_type        : <0xb81>
    <1566>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1569>: Abbrev Number: 29 (DW_TAG_member)
    <156a>   DW_AT_name        : z
    <156c>   DW_AT_decl_file   : 10
    <156d>   DW_AT_decl_line   : 254
    <156e>   DW_AT_type        : <0xb81>
    <1572>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1575>: Abbrev Number: 0
 <1><1576>: Abbrev Number: 82 (DW_TAG_structure_type)
    <1577>   DW_AT_name        : (indirect string, offset: 0x18bb): phys_box
    <157b>   DW_AT_byte_size   : 8
    <157c>   DW_AT_decl_file   : 10
    <157d>   DW_AT_decl_line   : 261
    <157f>   DW_AT_sibling     : <0x15c0>
 <2><1583>: Abbrev Number: 41 (DW_TAG_member)
    <1584>   DW_AT_name        : (indirect string, offset: 0x190a): size
    <1588>   DW_AT_decl_file   : 10
    <1589>   DW_AT_decl_line   : 263
    <158b>   DW_AT_type        : <0x1545>
    <158f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1592>: Abbrev Number: 59 (DW_TAG_member)
    <1593>   DW_AT_name        : pos
    <1597>   DW_AT_decl_file   : 10
    <1598>   DW_AT_decl_line   : 264
    <159a>   DW_AT_type        : <0x13f1>
    <159e>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><15a1>: Abbrev Number: 59 (DW_TAG_member)
    <15a2>   DW_AT_name        : yaw
    <15a6>   DW_AT_decl_file   : 10
    <15a7>   DW_AT_decl_line   : 265
    <15a9>   DW_AT_type        : <0xb81>
    <15ad>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><15b0>: Abbrev Number: 41 (DW_TAG_member)
    <15b1>   DW_AT_name        : (indirect string, offset: 0x106f): pitch
    <15b5>   DW_AT_decl_file   : 10
    <15b6>   DW_AT_decl_line   : 266
    <15b8>   DW_AT_type        : <0x1307>
    <15bc>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><15bf>: Abbrev Number: 0
 <1><15c0>: Abbrev Number: 7 (DW_TAG_const_type)
    <15c1>   DW_AT_type        : <0x1576>
 <1><15c5>: Abbrev Number: 82 (DW_TAG_structure_type)
    <15c6>   DW_AT_name        : (indirect string, offset: 0x40c): level_info_ext
    <15ca>   DW_AT_byte_size   : 21
    <15cb>   DW_AT_decl_file   : 10
    <15cc>   DW_AT_decl_line   : 277
    <15ce>   DW_AT_sibling     : <0x163c>
 <2><15d2>: Abbrev Number: 41 (DW_TAG_member)
    <15d3>   DW_AT_name        : (indirect string, offset: 0x6e5): num_verts
    <15d7>   DW_AT_decl_file   : 10
    <15d8>   DW_AT_decl_line   : 279
    <15da>   DW_AT_type        : <0xb81>
    <15de>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15e1>: Abbrev Number: 41 (DW_TAG_member)
    <15e2>   DW_AT_name        : (indirect string, offset: 0x1272): pat_faces
    <15e6>   DW_AT_decl_file   : 10
    <15e7>   DW_AT_decl_line   : 280
    <15e9>   DW_AT_type        : <0x163c>
    <15ed>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><15f0>: Abbrev Number: 41 (DW_TAG_member)
    <15f1>   DW_AT_name        : (indirect string, offset: 0x548): num_faces
    <15f5>   DW_AT_decl_file   : 10
    <15f6>   DW_AT_decl_line   : 281
    <15f8>   DW_AT_type        : <0xb81>
    <15fc>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><15ff>: Abbrev Number: 41 (DW_TAG_member)
    <1600>   DW_AT_name        : (indirect string, offset: 0x21d4): num_boxes
    <1604>   DW_AT_decl_file   : 10
    <1605>   DW_AT_decl_line   : 282
    <1607>   DW_AT_type        : <0xb81>
    <160b>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><160e>: Abbrev Number: 41 (DW_TAG_member)
    <160f>   DW_AT_name        : (indirect string, offset: 0x1900): ball_pos
    <1613>   DW_AT_decl_file   : 10
    <1614>   DW_AT_decl_line   : 283
    <1616>   DW_AT_type        : <0xf5d>
    <161a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><161d>: Abbrev Number: 41 (DW_TAG_member)
    <161e>   DW_AT_name        : (indirect string, offset: 0x1cdd): flag_pos
    <1622>   DW_AT_decl_file   : 10
    <1623>   DW_AT_decl_line   : 284
    <1625>   DW_AT_type        : <0xf5d>
    <1629>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><162c>: Abbrev Number: 59 (DW_TAG_member)
    <162d>   DW_AT_name        : par
    <1631>   DW_AT_decl_file   : 10
    <1632>   DW_AT_decl_line   : 285
    <1634>   DW_AT_type        : <0xb81>
    <1638>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><163b>: Abbrev Number: 0
 <1><163c>: Abbrev Number: 11 (DW_TAG_array_type)
    <163d>   DW_AT_type        : <0xb81>
    <1641>   DW_AT_sibling     : <0x164c>
 <2><1645>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1646>   DW_AT_type        : <0xd51>
    <164a>   DW_AT_upper_bound : 4
 <2><164b>: Abbrev Number: 0
 <1><164c>: Abbrev Number: 82 (DW_TAG_structure_type)
    <164d>   DW_AT_name        : (indirect string, offset: 0x1ea1): level_info
    <1651>   DW_AT_byte_size   : 27
    <1652>   DW_AT_decl_file   : 10
    <1653>   DW_AT_decl_line   : 288
    <1655>   DW_AT_sibling     : <0x1696>
 <2><1659>: Abbrev Number: 41 (DW_TAG_member)
    <165a>   DW_AT_name        : (indirect string, offset: 0x6e9): verts
    <165e>   DW_AT_decl_file   : 10
    <165f>   DW_AT_decl_line   : 290
    <1661>   DW_AT_type        : <0x169b>
    <1665>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1668>: Abbrev Number: 41 (DW_TAG_member)
    <1669>   DW_AT_name        : (indirect string, offset: 0x54c): faces
    <166d>   DW_AT_decl_file   : 10
    <166e>   DW_AT_decl_line   : 291
    <1670>   DW_AT_type        : <0x1057>
    <1674>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1677>: Abbrev Number: 41 (DW_TAG_member)
    <1678>   DW_AT_name        : (indirect string, offset: 0x21d8): boxes
    <167c>   DW_AT_decl_file   : 10
    <167d>   DW_AT_decl_line   : 292
    <167f>   DW_AT_type        : <0x16a1>
    <1683>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1686>: Abbrev Number: 59 (DW_TAG_member)
    <1687>   DW_AT_name        : ext
    <168b>   DW_AT_decl_file   : 10
    <168c>   DW_AT_decl_line   : 293
    <168e>   DW_AT_type        : <0x15c5>
    <1692>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1695>: Abbrev Number: 0
 <1><1696>: Abbrev Number: 7 (DW_TAG_const_type)
    <1697>   DW_AT_type        : <0x164c>
 <1><169b>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <169c>   DW_AT_byte_size   : 2
    <169d>   DW_AT_type        : <0x1312>
 <1><16a1>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <16a2>   DW_AT_byte_size   : 2
    <16a3>   DW_AT_type        : <0x15c0>
 <1><16a7>: Abbrev Number: 44 (DW_TAG_typedef)
    <16a8>   DW_AT_name        : (indirect string, offset: 0x1f32): int32_t
    <16ac>   DW_AT_decl_file   : 28
    <16ad>   DW_AT_decl_line   : 129
    <16ae>   DW_AT_type        : <0x16bc>
 <1><16b2>: Abbrev Number: 7 (DW_TAG_const_type)
    <16b3>   DW_AT_type        : <0x16a7>
 <1><16b7>: Abbrev Number: 70 (DW_TAG_volatile_type)
    <16b8>   DW_AT_type        : <0x16a7>
 <1><16bc>: Abbrev Number: 54 (DW_TAG_base_type)
    <16bd>   DW_AT_byte_size   : 4
    <16be>   DW_AT_encoding    : 5	(signed)
    <16bf>   DW_AT_name        : (indirect string, offset: 0x7a4): long int
 <1><16c3>: Abbrev Number: 94 (DW_TAG_typedef)
    <16c4>   DW_AT_name        : u16
    <16c8>   DW_AT_decl_file   : 27
    <16c9>   DW_AT_decl_line   : 30
    <16ca>   DW_AT_type        : <0x16d3>
 <1><16ce>: Abbrev Number: 7 (DW_TAG_const_type)
    <16cf>   DW_AT_type        : <0x16c3>
 <1><16d3>: Abbrev Number: 54 (DW_TAG_base_type)
    <16d4>   DW_AT_byte_size   : 2
    <16d5>   DW_AT_encoding    : 7	(unsigned)
    <16d6>   DW_AT_name        : (indirect string, offset: 0x1ffc): short unsigned int
 <1><16da>: Abbrev Number: 44 (DW_TAG_typedef)
    <16db>   DW_AT_name        : (indirect string, offset: 0x144b): DeviceDescriptor
    <16df>   DW_AT_decl_file   : 37
    <16e0>   DW_AT_decl_line   : 152
    <16e1>   DW_AT_type        : <0x16ea>
 <1><16e5>: Abbrev Number: 7 (DW_TAG_const_type)
    <16e6>   DW_AT_type        : <0x16da>
 <1><16ea>: Abbrev Number: 63 (DW_TAG_structure_type)
    <16eb>   DW_AT_name        : (indirect string, offset: 0x144b): DeviceDescriptor
    <16ef>   DW_AT_byte_size   : 18
    <16f0>   DW_AT_decl_file   : 37
    <16f1>   DW_AT_decl_line   : 137
    <16f2>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1449): 16DeviceDescriptor
    <16f6>   DW_AT_sibling     : <0x17bf>
 <2><16fa>: Abbrev Number: 29 (DW_TAG_member)
    <16fb>   DW_AT_name        : len
    <16ff>   DW_AT_decl_file   : 37
    <1700>   DW_AT_decl_line   : 138
    <1701>   DW_AT_type        : <0xa1e>
    <1705>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1708>: Abbrev Number: 12 (DW_TAG_member)
    <1709>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <170d>   DW_AT_decl_file   : 37
    <170e>   DW_AT_decl_line   : 139
    <170f>   DW_AT_type        : <0xa1e>
    <1713>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1716>: Abbrev Number: 12 (DW_TAG_member)
    <1717>   DW_AT_name        : (indirect string, offset: 0x3f6): usbVersion
    <171b>   DW_AT_decl_file   : 37
    <171c>   DW_AT_decl_line   : 140
    <171d>   DW_AT_type        : <0x16c3>
    <1721>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1724>: Abbrev Number: 12 (DW_TAG_member)
    <1725>   DW_AT_name        : (indirect string, offset: 0x1ecd): deviceClass
    <1729>   DW_AT_decl_file   : 37
    <172a>   DW_AT_decl_line   : 141
    <172b>   DW_AT_type        : <0xa1e>
    <172f>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1732>: Abbrev Number: 12 (DW_TAG_member)
    <1733>   DW_AT_name        : (indirect string, offset: 0xacc): deviceSubClass
    <1737>   DW_AT_decl_file   : 37
    <1738>   DW_AT_decl_line   : 142
    <1739>   DW_AT_type        : <0xa1e>
    <173d>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><1740>: Abbrev Number: 12 (DW_TAG_member)
    <1741>   DW_AT_name        : (indirect string, offset: 0x18e7): deviceProtocol
    <1745>   DW_AT_decl_file   : 37
    <1746>   DW_AT_decl_line   : 143
    <1747>   DW_AT_type        : <0xa1e>
    <174b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><174e>: Abbrev Number: 12 (DW_TAG_member)
    <174f>   DW_AT_name        : (indirect string, offset: 0xa64): packetSize0
    <1753>   DW_AT_decl_file   : 37
    <1754>   DW_AT_decl_line   : 144
    <1755>   DW_AT_type        : <0xa1e>
    <1759>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><175c>: Abbrev Number: 12 (DW_TAG_member)
    <175d>   DW_AT_name        : (indirect string, offset: 0x1aca): idVendor
    <1761>   DW_AT_decl_file   : 37
    <1762>   DW_AT_decl_line   : 145
    <1763>   DW_AT_type        : <0x16c3>
    <1767>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><176a>: Abbrev Number: 12 (DW_TAG_member)
    <176b>   DW_AT_name        : (indirect string, offset: 0x1aa2): idProduct
    <176f>   DW_AT_decl_file   : 37
    <1770>   DW_AT_decl_line   : 146
    <1771>   DW_AT_type        : <0x16c3>
    <1775>   DW_AT_data_member_location: 2 byte block: 23 a 	(DW_OP_plus_uconst: 10)
 <2><1778>: Abbrev Number: 12 (DW_TAG_member)
    <1779>   DW_AT_name        : (indirect string, offset: 0x80a): deviceVersion
    <177d>   DW_AT_decl_file   : 37
    <177e>   DW_AT_decl_line   : 147
    <177f>   DW_AT_type        : <0x16c3>
    <1783>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1786>: Abbrev Number: 12 (DW_TAG_member)
    <1787>   DW_AT_name        : (indirect string, offset: 0x1480): iManufacturer
    <178b>   DW_AT_decl_file   : 37
    <178c>   DW_AT_decl_line   : 148
    <178d>   DW_AT_type        : <0xa1e>
    <1791>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><1794>: Abbrev Number: 12 (DW_TAG_member)
    <1795>   DW_AT_name        : (indirect string, offset: 0x1e8d): iProduct
    <1799>   DW_AT_decl_file   : 37
    <179a>   DW_AT_decl_line   : 149
    <179b>   DW_AT_type        : <0xa1e>
    <179f>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
 <2><17a2>: Abbrev Number: 12 (DW_TAG_member)
    <17a3>   DW_AT_name        : (indirect string, offset: 0x104a): iSerialNumber
    <17a7>   DW_AT_decl_file   : 37
    <17a8>   DW_AT_decl_line   : 150
    <17a9>   DW_AT_type        : <0xa1e>
    <17ad>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><17b0>: Abbrev Number: 12 (DW_TAG_member)
    <17b1>   DW_AT_name        : (indirect string, offset: 0x19c4): bNumConfigurations
    <17b5>   DW_AT_decl_file   : 37
    <17b6>   DW_AT_decl_line   : 151
    <17b7>   DW_AT_type        : <0xa1e>
    <17bb>   DW_AT_data_member_location: 2 byte block: 23 11 	(DW_OP_plus_uconst: 17)
 <2><17be>: Abbrev Number: 0
 <1><17bf>: Abbrev Number: 44 (DW_TAG_typedef)
    <17c0>   DW_AT_name        : (indirect string, offset: 0x20f9): EndpointDescriptor
    <17c4>   DW_AT_decl_file   : 37
    <17c5>   DW_AT_decl_line   : 191
    <17c6>   DW_AT_type        : <0x17ca>
 <1><17ca>: Abbrev Number: 63 (DW_TAG_structure_type)
    <17cb>   DW_AT_name        : (indirect string, offset: 0x20f9): EndpointDescriptor
    <17cf>   DW_AT_byte_size   : 7
    <17d0>   DW_AT_decl_file   : 37
    <17d1>   DW_AT_decl_line   : 184
    <17d2>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x20f7): 18EndpointDescriptor
    <17d6>   DW_AT_sibling     : <0x182f>
 <2><17da>: Abbrev Number: 29 (DW_TAG_member)
    <17db>   DW_AT_name        : len
    <17df>   DW_AT_decl_file   : 37
    <17e0>   DW_AT_decl_line   : 185
    <17e1>   DW_AT_type        : <0xa1e>
    <17e5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><17e8>: Abbrev Number: 12 (DW_TAG_member)
    <17e9>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <17ed>   DW_AT_decl_file   : 37
    <17ee>   DW_AT_decl_line   : 186
    <17ef>   DW_AT_type        : <0xa1e>
    <17f3>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><17f6>: Abbrev Number: 12 (DW_TAG_member)
    <17f7>   DW_AT_name        : (indirect string, offset: 0x18fb): addr
    <17fb>   DW_AT_decl_file   : 37
    <17fc>   DW_AT_decl_line   : 187
    <17fd>   DW_AT_type        : <0xa1e>
    <1801>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1804>: Abbrev Number: 12 (DW_TAG_member)
    <1805>   DW_AT_name        : (indirect string, offset: 0xbfc): attr
    <1809>   DW_AT_decl_file   : 37
    <180a>   DW_AT_decl_line   : 188
    <180b>   DW_AT_type        : <0xa1e>
    <180f>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1812>: Abbrev Number: 12 (DW_TAG_member)
    <1813>   DW_AT_name        : (indirect string, offset: 0x7f7): packetSize
    <1817>   DW_AT_decl_file   : 37
    <1818>   DW_AT_decl_line   : 189
    <1819>   DW_AT_type        : <0x16c3>
    <181d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1820>: Abbrev Number: 12 (DW_TAG_member)
    <1821>   DW_AT_name        : (indirect string, offset: 0x6f6): interval
    <1825>   DW_AT_decl_file   : 37
    <1826>   DW_AT_decl_line   : 190
    <1827>   DW_AT_type        : <0xa1e>
    <182b>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><182e>: Abbrev Number: 0
 <1><182f>: Abbrev Number: 44 (DW_TAG_typedef)
    <1830>   DW_AT_name        : (indirect string, offset: 0x4fb): InterfaceDescriptor
    <1834>   DW_AT_decl_file   : 37
    <1835>   DW_AT_decl_line   : 180
    <1836>   DW_AT_type        : <0x183a>
 <1><183a>: Abbrev Number: 63 (DW_TAG_structure_type)
    <183b>   DW_AT_name        : (indirect string, offset: 0x4fb): InterfaceDescriptor
    <183f>   DW_AT_byte_size   : 9
    <1840>   DW_AT_decl_file   : 37
    <1841>   DW_AT_decl_line   : 170
    <1842>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x4f9): 19InterfaceDescriptor
    <1846>   DW_AT_sibling     : <0x18c9>
 <2><184a>: Abbrev Number: 29 (DW_TAG_member)
    <184b>   DW_AT_name        : len
    <184f>   DW_AT_decl_file   : 37
    <1850>   DW_AT_decl_line   : 171
    <1851>   DW_AT_type        : <0xa1e>
    <1855>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1858>: Abbrev Number: 12 (DW_TAG_member)
    <1859>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <185d>   DW_AT_decl_file   : 37
    <185e>   DW_AT_decl_line   : 172
    <185f>   DW_AT_type        : <0xa1e>
    <1863>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1866>: Abbrev Number: 12 (DW_TAG_member)
    <1867>   DW_AT_name        : (indirect string, offset: 0x114e): number
    <186b>   DW_AT_decl_file   : 37
    <186c>   DW_AT_decl_line   : 173
    <186d>   DW_AT_type        : <0xa1e>
    <1871>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1874>: Abbrev Number: 12 (DW_TAG_member)
    <1875>   DW_AT_name        : (indirect string, offset: 0x171e): alternate
    <1879>   DW_AT_decl_file   : 37
    <187a>   DW_AT_decl_line   : 174
    <187b>   DW_AT_type        : <0xa1e>
    <187f>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1882>: Abbrev Number: 12 (DW_TAG_member)
    <1883>   DW_AT_name        : (indirect string, offset: 0x8eb): numEndpoints
    <1887>   DW_AT_decl_file   : 37
    <1888>   DW_AT_decl_line   : 175
    <1889>   DW_AT_type        : <0xa1e>
    <188d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1890>: Abbrev Number: 12 (DW_TAG_member)
    <1891>   DW_AT_name        : (indirect string, offset: 0x6c8): interfaceClass
    <1895>   DW_AT_decl_file   : 37
    <1896>   DW_AT_decl_line   : 176
    <1897>   DW_AT_type        : <0xa1e>
    <189b>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><189e>: Abbrev Number: 12 (DW_TAG_member)
    <189f>   DW_AT_name        : (indirect string, offset: 0xc7c): interfaceSubClass
    <18a3>   DW_AT_decl_file   : 37
    <18a4>   DW_AT_decl_line   : 177
    <18a5>   DW_AT_type        : <0xa1e>
    <18a9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><18ac>: Abbrev Number: 12 (DW_TAG_member)
    <18ad>   DW_AT_name        : (indirect string, offset: 0x12dd): protocol
    <18b1>   DW_AT_decl_file   : 37
    <18b2>   DW_AT_decl_line   : 178
    <18b3>   DW_AT_type        : <0xa1e>
    <18b7>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><18ba>: Abbrev Number: 12 (DW_TAG_member)
    <18bb>   DW_AT_name        : (indirect string, offset: 0x1b6c): iInterface
    <18bf>   DW_AT_decl_file   : 37
    <18c0>   DW_AT_decl_line   : 179
    <18c1>   DW_AT_type        : <0xa1e>
    <18c5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><18c8>: Abbrev Number: 0
 <1><18c9>: Abbrev Number: 44 (DW_TAG_typedef)
    <18ca>   DW_AT_name        : (indirect string, offset: 0x2011): CDCCSInterfaceDescriptor
    <18ce>   DW_AT_decl_file   : 37
    <18cf>   DW_AT_decl_line   : 215
    <18d0>   DW_AT_type        : <0x18d4>
 <1><18d4>: Abbrev Number: 63 (DW_TAG_structure_type)
    <18d5>   DW_AT_name        : (indirect string, offset: 0x2011): CDCCSInterfaceDescriptor
    <18d9>   DW_AT_byte_size   : 5
    <18da>   DW_AT_decl_file   : 37
    <18db>   DW_AT_decl_line   : 209
    <18dc>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x200f): 24CDCCSInterfaceDescriptor
    <18e0>   DW_AT_sibling     : <0x1929>
 <2><18e4>: Abbrev Number: 29 (DW_TAG_member)
    <18e5>   DW_AT_name        : len
    <18e9>   DW_AT_decl_file   : 37
    <18ea>   DW_AT_decl_line   : 210
    <18eb>   DW_AT_type        : <0xa1e>
    <18ef>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><18f2>: Abbrev Number: 12 (DW_TAG_member)
    <18f3>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <18f7>   DW_AT_decl_file   : 37
    <18f8>   DW_AT_decl_line   : 211
    <18f9>   DW_AT_type        : <0xa1e>
    <18fd>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1900>: Abbrev Number: 12 (DW_TAG_member)
    <1901>   DW_AT_name        : (indirect string, offset: 0xc01): subtype
    <1905>   DW_AT_decl_file   : 37
    <1906>   DW_AT_decl_line   : 212
    <1907>   DW_AT_type        : <0xa1e>
    <190b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><190e>: Abbrev Number: 29 (DW_TAG_member)
    <190f>   DW_AT_name        : d0
    <1912>   DW_AT_decl_file   : 37
    <1913>   DW_AT_decl_line   : 213
    <1914>   DW_AT_type        : <0xa1e>
    <1918>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><191b>: Abbrev Number: 29 (DW_TAG_member)
    <191c>   DW_AT_name        : d1
    <191f>   DW_AT_decl_file   : 37
    <1920>   DW_AT_decl_line   : 214
    <1921>   DW_AT_type        : <0xa1e>
    <1925>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1928>: Abbrev Number: 0
 <1><1929>: Abbrev Number: 44 (DW_TAG_typedef)
    <192a>   DW_AT_name        : (indirect string, offset: 0x1764): ACMFunctionalDescriptor
    <192e>   DW_AT_decl_file   : 37
    <192f>   DW_AT_decl_line   : 240
    <1930>   DW_AT_type        : <0x1934>
 <1><1934>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1935>   DW_AT_name        : (indirect string, offset: 0x1764): ACMFunctionalDescriptor
    <1939>   DW_AT_byte_size   : 4
    <193a>   DW_AT_decl_file   : 37
    <193b>   DW_AT_decl_line   : 235
    <193c>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1762): 23ACMFunctionalDescriptor
    <1940>   DW_AT_sibling     : <0x197d>
 <2><1944>: Abbrev Number: 29 (DW_TAG_member)
    <1945>   DW_AT_name        : len
    <1949>   DW_AT_decl_file   : 37
    <194a>   DW_AT_decl_line   : 236
    <194b>   DW_AT_type        : <0xa1e>
    <194f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1952>: Abbrev Number: 12 (DW_TAG_member)
    <1953>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <1957>   DW_AT_decl_file   : 37
    <1958>   DW_AT_decl_line   : 237
    <1959>   DW_AT_type        : <0xa1e>
    <195d>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1960>: Abbrev Number: 12 (DW_TAG_member)
    <1961>   DW_AT_name        : (indirect string, offset: 0xc01): subtype
    <1965>   DW_AT_decl_file   : 37
    <1966>   DW_AT_decl_line   : 238
    <1967>   DW_AT_type        : <0xa1e>
    <196b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><196e>: Abbrev Number: 12 (DW_TAG_member)
    <196f>   DW_AT_name        : (indirect string, offset: 0x1dd0): bmCapabilities
    <1973>   DW_AT_decl_file   : 37
    <1974>   DW_AT_decl_line   : 239
    <1975>   DW_AT_type        : <0xa1e>
    <1979>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><197c>: Abbrev Number: 0
 <1><197d>: Abbrev Number: 44 (DW_TAG_typedef)
    <197e>   DW_AT_name        : (indirect string, offset: 0x603): CMFunctionalDescriptor
    <1982>   DW_AT_decl_file   : 37
    <1983>   DW_AT_decl_line   : 232
    <1984>   DW_AT_type        : <0x1988>
 <1><1988>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1989>   DW_AT_name        : (indirect string, offset: 0x603): CMFunctionalDescriptor
    <198d>   DW_AT_byte_size   : 5
    <198e>   DW_AT_decl_file   : 37
    <198f>   DW_AT_decl_line   : 226
    <1990>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x601): 22CMFunctionalDescriptor
    <1994>   DW_AT_sibling     : <0x19df>
 <2><1998>: Abbrev Number: 29 (DW_TAG_member)
    <1999>   DW_AT_name        : len
    <199d>   DW_AT_decl_file   : 37
    <199e>   DW_AT_decl_line   : 227
    <199f>   DW_AT_type        : <0xa1e>
    <19a3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><19a6>: Abbrev Number: 12 (DW_TAG_member)
    <19a7>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <19ab>   DW_AT_decl_file   : 37
    <19ac>   DW_AT_decl_line   : 228
    <19ad>   DW_AT_type        : <0xa1e>
    <19b1>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><19b4>: Abbrev Number: 12 (DW_TAG_member)
    <19b5>   DW_AT_name        : (indirect string, offset: 0xc01): subtype
    <19b9>   DW_AT_decl_file   : 37
    <19ba>   DW_AT_decl_line   : 229
    <19bb>   DW_AT_type        : <0xa1e>
    <19bf>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><19c2>: Abbrev Number: 12 (DW_TAG_member)
    <19c3>   DW_AT_name        : (indirect string, offset: 0x1dd0): bmCapabilities
    <19c7>   DW_AT_decl_file   : 37
    <19c8>   DW_AT_decl_line   : 230
    <19c9>   DW_AT_type        : <0xa1e>
    <19cd>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><19d0>: Abbrev Number: 12 (DW_TAG_member)
    <19d1>   DW_AT_name        : (indirect string, offset: 0xa8b): bDataInterface
    <19d5>   DW_AT_decl_file   : 37
    <19d6>   DW_AT_decl_line   : 231
    <19d7>   DW_AT_type        : <0xa1e>
    <19db>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><19de>: Abbrev Number: 0
 <1><19df>: Abbrev Number: 44 (DW_TAG_typedef)
    <19e0>   DW_AT_name        : (indirect string, offset: 0x3d0): IADDescriptor
    <19e4>   DW_AT_decl_file   : 37
    <19e5>   DW_AT_decl_line   : 205
    <19e6>   DW_AT_type        : <0x19ea>
 <1><19ea>: Abbrev Number: 63 (DW_TAG_structure_type)
    <19eb>   DW_AT_name        : (indirect string, offset: 0x3d0): IADDescriptor
    <19ef>   DW_AT_byte_size   : 8
    <19f0>   DW_AT_decl_file   : 37
    <19f1>   DW_AT_decl_line   : 196
    <19f2>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x3ce): 13IADDescriptor
    <19f6>   DW_AT_sibling     : <0x1a6b>
 <2><19fa>: Abbrev Number: 29 (DW_TAG_member)
    <19fb>   DW_AT_name        : len
    <19ff>   DW_AT_decl_file   : 37
    <1a00>   DW_AT_decl_line   : 197
    <1a01>   DW_AT_type        : <0xa1e>
    <1a05>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1a08>: Abbrev Number: 12 (DW_TAG_member)
    <1a09>   DW_AT_name        : (indirect string, offset: 0x1c06): dtype
    <1a0d>   DW_AT_decl_file   : 37
    <1a0e>   DW_AT_decl_line   : 198
    <1a0f>   DW_AT_type        : <0xa1e>
    <1a13>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1a16>: Abbrev Number: 12 (DW_TAG_member)
    <1a17>   DW_AT_name        : (indirect string, offset: 0x111f): firstInterface
    <1a1b>   DW_AT_decl_file   : 37
    <1a1c>   DW_AT_decl_line   : 199
    <1a1d>   DW_AT_type        : <0xa1e>
    <1a21>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1a24>: Abbrev Number: 12 (DW_TAG_member)
    <1a25>   DW_AT_name        : (indirect string, offset: 0x12fd): interfaceCount
    <1a29>   DW_AT_decl_file   : 37
    <1a2a>   DW_AT_decl_line   : 200
    <1a2b>   DW_AT_type        : <0xa1e>
    <1a2f>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1a32>: Abbrev Number: 12 (DW_TAG_member)
    <1a33>   DW_AT_name        : (indirect string, offset: 0x13d9): functionClass
    <1a37>   DW_AT_decl_file   : 37
    <1a38>   DW_AT_decl_line   : 201
    <1a39>   DW_AT_type        : <0xa1e>
    <1a3d>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1a40>: Abbrev Number: 12 (DW_TAG_member)
    <1a41>   DW_AT_name        : (indirect string, offset: 0xfb1): funtionSubClass
    <1a45>   DW_AT_decl_file   : 37
    <1a46>   DW_AT_decl_line   : 202
    <1a47>   DW_AT_type        : <0xa1e>
    <1a4b>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><1a4e>: Abbrev Number: 12 (DW_TAG_member)
    <1a4f>   DW_AT_name        : (indirect string, offset: 0xf2e): functionProtocol
    <1a53>   DW_AT_decl_file   : 37
    <1a54>   DW_AT_decl_line   : 203
    <1a55>   DW_AT_type        : <0xa1e>
    <1a59>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1a5c>: Abbrev Number: 12 (DW_TAG_member)
    <1a5d>   DW_AT_name        : (indirect string, offset: 0x1b6c): iInterface
    <1a61>   DW_AT_decl_file   : 37
    <1a62>   DW_AT_decl_line   : 204
    <1a63>   DW_AT_type        : <0xa1e>
    <1a67>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><1a6a>: Abbrev Number: 0
 <1><1a6b>: Abbrev Number: 97 (DW_TAG_typedef)
    <1a6c>   DW_AT_name        : (indirect string, offset: 0x1dc2): CDCDescriptor
    <1a70>   DW_AT_decl_file   : 37
    <1a71>   DW_AT_decl_line   : 259
    <1a73>   DW_AT_type        : <0x1a7c>
 <1><1a77>: Abbrev Number: 7 (DW_TAG_const_type)
    <1a78>   DW_AT_type        : <0x1a6b>
 <1><1a7c>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1a7d>   DW_AT_name        : (indirect string, offset: 0x1dc2): CDCDescriptor
    <1a81>   DW_AT_byte_size   : 66
    <1a82>   DW_AT_decl_file   : 37
    <1a83>   DW_AT_decl_line   : 243
    <1a84>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1dc0): 13CDCDescriptor
    <1a88>   DW_AT_sibling     : <0x1b1b>
 <2><1a8c>: Abbrev Number: 29 (DW_TAG_member)
    <1a8d>   DW_AT_name        : iad
    <1a91>   DW_AT_decl_file   : 37
    <1a92>   DW_AT_decl_line   : 245
    <1a93>   DW_AT_type        : <0x19df>
    <1a97>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1a9a>: Abbrev Number: 29 (DW_TAG_member)
    <1a9b>   DW_AT_name        : cif
    <1a9f>   DW_AT_decl_file   : 37
    <1aa0>   DW_AT_decl_line   : 248
    <1aa1>   DW_AT_type        : <0x182f>
    <1aa5>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1aa8>: Abbrev Number: 12 (DW_TAG_member)
    <1aa9>   DW_AT_name        : (indirect string, offset: 0xabc): header
    <1aad>   DW_AT_decl_file   : 37
    <1aae>   DW_AT_decl_line   : 249
    <1aaf>   DW_AT_type        : <0x18c9>
    <1ab3>   DW_AT_data_member_location: 2 byte block: 23 11 	(DW_OP_plus_uconst: 17)
 <2><1ab6>: Abbrev Number: 12 (DW_TAG_member)
    <1ab7>   DW_AT_name        : (indirect string, offset: 0xa70): callManagement
    <1abb>   DW_AT_decl_file   : 37
    <1abc>   DW_AT_decl_line   : 250
    <1abd>   DW_AT_type        : <0x197d>
    <1ac1>   DW_AT_data_member_location: 2 byte block: 23 16 	(DW_OP_plus_uconst: 22)
 <2><1ac4>: Abbrev Number: 12 (DW_TAG_member)
    <1ac5>   DW_AT_name        : (indirect string, offset: 0xfd8): controlManagement
    <1ac9>   DW_AT_decl_file   : 37
    <1aca>   DW_AT_decl_line   : 251
    <1acb>   DW_AT_type        : <0x1929>
    <1acf>   DW_AT_data_member_location: 2 byte block: 23 1b 	(DW_OP_plus_uconst: 27)
 <2><1ad2>: Abbrev Number: 12 (DW_TAG_member)
    <1ad3>   DW_AT_name        : (indirect string, offset: 0x1f60): functionalDescriptor
    <1ad7>   DW_AT_decl_file   : 37
    <1ad8>   DW_AT_decl_line   : 252
    <1ad9>   DW_AT_type        : <0x18c9>
    <1add>   DW_AT_data_member_location: 2 byte block: 23 1f 	(DW_OP_plus_uconst: 31)
 <2><1ae0>: Abbrev Number: 12 (DW_TAG_member)
    <1ae1>   DW_AT_name        : (indirect string, offset: 0xc71): cifin
    <1ae5>   DW_AT_decl_file   : 37
    <1ae6>   DW_AT_decl_line   : 253
    <1ae7>   DW_AT_type        : <0x17bf>
    <1aeb>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><1aee>: Abbrev Number: 59 (DW_TAG_member)
    <1aef>   DW_AT_name        : dif
    <1af3>   DW_AT_decl_file   : 37
    <1af4>   DW_AT_decl_line   : 256
    <1af6>   DW_AT_type        : <0x182f>
    <1afa>   DW_AT_data_member_location: 2 byte block: 23 2b 	(DW_OP_plus_uconst: 43)
 <2><1afd>: Abbrev Number: 59 (DW_TAG_member)
    <1afe>   DW_AT_name        : in
    <1b01>   DW_AT_decl_file   : 37
    <1b02>   DW_AT_decl_line   : 257
    <1b04>   DW_AT_type        : <0x17bf>
    <1b08>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><1b0b>: Abbrev Number: 59 (DW_TAG_member)
    <1b0c>   DW_AT_name        : out
    <1b10>   DW_AT_decl_file   : 37
    <1b11>   DW_AT_decl_line   : 258
    <1b13>   DW_AT_type        : <0x17bf>
    <1b17>   DW_AT_data_member_location: 2 byte block: 23 3b 	(DW_OP_plus_uconst: 59)
 <2><1b1a>: Abbrev Number: 0
 <1><1b1b>: Abbrev Number: 105 (DW_TAG_structure_type)
    <1b1c>   DW_AT_name        : (indirect string, offset: 0x1aac): array
    <1b20>   DW_AT_byte_size   : 400
    <1b22>   DW_AT_decl_file   : 10
    <1b23>   DW_AT_decl_line   : 107
    <1b24>   DW_AT_sibling     : <0x1b57>
 <2><1b28>: Abbrev Number: 29 (DW_TAG_member)
    <1b29>   DW_AT_name        : d_
    <1b2c>   DW_AT_decl_file   : 10
    <1b2d>   DW_AT_decl_line   : 109
    <1b2e>   DW_AT_type        : <0x1b57>
    <1b32>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1b35>: Abbrev Number: 119 (DW_TAG_subprogram)
    <1b36>   DW_AT_external    : 1
    <1b37>   DW_AT_name        : (indirect string, offset: 0x10b8): operator[]
    <1b3b>   DW_AT_decl_file   : 10
    <1b3c>   DW_AT_decl_line   : 112
    <1b3d>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x11cf): _ZN5arrayI5dvec2Lj100EEixEj
    <1b41>   DW_AT_type        : <0x63da>
    <1b45>   DW_AT_declaration : 1
    <1b46>   DW_AT_object_pointer: <0x1b4a>
