Contents of the .debug_aranges section:

  Length:                   36
  Version:                  2
  Offset into .debug_info:  0x9f4
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00002762 0000437c 
    00006b28 0000027e 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb1ae
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006f68 00000004 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb269
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006e08 00000028 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb324
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006e30 00000010 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb3df
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    0000271a 00000016 
    00000000 00000000 
  Length:                   28
  Version:                  2
  Offset into .debug_info:  0xb49a
  Pointer Size:             4
  Segment Size:             0

    Address    Length
    00006e40 00000014 
    00000000 00000000 
  Length:                   28
  Version:                  2

 <1><9ba>: Abbrev Number: 141 (DW_TAG_variable)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x35c): USBINT
    <9c0>   DW_AT_decl_file   : 0
    <9c1>   DW_AT_decl_line   : 0
    <9c2>   DW_AT_type        : <0x14>
    <9c6>   DW_AT_external    : 1
    <9c7>   DW_AT_location    : 5 byte block: 3 da 0 80 0 	(DW_OP_addr: 8000da)
 <1><9cd>: Abbrev Number: 142 (DW_TAG_variable)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x363): USBSTA
    <9d3>   DW_AT_decl_file   : 0
    <9d4>   DW_AT_decl_line   : 0
    <9d5>   DW_AT_type        : <0x14>
    <9d9>   DW_AT_external    : 1
    <9da>   DW_AT_location    : 5 byte block: 3 d9 0 80 0 	(DW_OP_addr: 8000d9)
 <1><9e0>: Abbrev Number: 143 (DW_TAG_variable)
    <9e2>   DW_AT_name        : (indirect string, offset: 0x36a): UHWCON
    <9e6>   DW_AT_decl_file   : 0
    <9e7>   DW_AT_decl_line   : 0
    <9e8>   DW_AT_type        : <0x14>
    <9ec>   DW_AT_external    : 1
    <9ed>   DW_AT_location    : 5 byte block: 3 d7 0 80 0 	(DW_OP_addr: 8000d7)
 <1><9f3>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f4:
   Length:        0xa7b6 (32-bit)
   Version:       2
   Abbrev Offset: 0x96a
   Pointer Size:  4
 <0><9ff>: Abbrev Number: 132 (DW_TAG_compile_unit)
    <a01>   DW_AT_producer    : (indirect string, offset: 0xdcc): GNU GIMPLE 7.3.0 -mn-flash=1 -mcall-prologues -mstrict-X -mmcu=avr5 -mn-flash=1 -mno-skip-bug -mmcu=avr5 -g -Os -Os -fmath-errno -fsigned-zeros -ftrapping-math -fno-trapv -fno-openmp -fno-openacc -fno-exceptions -fuse-linker-plugin -fltrans
    <a05>   DW_AT_language    : 4	(C++)
    <a06>   DW_AT_name        : (indirect string, offset: 0xf14): <artificial>
    <a0a>   DW_AT_comp_dir    : (indirect string, offset: 0x6fb): E:\Projects\arduboy_minigolf
    <a0e>   DW_AT_ranges      : 0x7d8
    <a12>   DW_AT_low_pc      : 0x0
    <a16>   DW_AT_entry_pc    : 0x0
    <a1a>   DW_AT_stmt_list   : 0x1a
 <1><a1e>: Abbrev Number: 94 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : u8
    <a22>   DW_AT_decl_file   : 26
    <a23>   DW_AT_decl_line   : 29
    <a24>   DW_AT_type        : <0xa32>
 <1><a28>: Abbrev Number: 7 (DW_TAG_const_type)
    <a29>   DW_AT_type        : <0xa1e>
 <1><a2d>: Abbrev Number: 77 (DW_TAG_volatile_type)
    <a2e>   DW_AT_type        : <0xa1e>
 <1><a32>: Abbrev Number: 57 (DW_TAG_base_type)
    <a33>   DW_AT_byte_size   : 1
    <a34>   DW_AT_encoding    : 8	(unsigned char)
    <a35>   DW_AT_name        : (indirect string, offset: 0xa31): unsigned char
 <1><a39>: Abbrev Number: 48 (DW_TAG_structure_type)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x1c14): ArduboyTones
    <a3e>   DW_AT_byte_size   : 1
    <a3f>   DW_AT_decl_file   : 28
    <a40>   DW_AT_decl_line   : 152
    <a41>   DW_AT_sibling     : <0xac3>
 <2><a45>: Abbrev Number: 113 (DW_TAG_subprogram)
    <a46>   DW_AT_name        : (indirect string, offset: 0x388): tone
    <a4a>   DW_AT_decl_file   : 6
    <a4b>   DW_AT_decl_line   : 84
    <a4c>   DW_AT_declaration : 1
    <a4d>   DW_AT_sibling     : <0xa66>
 <3><a51>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a52>   DW_AT_type        : <0xd57>
 <3><a56>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a57>   DW_AT_type        : <0xd57>
 <3><a5b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a5c>   DW_AT_type        : <0xd57>
 <3><a60>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a61>   DW_AT_type        : <0xd57>
 <3><a65>: Abbrev Number: 0
 <2><a66>: Abbrev Number: 89 (DW_TAG_subprogram)
    <a67>   DW_AT_name        : (indirect string, offset: 0xd4d): __base_ctor 
    <a6b>   DW_AT_decl_file   : 6
    <a6c>   DW_AT_decl_line   : 59
    <a6d>   DW_AT_declaration : 1
    <a6e>   DW_AT_object_pointer: <0xa76>
    <a72>   DW_AT_sibling     : <0xa82>
 <3><a76>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <a77>   DW_AT_type        : <0x22fd>
    <a7b>   DW_AT_artificial  : 1
 <3><a7c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a7d>   DW_AT_type        : <0x2308>
 <3><a81>: Abbrev Number: 0
 <2><a82>: Abbrev Number: 133 (DW_TAG_subprogram)
    <a84>   DW_AT_name        : (indirect string, offset: 0x13cc): _ZN12ArduboyTones7getNextEv.part.0
    <a88>   DW_AT_type        : <0xd57>
    <a8c>   DW_AT_artificial  : 1
    <a8d>   DW_AT_accessibility: 3	(private)
    <a8e>   DW_AT_declaration : 1
 <2><a8f>: Abbrev Number: 134 (DW_TAG_subprogram)
    <a91>   DW_AT_name        : (indirect string, offset: 0x82b): getNext
    <a95>   DW_AT_decl_file   : 6
    <a96>   DW_AT_decl_line   : 261
    <a98>   DW_AT_type        : <0xd57>
    <a9c>   DW_AT_accessibility: 3	(private)
    <a9d>   DW_AT_declaration : 1
 <2><a9e>: Abbrev Number: 83 (DW_TAG_subprogram)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x2123): noTone
    <aa3>   DW_AT_decl_file   : 6
    <aa4>   DW_AT_decl_line   : 131
    <aa5>   DW_AT_declaration : 1
 <2><aa6>: Abbrev Number: 83 (DW_TAG_subprogram)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x1306): nextTone
    <aab>   DW_AT_decl_file   : 6
    <aac>   DW_AT_decl_line   : 162
    <aad>   DW_AT_declaration : 1
 <2><aae>: Abbrev Number: 135 (DW_TAG_subprogram)
    <ab0>   DW_AT_name        : (indirect string, offset: 0x388): tone
    <ab4>   DW_AT_decl_file   : 6
    <ab5>   DW_AT_decl_line   : 73
    <ab6>   DW_AT_declaration : 1
 <3><ab7>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ab8>   DW_AT_type        : <0xd57>
 <3><abc>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <abd>   DW_AT_type        : <0xd57>
 <3><ac1>: Abbrev Number: 0
 <2><ac2>: Abbrev Number: 0
 <1><ac3>: Abbrev Number: 95 (DW_TAG_structure_type)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xd24): Print
    <ac8>   DW_AT_byte_size   : 4
    <ac9>   DW_AT_decl_file   : 19
    <aca>   DW_AT_decl_line   : 37
    <acb>   DW_AT_containing_type: <0xac3>
    <acf>   DW_AT_sibling     : <0xaf0>
 <2><ad3>: Abbrev Number: 114 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xd1e): _vptr.Print
    <ad8>   DW_AT_type        : <0xb05>
    <adc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <adf>   DW_AT_artificial  : 1
 <2><ae0>: Abbrev Number: 58 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x443): write_error
    <ae5>   DW_AT_decl_file   : 19
    <ae6>   DW_AT_decl_line   : 40
    <ae7>   DW_AT_type        : <0xafd>
    <aeb>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <aee>   DW_AT_accessibility: 3	(private)
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 136 (DW_TAG_subroutine_type)
    <af2>   DW_AT_type        : <0xafd>
    <af6>   DW_AT_sibling     : <0xafd>
 <2><afa>: Abbrev Number: 137 (DW_TAG_unspecified_parameters)
 <2><afc>: Abbrev Number: 0
 <1><afd>: Abbrev Number: 138 (DW_TAG_base_type)
    <aff>   DW_AT_byte_size   : 2
    <b00>   DW_AT_encoding    : 5	(signed)
    <b01>   DW_AT_name        : int
 <1><b05>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <b06>   DW_AT_byte_size   : 2
    <b07>   DW_AT_type        : <0xb0b>
 <1><b0b>: Abbrev Number: 139 (DW_TAG_pointer_type)
    <b0d>   DW_AT_byte_size   : 2
    <b0e>   DW_AT_name        : (indirect string, offset: 0x4b6): __vtbl_ptr_type
    <b12>   DW_AT_type        : <0xaf0>
 <1><b16>: Abbrev Number: 95 (DW_TAG_structure_type)
    <b17>   DW_AT_name        : (indirect string, offset: 0xf32): Stream
    <b1b>   DW_AT_byte_size   : 12
    <b1c>   DW_AT_decl_file   : 25
    <b1d>   DW_AT_decl_line   : 49
    <b1e>   DW_AT_containing_type: <0xb4e>
    <b22>   DW_AT_sibling     : <0xb4e>
 <2><b26>: Abbrev Number: 115 (DW_TAG_inheritance)
    <b27>   DW_AT_type        : <0xb4e>
    <b2b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <b2e>   DW_AT_accessibility: 1	(public)
 <2><b2f>: Abbrev Number: 58 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x10dd): _timeout
    <b34>   DW_AT_decl_file   : 25
    <b35>   DW_AT_decl_line   : 52
    <b36>   DW_AT_type        : <0xb79>
    <b3a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <b3d>   DW_AT_accessibility: 2	(protected)
 <2><b3e>: Abbrev Number: 58 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x1ed5): _startMillis
    <b43>   DW_AT_decl_file   : 25
    <b44>   DW_AT_decl_line   : 53
    <b45>   DW_AT_type        : <0xb79>
    <b49>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <b4c>   DW_AT_accessibility: 2	(protected)
 <2><b4d>: Abbrev Number: 0
 <1><b4e>: Abbrev Number: 140 (DW_TAG_structure_type)
    <b50>   DW_AT_name        : (indirect string, offset: 0xd24): Print
    <b54>   DW_AT_declaration : 1
    <b55>   DW_AT_sibling     : <0xb79>
 <2><b59>: Abbrev Number: 141 (DW_TAG_subprogram)
    <b5b>   DW_AT_external    : 1
    <b5c>   DW_AT_name        : (indirect string, offset: 0x2064): setWriteError
    <b60>   DW_AT_decl_file   : 19
    <b61>   DW_AT_decl_line   : 44
    <b62>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x203d): _ZN5Print13setWriteErrorEi
    <b66>   DW_AT_accessibility: 2	(protected)
    <b67>   DW_AT_declaration : 1
    <b68>   DW_AT_object_pointer: <0xb6c>
 <3><b6c>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <b6d>   DW_AT_type        : <0x6b28>
    <b71>   DW_AT_artificial  : 1
 <3><b72>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <b73>   DW_AT_type        : <0xafd>
 <3><b77>: Abbrev Number: 0
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 57 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 4
    <b7b>   DW_AT_encoding    : 7	(unsigned)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x1936): long unsigned int
 <1><b80>: Abbrev Number: 45 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x921): uint8_t
    <b85>   DW_AT_decl_file   : 27
    <b86>   DW_AT_decl_line   : 126
    <b87>   DW_AT_type        : <0xa32>
 <1><b8b>: Abbrev Number: 77 (DW_TAG_volatile_type)
    <b8c>   DW_AT_type        : <0xb80>
 <1><b90>: Abbrev Number: 7 (DW_TAG_const_type)
    <b91>   DW_AT_type        : <0xb80>
 <1><b95>: Abbrev Number: 95 (DW_TAG_structure_type)
    <b96>   DW_AT_name        : (indirect string, offset: 0x159a): Serial_
    <b9a>   DW_AT_byte_size   : 80
    <b9b>   DW_AT_decl_file   : 26
    <b9c>   DW_AT_decl_line   : 90
    <b9d>   DW_AT_containing_type: <0xb4e>
    <ba1>   DW_AT_sibling     : <0xd40>
 <2><ba5>: Abbrev Number: 115 (DW_TAG_inheritance)
    <ba6>   DW_AT_type        : <0xb16>
    <baa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <bad>   DW_AT_accessibility: 1	(public)
 <2><bae>: Abbrev Number: 58 (DW_TAG_member)
    <baf>   DW_AT_name        : (indirect string, offset: 0x1d46): peek_buffer
    <bb3>   DW_AT_decl_file   : 26
    <bb4>   DW_AT_decl_line   : 93
    <bb5>   DW_AT_type        : <0xafd>
    <bb9>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
    <bbc>   DW_AT_accessibility: 3	(private)
 <2><bbd>: Abbrev Number: 12 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x515): _rx_buffer_head
    <bc2>   DW_AT_decl_file   : 26
    <bc3>   DW_AT_decl_line   : 110
    <bc4>   DW_AT_type        : <0xb8b>
    <bc8>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><bcb>: Abbrev Number: 12 (DW_TAG_member)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x15c6): _rx_buffer_tail
    <bd0>   DW_AT_decl_file   : 26
    <bd1>   DW_AT_decl_line   : 111
    <bd2>   DW_AT_type        : <0xb8b>
    <bd6>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
 <2><bd9>: Abbrev Number: 12 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0x1957): _rx_buffer
    <bde>   DW_AT_decl_file   : 26
    <bdf>   DW_AT_decl_line   : 112
    <be0>   DW_AT_type        : <0xd40>
    <be4>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><be7>: Abbrev Number: 89 (DW_TAG_subprogram)
    <be8>   DW_AT_name        : (indirect string, offset: 0xd4d): __base_ctor 
    <bec>   DW_AT_decl_file   : 26
    <bed>   DW_AT_decl_line   : 95
    <bee>   DW_AT_declaration : 1
    <bef>   DW_AT_object_pointer: <0xbf7>
    <bf3>   DW_AT_sibling     : <0xbfe>
 <3><bf7>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <bf8>   DW_AT_type        : <0x22d9>
    <bfc>   DW_AT_artificial  : 1
 <3><bfd>: Abbrev Number: 0
 <2><bfe>: Abbrev Number: 90 (DW_TAG_subprogram)
    <bff>   DW_AT_name        : (indirect string, offset: 0x119a): write
    <c03>   DW_AT_decl_file   : 4
    <c04>   DW_AT_decl_line   : 223
    <c05>   DW_AT_type        : <0x1109>
    <c09>   DW_AT_virtuality  : 1	(virtual)
    <c0a>   DW_AT_vtable_elem_location: 2 byte block: 10 0 	(DW_OP_constu: 0)
    <c0d>   DW_AT_containing_type: <0xb95>
    <c11>   DW_AT_declaration : 1
    <c12>   DW_AT_object_pointer: <0xc1a>
    <c16>   DW_AT_sibling     : <0xc26>
 <3><c1a>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c1b>   DW_AT_type        : <0x22d9>
    <c1f>   DW_AT_artificial  : 1
 <3><c20>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <c21>   DW_AT_type        : <0xb80>
 <3><c25>: Abbrev Number: 0
 <2><c26>: Abbrev Number: 142 (DW_TAG_subprogram)
    <c28>   DW_AT_name        : (indirect string, offset: 0x1a54): flush
    <c2c>   DW_AT_decl_file   : 4
    <c2d>   DW_AT_decl_line   : 218
    <c2e>   DW_AT_virtuality  : 1	(virtual)
    <c2f>   DW_AT_vtable_elem_location: 2 byte block: 10 3 	(DW_OP_constu: 3)
    <c32>   DW_AT_containing_type: <0xb95>
    <c36>   DW_AT_declaration : 1
    <c37>   DW_AT_object_pointer: <0xc3f>
    <c3b>   DW_AT_sibling     : <0xc46>
 <3><c3f>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c40>   DW_AT_type        : <0x22d9>
    <c44>   DW_AT_artificial  : 1
 <3><c45>: Abbrev Number: 0
 <2><c46>: Abbrev Number: 90 (DW_TAG_subprogram)
    <c47>   DW_AT_name        : (indirect string, offset: 0x1e1b): availableForWrite
    <c4b>   DW_AT_decl_file   : 4
    <c4c>   DW_AT_decl_line   : 213
    <c4d>   DW_AT_type        : <0xafd>
    <c51>   DW_AT_virtuality  : 1	(virtual)
    <c52>   DW_AT_vtable_elem_location: 2 byte block: 10 2 	(DW_OP_constu: 2)
    <c55>   DW_AT_containing_type: <0xb95>
    <c59>   DW_AT_declaration : 1
    <c5a>   DW_AT_object_pointer: <0xc62>
    <c5e>   DW_AT_sibling     : <0xc69>
 <3><c62>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c63>   DW_AT_type        : <0x22d9>
    <c67>   DW_AT_artificial  : 1
 <3><c68>: Abbrev Number: 0
 <2><c69>: Abbrev Number: 116 (DW_TAG_subprogram)
    <c6a>   DW_AT_name        : (indirect string, offset: 0xbe5): _ZN7Serial_4readEv.part.2
    <c6e>   DW_AT_type        : <0xafd>
    <c72>   DW_AT_artificial  : 1
    <c73>   DW_AT_declaration : 1
 <2><c74>: Abbrev Number: 90 (DW_TAG_subprogram)
    <c75>   DW_AT_name        : (indirect string, offset: 0x214f): read
    <c79>   DW_AT_decl_file   : 4
    <c7a>   DW_AT_decl_line   : 203
    <c7b>   DW_AT_type        : <0xafd>
    <c7f>   DW_AT_virtuality  : 1	(virtual)
    <c80>   DW_AT_vtable_elem_location: 2 byte block: 10 5 	(DW_OP_constu: 5)
    <c83>   DW_AT_containing_type: <0xb95>
    <c87>   DW_AT_declaration : 1
    <c88>   DW_AT_object_pointer: <0xc90>
    <c8c>   DW_AT_sibling     : <0xc97>
 <3><c90>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <c91>   DW_AT_type        : <0x22d9>
    <c95>   DW_AT_artificial  : 1
 <3><c96>: Abbrev Number: 0
 <2><c97>: Abbrev Number: 90 (DW_TAG_subprogram)
    <c98>   DW_AT_name        : (indirect string, offset: 0x18da): peek
    <c9c>   DW_AT_decl_file   : 4
    <c9d>   DW_AT_decl_line   : 196
    <c9e>   DW_AT_type        : <0xafd>
    <ca2>   DW_AT_virtuality  : 1	(virtual)
    <ca3>   DW_AT_vtable_elem_location: 2 byte block: 10 6 	(DW_OP_constu: 6)
    <ca6>   DW_AT_containing_type: <0xb95>
    <caa>   DW_AT_declaration : 1
    <cab>   DW_AT_object_pointer: <0xcb3>
    <caf>   DW_AT_sibling     : <0xcba>
 <3><cb3>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <cb4>   DW_AT_type        : <0x22d9>
    <cb8>   DW_AT_artificial  : 1
 <3><cb9>: Abbrev Number: 0
 <2><cba>: Abbrev Number: 116 (DW_TAG_subprogram)
    <cbb>   DW_AT_name        : (indirect string, offset: 0x973): _ZN7Serial_9availableEv.part.1
    <cbf>   DW_AT_type        : <0xafd>
    <cc3>   DW_AT_artificial  : 1
    <cc4>   DW_AT_declaration : 1
 <2><cc5>: Abbrev Number: 90 (DW_TAG_subprogram)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x1137): available
    <cca>   DW_AT_decl_file   : 4
    <ccb>   DW_AT_decl_line   : 188
    <ccc>   DW_AT_type        : <0xafd>
    <cd0>   DW_AT_virtuality  : 1	(virtual)
    <cd1>   DW_AT_vtable_elem_location: 2 byte block: 10 4 	(DW_OP_constu: 4)
    <cd4>   DW_AT_containing_type: <0xb95>
    <cd8>   DW_AT_declaration : 1
    <cd9>   DW_AT_object_pointer: <0xce1>
    <cdd>   DW_AT_sibling     : <0xce8>
 <3><ce1>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <ce2>   DW_AT_type        : <0x22d9>
    <ce6>   DW_AT_artificial  : 1
 <3><ce7>: Abbrev Number: 0
 <2><ce8>: Abbrev Number: 143 (DW_TAG_subprogram)
    <cea>   DW_AT_name        : (indirect string, offset: 0x19db): _ZN7Serial_5writeEPKhj.part.4
    <cee>   DW_AT_type        : <0x1109>
    <cf2>   DW_AT_virtuality  : 1	(virtual)
    <cf3>   DW_AT_vtable_elem_location: 2 byte block: 10 1 	(DW_OP_constu: 1)
    <cf6>   DW_AT_containing_type: <0xb95>
    <cfa>   DW_AT_artificial  : 1
    <cfb>   DW_AT_declaration : 1
    <cfc>   DW_AT_object_pointer: <0xd04>
    <d00>   DW_AT_sibling     : <0xd15>
 <3><d04>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <d05>   DW_AT_type        : <0x22d9>
    <d09>   DW_AT_artificial  : 1
 <3><d0a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d0b>   DW_AT_type        : <0x1034>
 <3><d0f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d10>   DW_AT_type        : <0x1109>
 <3><d14>: Abbrev Number: 0
 <2><d15>: Abbrev Number: 144 (DW_TAG_subprogram)
    <d17>   DW_AT_name        : (indirect string, offset: 0x119a): write
    <d1b>   DW_AT_decl_file   : 4
    <d1c>   DW_AT_decl_line   : 228
    <d1d>   DW_AT_type        : <0x1109>
    <d21>   DW_AT_virtuality  : 1	(virtual)
    <d22>   DW_AT_vtable_elem_location: 2 byte block: 10 1 	(DW_OP_constu: 1)
    <d25>   DW_AT_containing_type: <0xb95>
    <d29>   DW_AT_declaration : 1
    <d2a>   DW_AT_object_pointer: <0xd2e>
 <3><d2e>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <d2f>   DW_AT_type        : <0x22d9>
    <d33>   DW_AT_artificial  : 1
 <3><d34>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d35>   DW_AT_type        : <0x1034>
 <3><d39>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <d3a>   DW_AT_type        : <0x1109>
 <3><d3e>: Abbrev Number: 0
 <2><d3f>: Abbrev Number: 0
 <1><d40>: Abbrev Number: 11 (DW_TAG_array_type)
    <d41>   DW_AT_type        : <0xa32>
    <d45>   DW_AT_sibling     : <0xd50>
 <2><d49>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <d4a>   DW_AT_type        : <0xd50>
    <d4e>   DW_AT_upper_bound : 63
 <2><d4f>: Abbrev Number: 0
 <1><d50>: Abbrev Number: 57 (DW_TAG_base_type)
    <d51>   DW_AT_byte_size   : 2
    <d52>   DW_AT_encoding    : 7	(unsigned)
    <d53>   DW_AT_name        : (indirect string, offset: 0x193b): unsigned int
 <1><d57>: Abbrev Number: 45 (DW_TAG_typedef)
    <d58>   DW_AT_name        : (indirect string, offset: 0xacd): uint16_t
    <d5c>   DW_AT_decl_file   : 27
    <d5d>   DW_AT_decl_line   : 128
    <d5e>   DW_AT_type        : <0xd50>
 <1><d62>: Abbrev Number: 7 (DW_TAG_const_type)
    <d63>   DW_AT_type        : <0xd57>
 <1><d67>: Abbrev Number: 77 (DW_TAG_volatile_type)
    <d68>   DW_AT_type        : <0xd57>
 <1><d6c>: Abbrev Number: 94 (DW_TAG_typedef)
    <d6d>   DW_AT_name        : u32
    <d71>   DW_AT_decl_file   : 26
    <d72>   DW_AT_decl_line   : 31
    <d73>   DW_AT_type        : <0xb79>
 <1><d77>: Abbrev Number: 45 (DW_TAG_typedef)
    <d78>   DW_AT_name        : (indirect string, offset: 0xd2b): LineInfo
    <d7c>   DW_AT_decl_file   : 4
    <d7d>   DW_AT_decl_line   : 39
    <d7e>   DW_AT_type        : <0xd87>
 <1><d82>: Abbrev Number: 77 (DW_TAG_volatile_type)
    <d83>   DW_AT_type        : <0xd77>
 <1><d87>: Abbrev Number: 63 (DW_TAG_structure_type)
    <d88>   DW_AT_name        : (indirect string, offset: 0xd2b): LineInfo
    <d8c>   DW_AT_byte_size   : 8
    <d8d>   DW_AT_decl_file   : 4
    <d8e>   DW_AT_decl_line   : 33
    <d8f>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xd2a): 8LineInfo
    <d93>   DW_AT_sibling     : <0xdde>
 <2><d97>: Abbrev Number: 12 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x213e): dwDTERate
    <d9c>   DW_AT_decl_file   : 4
    <d9d>   DW_AT_decl_line   : 34
    <d9e>   DW_AT_type        : <0xd6c>
    <da2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><da5>: Abbrev Number: 12 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0x2132): bCharFormat
    <daa>   DW_AT_decl_file   : 4
    <dab>   DW_AT_decl_line   : 35
    <dac>   DW_AT_type        : <0xa1e>
    <db0>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><db3>: Abbrev Number: 12 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x2058): bParityType
    <db8>   DW_AT_decl_file   : 4
    <db9>   DW_AT_decl_line   : 36
    <dba>   DW_AT_type        : <0xa1e>
    <dbe>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><dc1>: Abbrev Number: 12 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xef9): bDataBits
    <dc6>   DW_AT_decl_file   : 4
    <dc7>   DW_AT_decl_line   : 37
    <dc8>   DW_AT_type        : <0xa1e>
    <dcc>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><dcf>: Abbrev Number: 12 (DW_TAG_member)
    <dd0>   DW_AT_name        : (indirect string, offset: 0xd63): lineState
    <dd4>   DW_AT_decl_file   : 4
    <dd5>   DW_AT_decl_line   : 38
    <dd6>   DW_AT_type        : <0xa1e>
    <dda>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><ddd>: Abbrev Number: 0
 <1><dde>: Abbrev Number: 48 (DW_TAG_structure_type)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x1620): USBDevice_
    <de3>   DW_AT_byte_size   : 1
    <de4>   DW_AT_decl_file   : 29
    <de5>   DW_AT_decl_line   : 58
    <de6>   DW_AT_sibling     : <0xe00>
 <2><dea>: Abbrev Number: 145 (DW_TAG_subprogram)
    <dec>   DW_AT_name        : (indirect string, offset: 0x154b): attach
    <df0>   DW_AT_decl_file   : 2
    <df1>   DW_AT_decl_line   : 825
    <df3>   DW_AT_declaration : 1
    <df4>   DW_AT_object_pointer: <0xdf8>
 <3><df8>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <df9>   DW_AT_type        : <0x1f31>
    <dfd>   DW_AT_artificial  : 1
 <3><dfe>: Abbrev Number: 0
 <2><dff>: Abbrev Number: 0
 <1><e00>: Abbrev Number: 48 (DW_TAG_structure_type)
    <e01>   DW_AT_name        : (indirect string, offset: 0x1f46): Arduboy2Audio
    <e05>   DW_AT_byte_size   : 1
    <e06>   DW_AT_decl_file   : 30
    <e07>   DW_AT_decl_line   : 73
    <e08>   DW_AT_sibling     : <0xe41>
 <2><e0c>: Abbrev Number: 146 (DW_TAG_subprogram)
    <e0e>   DW_AT_name        : (indirect string, offset: 0xd9d): enabled
    <e12>   DW_AT_decl_file   : 1
    <e13>   DW_AT_decl_line   : 56
    <e14>   DW_AT_type        : <0x1be7>
    <e18>   DW_AT_declaration : 1
 <2><e19>: Abbrev Number: 117 (DW_TAG_subprogram)
    <e1a>   DW_AT_name        : off
    <e1e>   DW_AT_decl_file   : 1
    <e1f>   DW_AT_decl_line   : 23
    <e20>   DW_AT_declaration : 1
 <2><e21>: Abbrev Number: 117 (DW_TAG_subprogram)
    <e22>   DW_AT_name        : on
    <e25>   DW_AT_decl_file   : 1
    <e26>   DW_AT_decl_line   : 11
    <e27>   DW_AT_declaration : 1
 <2><e28>: Abbrev Number: 83 (DW_TAG_subprogram)
    <e29>   DW_AT_name        : (indirect string, offset: 0x19c7): saveOnOff
    <e2d>   DW_AT_decl_file   : 1
    <e2e>   DW_AT_decl_line   : 43
    <e2f>   DW_AT_declaration : 1
 <2><e30>: Abbrev Number: 83 (DW_TAG_subprogram)
    <e31>   DW_AT_name        : (indirect string, offset: 0x1f71): toggle
    <e35>   DW_AT_decl_file   : 1
    <e36>   DW_AT_decl_line   : 35
    <e37>   DW_AT_declaration : 1
 <2><e38>: Abbrev Number: 83 (DW_TAG_subprogram)
    <e39>   DW_AT_name        : (indirect string, offset: 0x16cb): begin
    <e3d>   DW_AT_decl_file   : 1
    <e3e>   DW_AT_decl_line   : 48
    <e3f>   DW_AT_declaration : 1
 <2><e40>: Abbrev Number: 0
 <1><e41>: Abbrev Number: 84 (DW_TAG_structure_type)
    <e42>   DW_AT_name        : (indirect string, offset: 0x11b7): Arduboy2Core
    <e46>   DW_AT_byte_size   : 1
    <e47>   DW_AT_decl_file   : 31
    <e48>   DW_AT_decl_line   : 335
    <e4a>   DW_AT_sibling     : <0xf2a>
 <2><e4e>: Abbrev Number: 91 (DW_TAG_subprogram)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x1552): sendLCDCommand
    <e53>   DW_AT_decl_file   : 5
    <e54>   DW_AT_decl_line   : 406
    <e56>   DW_AT_declaration : 1
    <e57>   DW_AT_sibling     : <0xe61>
 <3><e5b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e5c>   DW_AT_type        : <0xb80>
 <3><e60>: Abbrev Number: 0
 <2><e61>: Abbrev Number: 91 (DW_TAG_subprogram)
    <e62>   DW_AT_name        : (indirect string, offset: 0x1efe): digitalWriteRGB
    <e66>   DW_AT_decl_file   : 5
    <e67>   DW_AT_decl_line   : 496
    <e69>   DW_AT_declaration : 1
    <e6a>   DW_AT_sibling     : <0xe7e>
 <3><e6e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e6f>   DW_AT_type        : <0xb80>
 <3><e73>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e74>   DW_AT_type        : <0xb80>
 <3><e78>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e79>   DW_AT_type        : <0xb80>
 <3><e7d>: Abbrev Number: 0
 <2><e7e>: Abbrev Number: 91 (DW_TAG_subprogram)
    <e7f>   DW_AT_name        : (indirect string, offset: 0x1efe): digitalWriteRGB
    <e83>   DW_AT_decl_file   : 5
    <e84>   DW_AT_decl_line   : 510
    <e86>   DW_AT_declaration : 1
    <e87>   DW_AT_sibling     : <0xe96>
 <3><e8b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e8c>   DW_AT_type        : <0xb80>
 <3><e90>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <e91>   DW_AT_type        : <0xb80>
 <3><e95>: Abbrev Number: 0
 <2><e96>: Abbrev Number: 91 (DW_TAG_subprogram)
    <e97>   DW_AT_name        : (indirect string, offset: 0x1d52): paintScreen
    <e9b>   DW_AT_decl_file   : 5
    <e9c>   DW_AT_decl_line   : 333
    <e9e>   DW_AT_declaration : 1
    <e9f>   DW_AT_sibling     : <0xeae>
 <3><ea3>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ea4>   DW_AT_type        : <0x1fe0>
 <3><ea8>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ea9>   DW_AT_type        : <0x1be7>
 <3><ead>: Abbrev Number: 0
 <2><eae>: Abbrev Number: 91 (DW_TAG_subprogram)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x18ee): delayShort
    <eb3>   DW_AT_decl_file   : 5
    <eb4>   DW_AT_decl_line   : 582
    <eb6>   DW_AT_declaration : 1
    <eb7>   DW_AT_sibling     : <0xec1>
 <3><ebb>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ebc>   DW_AT_type        : <0xd57>
 <3><ec0>: Abbrev Number: 0
 <2><ec1>: Abbrev Number: 147 (DW_TAG_subprogram)
    <ec3>   DW_AT_name        : (indirect string, offset: 0x18f9): buttonsState
    <ec7>   DW_AT_decl_file   : 5
    <ec8>   DW_AT_decl_line   : 536
    <eca>   DW_AT_type        : <0xb80>
    <ece>   DW_AT_declaration : 1
 <2><ecf>: Abbrev Number: 83 (DW_TAG_subprogram)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xaa8): boot
    <ed4>   DW_AT_decl_file   : 5
    <ed5>   DW_AT_decl_line   : 81
    <ed6>   DW_AT_declaration : 1
 <2><ed7>: Abbrev Number: 148 (DW_TAG_subprogram)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x1827): bootPowerSaving
    <edd>   DW_AT_decl_file   : 5
    <ede>   DW_AT_decl_line   : 285
    <ee0>   DW_AT_accessibility: 2	(protected)
    <ee1>   DW_AT_declaration : 1
 <2><ee2>: Abbrev Number: 103 (DW_TAG_subprogram)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x167a): bootOLED
    <ee7>   DW_AT_decl_file   : 5
    <ee8>   DW_AT_decl_line   : 201
    <ee9>   DW_AT_accessibility: 2	(protected)
    <eea>   DW_AT_declaration : 1
 <2><eeb>: Abbrev Number: 103 (DW_TAG_subprogram)
    <eec>   DW_AT_name        : (indirect string, offset: 0x494): bootSPI
    <ef0>   DW_AT_decl_file   : 5
    <ef1>   DW_AT_decl_line   : 231
    <ef2>   DW_AT_accessibility: 2	(protected)
    <ef3>   DW_AT_declaration : 1
 <2><ef4>: Abbrev Number: 103 (DW_TAG_subprogram)
    <ef5>   DW_AT_name        : (indirect string, offset: 0xb00): bootPins
    <ef9>   DW_AT_decl_file   : 5
    <efa>   DW_AT_decl_line   : 116
    <efb>   DW_AT_accessibility: 2	(protected)
    <efc>   DW_AT_declaration : 1
 <2><efd>: Abbrev Number: 83 (DW_TAG_subprogram)
    <efe>   DW_AT_name        : (indirect string, offset: 0x1212): LCDCommandMode
    <f02>   DW_AT_decl_file   : 5
    <f03>   DW_AT_decl_line   : 225
    <f04>   DW_AT_declaration : 1
 <2><f05>: Abbrev Number: 113 (DW_TAG_subprogram)
    <f06>   DW_AT_name        : (indirect string, offset: 0x1c36): SPItransfer
    <f0a>   DW_AT_decl_file   : 5
    <f0b>   DW_AT_decl_line   : 239
    <f0c>   DW_AT_declaration : 1
    <f0d>   DW_AT_sibling     : <0xf17>
 <3><f11>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <f12>   DW_AT_type        : <0xb80>
 <3><f16>: Abbrev Number: 0
 <2><f17>: Abbrev Number: 83 (DW_TAG_subprogram)
    <f18>   DW_AT_name        : (indirect string, offset: 0x10b1): LCDDataMode
    <f1c>   DW_AT_decl_file   : 5
    <f1d>   DW_AT_decl_line   : 220
    <f1e>   DW_AT_declaration : 1
 <2><f1f>: Abbrev Number: 149 (DW_TAG_subprogram)
    <f21>   DW_AT_name        : (indirect string, offset: 0x1d36): idle
    <f25>   DW_AT_decl_file   : 5
    <f26>   DW_AT_decl_line   : 278
    <f28>   DW_AT_declaration : 1
 <2><f29>: Abbrev Number: 0
 <1><f2a>: Abbrev Number: 45 (DW_TAG_typedef)
    <f2b>   DW_AT_name        : (indirect string, offset: 0xace): int16_t
    <f2f>   DW_AT_decl_file   : 27
    <f30>   DW_AT_decl_line   : 127
    <f31>   DW_AT_type        : <0xafd>
 <1><f35>: Abbrev Number: 7 (DW_TAG_const_type)
    <f36>   DW_AT_type        : <0xf2a>
 <1><f3a>: Abbrev Number: 48 (DW_TAG_structure_type)
    <f3b>   DW_AT_name        : (indirect string, offset: 0xc3c): dvec3
    <f3f>   DW_AT_byte_size   : 6
    <f40>   DW_AT_decl_file   : 10
    <f41>   DW_AT_decl_line   : 255
    <f42>   DW_AT_sibling     : <0xf6b>
 <2><f46>: Abbrev Number: 29 (DW_TAG_member)
    <f47>   DW_AT_name        : x
    <f49>   DW_AT_decl_file   : 10
    <f4a>   DW_AT_decl_line   : 255
    <f4b>   DW_AT_type        : <0xf2a>
    <f4f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><f52>: Abbrev Number: 29 (DW_TAG_member)
    <f53>   DW_AT_name        : y
    <f55>   DW_AT_decl_file   : 10
    <f56>   DW_AT_decl_line   : 255
    <f57>   DW_AT_type        : <0xf2a>
    <f5b>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><f5e>: Abbrev Number: 29 (DW_TAG_member)
    <f5f>   DW_AT_name        : z
    <f61>   DW_AT_decl_file   : 10
    <f62>   DW_AT_decl_line   : 255
    <f63>   DW_AT_type        : <0xf2a>
    <f67>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><f6a>: Abbrev Number: 0
 <1><f6b>: Abbrev Number: 48 (DW_TAG_structure_type)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x1ee2): LockEP
    <f70>   DW_AT_byte_size   : 1
    <f71>   DW_AT_decl_file   : 2
    <f72>   DW_AT_decl_line   : 207
    <f73>   DW_AT_sibling     : <0xfbc>
 <2><f77>: Abbrev Number: 58 (DW_TAG_member)
    <f78>   DW_AT_name        : (indirect string, offset: 0xba5): _sreg
    <f7c>   DW_AT_decl_file   : 2
    <f7d>   DW_AT_decl_line   : 209
    <f7e>   DW_AT_type        : <0xa1e>
    <f82>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <f85>   DW_AT_accessibility: 3	(private)
 <2><f86>: Abbrev Number: 89 (DW_TAG_subprogram)
    <f87>   DW_AT_name        : (indirect string, offset: 0xd4d): __base_ctor 
    <f8b>   DW_AT_decl_file   : 2
    <f8c>   DW_AT_decl_line   : 211
    <f8d>   DW_AT_declaration : 1
    <f8e>   DW_AT_object_pointer: <0xf96>
    <f92>   DW_AT_sibling     : <0xfa2>
 <3><f96>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <f97>   DW_AT_type        : <0x235b>
    <f9b>   DW_AT_artificial  : 1
 <3><f9c>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <f9d>   DW_AT_type        : <0xa1e>
 <3><fa1>: Abbrev Number: 0
 <2><fa2>: Abbrev Number: 150 (DW_TAG_subprogram)
    <fa4>   DW_AT_external    : 1
    <fa5>   DW_AT_name        : (indirect string, offset: 0x8fd): __base_dtor 
    <fa9>   DW_AT_decl_file   : 2
    <faa>   DW_AT_decl_line   : 216
    <fab>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xd3e): _ZN6LockEPD2Ev
    <faf>   DW_AT_declaration : 1
    <fb0>   DW_AT_object_pointer: <0xfb4>
 <3><fb4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <fb5>   DW_AT_type        : <0x235b>
    <fb9>   DW_AT_artificial  : 1
 <3><fba>: Abbrev Number: 0
 <2><fbb>: Abbrev Number: 0
 <1><fbc>: Abbrev Number: 95 (DW_TAG_structure_type)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x1272): PluggableUSBModule
    <fc1>   DW_AT_byte_size   : 10
    <fc2>   DW_AT_decl_file   : 32
    <fc3>   DW_AT_decl_line   : 28
    <fc4>   DW_AT_containing_type: <0xfbc>
    <fc8>   DW_AT_sibling     : <0x1034>
 <2><fcc>: Abbrev Number: 114 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x126c): _vptr.PluggableUSBModule
    <fd1>   DW_AT_type        : <0xb05>
    <fd5>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <fd8>   DW_AT_artificial  : 1
 <2><fd9>: Abbrev Number: 58 (DW_TAG_member)
    <fda>   DW_AT_name        : (indirect string, offset: 0x13aa): pluggedInterface
    <fde>   DW_AT_decl_file   : 32
    <fdf>   DW_AT_decl_line   : 40
    <fe0>   DW_AT_type        : <0xb80>
    <fe4>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <fe7>   DW_AT_accessibility: 2	(protected)
 <2><fe8>: Abbrev Number: 58 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x1250): pluggedEndpoint
    <fed>   DW_AT_decl_file   : 32
    <fee>   DW_AT_decl_line   : 41
    <fef>   DW_AT_type        : <0xb80>
    <ff3>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
    <ff6>   DW_AT_accessibility: 2	(protected)
 <2><ff7>: Abbrev Number: 58 (DW_TAG_member)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x914): numEndpoints
    <ffc>   DW_AT_decl_file   : 32
    <ffd>   DW_AT_decl_line   : 43
    <ffe>   DW_AT_type        : <0xb90>
    <1002>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
    <1005>   DW_AT_accessibility: 2	(protected)
 <2><1006>: Abbrev Number: 58 (DW_TAG_member)
    <1007>   DW_AT_name        : (indirect string, offset: 0x1099): numInterfaces
    <100b>   DW_AT_decl_file   : 32
    <100c>   DW_AT_decl_line   : 44
    <100d>   DW_AT_type        : <0xb90>
    <1011>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
    <1014>   DW_AT_accessibility: 2	(protected)
 <2><1015>: Abbrev Number: 58 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0x2018): endpointType
    <101a>   DW_AT_decl_file   : 32
    <101b>   DW_AT_decl_line   : 45
    <101c>   DW_AT_type        : <0x1034>
    <1020>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
    <1023>   DW_AT_accessibility: 2	(protected)
 <2><1024>: Abbrev Number: 58 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0x2113): next
    <1029>   DW_AT_decl_file   : 32
    <102a>   DW_AT_decl_line   : 47
    <102b>   DW_AT_type        : <0x103a>
    <102f>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
    <1032>   DW_AT_accessibility: 2	(protected)
 <2><1033>: Abbrev Number: 0
 <1><1034>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <1035>   DW_AT_byte_size   : 2
    <1036>   DW_AT_type        : <0xb90>
 <1><103a>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <103b>   DW_AT_byte_size   : 2
    <103c>   DW_AT_type        : <0xfbc>
 <1><1040>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1041>   DW_AT_name        : (indirect string, offset: 0x747): PluggableUSB_
    <1045>   DW_AT_byte_size   : 4
    <1046>   DW_AT_decl_file   : 32
    <1047>   DW_AT_decl_line   : 52
    <1048>   DW_AT_sibling     : <0x1109>
 <2><104c>: Abbrev Number: 58 (DW_TAG_member)
    <104d>   DW_AT_name        : (indirect string, offset: 0x4a5): lastIf
    <1051>   DW_AT_decl_file   : 32
    <1052>   DW_AT_decl_line   : 62
    <1053>   DW_AT_type        : <0xb80>
    <1057>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
    <105a>   DW_AT_accessibility: 3	(private)
 <2><105b>: Abbrev Number: 58 (DW_TAG_member)
    <105c>   DW_AT_name        : (indirect string, offset: 0x1f78): lastEp
    <1060>   DW_AT_decl_file   : 32
    <1061>   DW_AT_decl_line   : 63
    <1062>   DW_AT_type        : <0xb80>
    <1066>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
    <1069>   DW_AT_accessibility: 3	(private)
 <2><106a>: Abbrev Number: 58 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x13ef): rootNode
    <106f>   DW_AT_decl_file   : 32
    <1070>   DW_AT_decl_line   : 64
    <1071>   DW_AT_type        : <0x103a>
    <1075>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
    <1078>   DW_AT_accessibility: 3	(private)
 <2><1079>: Abbrev Number: 89 (DW_TAG_subprogram)
    <107a>   DW_AT_name        : (indirect string, offset: 0xd4d): __base_ctor 
    <107e>   DW_AT_decl_file   : 3
    <107f>   DW_AT_decl_line   : 106
    <1080>   DW_AT_declaration : 1
    <1081>   DW_AT_object_pointer: <0x1089>
    <1085>   DW_AT_sibling     : <0x1090>
 <3><1089>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <108a>   DW_AT_type        : <0x2588>
    <108e>   DW_AT_artificial  : 1
 <3><108f>: Abbrev Number: 0
 <2><1090>: Abbrev Number: 96 (DW_TAG_subprogram)
    <1091>   DW_AT_name        : (indirect string, offset: 0x45e): getInterface
    <1095>   DW_AT_decl_file   : 3
    <1096>   DW_AT_decl_line   : 28
    <1097>   DW_AT_type        : <0xafd>
    <109b>   DW_AT_declaration : 1
    <109c>   DW_AT_object_pointer: <0x10a4>
    <10a0>   DW_AT_sibling     : <0x10b0>
 <3><10a4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10a5>   DW_AT_type        : <0x2588>
    <10a9>   DW_AT_artificial  : 1
 <3><10aa>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <10ab>   DW_AT_type        : <0x1fe0>
 <3><10af>: Abbrev Number: 0
 <2><10b0>: Abbrev Number: 96 (DW_TAG_subprogram)
    <10b1>   DW_AT_name        : (indirect string, offset: 0x11dc): getDescriptor
    <10b5>   DW_AT_decl_file   : 3
    <10b6>   DW_AT_decl_line   : 41
    <10b7>   DW_AT_type        : <0xafd>
    <10bb>   DW_AT_declaration : 1
    <10bc>   DW_AT_object_pointer: <0x10c4>
    <10c0>   DW_AT_sibling     : <0x10d0>
 <3><10c4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10c5>   DW_AT_type        : <0x2588>
    <10c9>   DW_AT_artificial  : 1
 <3><10ca>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <10cb>   DW_AT_type        : <0x9572>
 <3><10cf>: Abbrev Number: 0
 <2><10d0>: Abbrev Number: 89 (DW_TAG_subprogram)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x4f2): getShortName
    <10d5>   DW_AT_decl_file   : 3
    <10d6>   DW_AT_decl_line   : 53
    <10d7>   DW_AT_declaration : 1
    <10d8>   DW_AT_object_pointer: <0x10e0>
    <10dc>   DW_AT_sibling     : <0x10ec>
 <3><10e0>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10e1>   DW_AT_type        : <0x2588>
    <10e5>   DW_AT_artificial  : 1
 <3><10e6>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <10e7>   DW_AT_type        : <0x95b4>
 <3><10eb>: Abbrev Number: 0
 <2><10ec>: Abbrev Number: 118 (DW_TAG_subprogram)
    <10ed>   DW_AT_name        : (indirect string, offset: 0x11a5): setup
    <10f1>   DW_AT_decl_file   : 3
    <10f2>   DW_AT_decl_line   : 62
    <10f3>   DW_AT_type        : <0x1be7>
    <10f7>   DW_AT_declaration : 1
    <10f8>   DW_AT_object_pointer: <0x10fc>
 <3><10fc>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <10fd>   DW_AT_type        : <0x2588>
    <1101>   DW_AT_artificial  : 1
 <3><1102>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1103>   DW_AT_type        : <0x9572>
 <3><1107>: Abbrev Number: 0
 <2><1108>: Abbrev Number: 0
 <1><1109>: Abbrev Number: 45 (DW_TAG_typedef)
    <110a>   DW_AT_name        : (indirect string, offset: 0x396): size_t
    <110e>   DW_AT_decl_file   : 33
    <110f>   DW_AT_decl_line   : 216
    <1110>   DW_AT_type        : <0xd50>
 <1><1114>: Abbrev Number: 45 (DW_TAG_typedef)
    <1115>   DW_AT_name        : (indirect string, offset: 0x1838): USBSetup
    <1119>   DW_AT_decl_file   : 26
    <111a>   DW_AT_decl_line   : 170
    <111b>   DW_AT_type        : <0x111f>
 <1><111f>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1120>   DW_AT_name        : (indirect string, offset: 0x1838): USBSetup
    <1124>   DW_AT_byte_size   : 8
    <1125>   DW_AT_decl_file   : 26
    <1126>   DW_AT_decl_line   : 163
    <1127>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1837): 8USBSetup
    <112b>   DW_AT_sibling     : <0x1184>
 <2><112f>: Abbrev Number: 12 (DW_TAG_member)
    <1130>   DW_AT_name        : (indirect string, offset: 0xa3f): bmRequestType
    <1134>   DW_AT_decl_file   : 26
    <1135>   DW_AT_decl_line   : 164
    <1136>   DW_AT_type        : <0xb80>
    <113a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><113d>: Abbrev Number: 12 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x164f): bRequest
    <1142>   DW_AT_decl_file   : 26
    <1143>   DW_AT_decl_line   : 165
    <1144>   DW_AT_type        : <0xb80>
    <1148>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><114b>: Abbrev Number: 12 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0x676): wValueL
    <1150>   DW_AT_decl_file   : 26
    <1151>   DW_AT_decl_line   : 166
    <1152>   DW_AT_type        : <0xb80>
    <1156>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1159>: Abbrev Number: 12 (DW_TAG_member)
    <115a>   DW_AT_name        : (indirect string, offset: 0x659): wValueH
    <115e>   DW_AT_decl_file   : 26
    <115f>   DW_AT_decl_line   : 167
    <1160>   DW_AT_type        : <0xb80>
    <1164>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1167>: Abbrev Number: 12 (DW_TAG_member)
    <1168>   DW_AT_name        : (indirect string, offset: 0x18df): wIndex
    <116c>   DW_AT_decl_file   : 26
    <116d>   DW_AT_decl_line   : 168
    <116e>   DW_AT_type        : <0xd57>
    <1172>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1175>: Abbrev Number: 12 (DW_TAG_member)
    <1176>   DW_AT_name        : (indirect string, offset: 0xdc4): wLength
    <117a>   DW_AT_decl_file   : 26
    <117b>   DW_AT_decl_line   : 169
    <117c>   DW_AT_type        : <0xd57>
    <1180>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1183>: Abbrev Number: 0
 <1><1184>: Abbrev Number: 45 (DW_TAG_typedef)
    <1185>   DW_AT_name        : (indirect string, offset: 0x1838): USBSetup
    <1189>   DW_AT_decl_file   : 26
    <118a>   DW_AT_decl_line   : 170
    <118b>   DW_AT_type        : <0x118f>
 <1><118f>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1190>   DW_AT_name        : (indirect string, offset: 0x1838): USBSetup
    <1194>   DW_AT_byte_size   : 8
    <1195>   DW_AT_decl_file   : 26
    <1196>   DW_AT_decl_line   : 163
    <1197>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1837): 8USBSetup
    <119b>   DW_AT_sibling     : <0x11f4>
 <2><119f>: Abbrev Number: 12 (DW_TAG_member)
    <11a0>   DW_AT_name        : (indirect string, offset: 0xa3f): bmRequestType
    <11a4>   DW_AT_decl_file   : 26
    <11a5>   DW_AT_decl_line   : 164
    <11a6>   DW_AT_type        : <0xb80>
    <11aa>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><11ad>: Abbrev Number: 12 (DW_TAG_member)
    <11ae>   DW_AT_name        : (indirect string, offset: 0x164f): bRequest
    <11b2>   DW_AT_decl_file   : 26
    <11b3>   DW_AT_decl_line   : 165
    <11b4>   DW_AT_type        : <0xb80>
    <11b8>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><11bb>: Abbrev Number: 12 (DW_TAG_member)
    <11bc>   DW_AT_name        : (indirect string, offset: 0x676): wValueL
    <11c0>   DW_AT_decl_file   : 26
    <11c1>   DW_AT_decl_line   : 166
    <11c2>   DW_AT_type        : <0xb80>
    <11c6>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><11c9>: Abbrev Number: 12 (DW_TAG_member)
    <11ca>   DW_AT_name        : (indirect string, offset: 0x659): wValueH
    <11ce>   DW_AT_decl_file   : 26
    <11cf>   DW_AT_decl_line   : 167
    <11d0>   DW_AT_type        : <0xb80>
    <11d4>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><11d7>: Abbrev Number: 12 (DW_TAG_member)
    <11d8>   DW_AT_name        : (indirect string, offset: 0x18df): wIndex
    <11dc>   DW_AT_decl_file   : 26
    <11dd>   DW_AT_decl_line   : 168
    <11de>   DW_AT_type        : <0xd57>
    <11e2>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><11e5>: Abbrev Number: 12 (DW_TAG_member)
    <11e6>   DW_AT_name        : (indirect string, offset: 0xdc4): wLength
    <11ea>   DW_AT_decl_file   : 26
    <11eb>   DW_AT_decl_line   : 169
    <11ec>   DW_AT_type        : <0xd57>
    <11f0>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><11f3>: Abbrev Number: 0
 <1><11f4>: Abbrev Number: 48 (DW_TAG_structure_type)
    <11f5>   DW_AT_name        : (indirect string, offset: 0x84c): Arduboy2Base
    <11f9>   DW_AT_byte_size   : 1
    <11fa>   DW_AT_decl_file   : 34
    <11fb>   DW_AT_decl_line   : 211
    <11fc>   DW_AT_sibling     : <0x1211>
 <2><1200>: Abbrev Number: 151 (DW_TAG_subprogram)
    <1202>   DW_AT_name        : (indirect string, offset: 0x1bca): display
    <1206>   DW_AT_decl_file   : 35
    <1207>   DW_AT_decl_line   : 1002
    <1209>   DW_AT_declaration : 1
 <3><120a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <120b>   DW_AT_type        : <0x1be7>
 <3><120f>: Abbrev Number: 0
 <2><1210>: Abbrev Number: 0
 <1><1211>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1212>   DW_AT_name        : (indirect string, offset: 0x1720): EEPROMClass
    <1216>   DW_AT_byte_size   : 1
    <1217>   DW_AT_decl_file   : 22
    <1218>   DW_AT_decl_line   : 116
    <1219>   DW_AT_sibling     : <0x1247>
 <2><121d>: Abbrev Number: 152 (DW_TAG_subprogram)
    <121f>   DW_AT_name        : (indirect string, offset: 0x1115): _ZN11EEPROMClass6updateEih.isra.1
    <1223>   DW_AT_artificial  : 1
    <1224>   DW_AT_declaration : 1
    <1225>   DW_AT_sibling     : <0x1234>
 <3><1229>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <122a>   DW_AT_type        : <0xafd>
 <3><122e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <122f>   DW_AT_type        : <0xb80>
 <3><1233>: Abbrev Number: 0
 <2><1234>: Abbrev Number: 153 (DW_TAG_subprogram)
    <1236>   DW_AT_name        : (indirect string, offset: 0x107a): _ZN11EEPROMClass4readEi.isra.0
    <123a>   DW_AT_type        : <0xb80>
    <123e>   DW_AT_artificial  : 1
    <123f>   DW_AT_declaration : 1
 <3><1240>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1241>   DW_AT_type        : <0xafd>
 <3><1245>: Abbrev Number: 0
 <2><1246>: Abbrev Number: 0
 <1><1247>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1248>   DW_AT_name        : (indirect string, offset: 0x16f7): EERef
    <124c>   DW_AT_byte_size   : 2
    <124d>   DW_AT_decl_file   : 22
    <124e>   DW_AT_decl_line   : 36
    <124f>   DW_AT_sibling     : <0x12df>
 <2><1253>: Abbrev Number: 12 (DW_TAG_member)
    <1254>   DW_AT_name        : (indirect string, offset: 0x1ffa): index
    <1258>   DW_AT_decl_file   : 22
    <1259>   DW_AT_decl_line   : 76
    <125a>   DW_AT_type        : <0xafd>
    <125e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1261>: Abbrev Number: 96 (DW_TAG_subprogram)
    <1262>   DW_AT_name        : (indirect string, offset: 0x192f): update
    <1266>   DW_AT_decl_file   : 22
    <1267>   DW_AT_decl_line   : 59
    <1268>   DW_AT_type        : <0x9048>
    <126c>   DW_AT_declaration : 1
    <126d>   DW_AT_object_pointer: <0x1275>
    <1271>   DW_AT_sibling     : <0x1281>
 <3><1275>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1276>   DW_AT_type        : <0x904e>
    <127a>   DW_AT_artificial  : 1
 <3><127b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <127c>   DW_AT_type        : <0xb80>
 <3><1280>: Abbrev Number: 0
 <2><1281>: Abbrev Number: 96 (DW_TAG_subprogram)
    <1282>   DW_AT_name        : (indirect string, offset: 0x929): operator*
    <1286>   DW_AT_decl_file   : 22
    <1287>   DW_AT_decl_line   : 42
    <1288>   DW_AT_type        : <0xb80>
    <128c>   DW_AT_declaration : 1
    <128d>   DW_AT_object_pointer: <0x1295>
    <1291>   DW_AT_sibling     : <0x129c>
 <3><1295>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1296>   DW_AT_type        : <0x907c>
    <129a>   DW_AT_artificial  : 1
 <3><129b>: Abbrev Number: 0
 <2><129c>: Abbrev Number: 154 (DW_TAG_subprogram)
    <129e>   DW_AT_external    : 1
    <129f>   DW_AT_name        : (indirect string, offset: 0x11ef): operator 3
    <12a3>   DW_AT_decl_file   : 22
    <12a4>   DW_AT_decl_line   : 43
    <12a5>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1378): _ZNK5EERefcvhEv
    <12a9>   DW_AT_type        : <0xb80>
    <12ad>   DW_AT_declaration : 1
    <12ae>   DW_AT_object_pointer: <0x12b6>
    <12b2>   DW_AT_sibling     : <0x12bd>
 <3><12b6>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <12b7>   DW_AT_type        : <0x907c>
    <12bb>   DW_AT_artificial  : 1
 <3><12bc>: Abbrev Number: 0
 <2><12bd>: Abbrev Number: 119 (DW_TAG_subprogram)
    <12be>   DW_AT_external    : 1
    <12bf>   DW_AT_name        : (indirect string, offset: 0x9e3): operator=
    <12c3>   DW_AT_decl_file   : 22
    <12c4>   DW_AT_decl_line   : 47
    <12c5>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0xeeb): _ZN5EERefaSEh
    <12c9>   DW_AT_type        : <0x9048>
    <12cd>   DW_AT_declaration : 1
    <12ce>   DW_AT_object_pointer: <0x12d2>
 <3><12d2>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <12d3>   DW_AT_type        : <0x904e>
    <12d7>   DW_AT_artificial  : 1
 <3><12d8>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <12d9>   DW_AT_type        : <0xb80>
 <3><12dd>: Abbrev Number: 0
 <2><12de>: Abbrev Number: 0
 <1><12df>: Abbrev Number: 7 (DW_TAG_const_type)
    <12e0>   DW_AT_type        : <0x1247>
 <1><12e4>: Abbrev Number: 45 (DW_TAG_typedef)
    <12e5>   DW_AT_name        : (indirect string, offset: 0x922): int8_t
    <12e9>   DW_AT_decl_file   : 27
    <12ea>   DW_AT_decl_line   : 125
    <12eb>   DW_AT_type        : <0x12f4>
 <1><12ef>: Abbrev Number: 7 (DW_TAG_const_type)
    <12f0>   DW_AT_type        : <0x12e4>
 <1><12f4>: Abbrev Number: 57 (DW_TAG_base_type)
    <12f5>   DW_AT_byte_size   : 1
    <12f6>   DW_AT_encoding    : 6	(signed char)
    <12f7>   DW_AT_name        : (indirect string, offset: 0xa33): signed char
 <1><12fb>: Abbrev Number: 48 (DW_TAG_structure_type)
    <12fc>   DW_AT_name        : (indirect string, offset: 0x1a77): array
    <1300>   DW_AT_byte_size   : 18
    <1301>   DW_AT_decl_file   : 10
    <1302>   DW_AT_decl_line   : 107
    <1303>   DW_AT_sibling     : <0x131e>
 <2><1307>: Abbrev Number: 29 (DW_TAG_member)
    <1308>   DW_AT_name        : d_
    <130b>   DW_AT_decl_file   : 10
    <130c>   DW_AT_decl_line   : 109
    <130d>   DW_AT_type        : <0x1323>
    <1311>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1314>: Abbrev Number: 155 (DW_TAG_subprogram)
    <1316>   DW_AT_name        : (indirect string, offset: 0x75c): _ZNK5arrayIhLj18EE6verifyEj.isra.0
    <131a>   DW_AT_artificial  : 1
    <131b>   DW_AT_accessibility: 3	(private)
    <131c>   DW_AT_declaration : 1
 <2><131d>: Abbrev Number: 0
 <1><131e>: Abbrev Number: 7 (DW_TAG_const_type)
    <131f>   DW_AT_type        : <0x12fb>
 <1><1323>: Abbrev Number: 11 (DW_TAG_array_type)
    <1324>   DW_AT_type        : <0xa32>
    <1328>   DW_AT_sibling     : <0x1333>
 <2><132c>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <132d>   DW_AT_type        : <0xd50>
    <1331>   DW_AT_upper_bound : 17
 <2><1332>: Abbrev Number: 0
 <1><1333>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1334>   DW_AT_name        : (indirect string, offset: 0xc36): dvec2
    <1338>   DW_AT_byte_size   : 4
    <1339>   DW_AT_decl_file   : 10
    <133a>   DW_AT_decl_line   : 252
    <133b>   DW_AT_sibling     : <0x1358>
 <2><133f>: Abbrev Number: 29 (DW_TAG_member)
    <1340>   DW_AT_name        : x
    <1342>   DW_AT_decl_file   : 10
    <1343>   DW_AT_decl_line   : 252
    <1344>   DW_AT_type        : <0xf2a>
    <1348>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><134b>: Abbrev Number: 29 (DW_TAG_member)
    <134c>   DW_AT_name        : y
    <134e>   DW_AT_decl_file   : 10
    <134f>   DW_AT_decl_line   : 252
    <1350>   DW_AT_type        : <0xf2a>
    <1354>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1357>: Abbrev Number: 0
 <1><1358>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1359>   DW_AT_name        : (indirect string, offset: 0x1a77): array
    <135d>   DW_AT_byte_size   : 18
    <135e>   DW_AT_decl_file   : 10
    <135f>   DW_AT_decl_line   : 107
    <1360>   DW_AT_sibling     : <0x1372>
 <2><1364>: Abbrev Number: 29 (DW_TAG_member)
    <1365>   DW_AT_name        : d_
    <1368>   DW_AT_decl_file   : 10
    <1369>   DW_AT_decl_line   : 109
    <136a>   DW_AT_type        : <0x1372>
    <136e>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1371>: Abbrev Number: 0
 <1><1372>: Abbrev Number: 11 (DW_TAG_array_type)
    <1373>   DW_AT_type        : <0xafd>
    <1377>   DW_AT_sibling     : <0x1382>
 <2><137b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <137c>   DW_AT_type        : <0xd50>
    <1380>   DW_AT_upper_bound : 8
 <2><1381>: Abbrev Number: 0
 <1><1382>: Abbrev Number: 97 (DW_TAG_typedef)
    <1383>   DW_AT_name        : (indirect string, offset: 0x134b): dmat3
    <1387>   DW_AT_decl_file   : 10
    <1388>   DW_AT_decl_line   : 257
    <138a>   DW_AT_type        : <0x1358>
 <1><138e>: Abbrev Number: 7 (DW_TAG_const_type)
    <138f>   DW_AT_type        : <0x1382>
 <1><1393>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1394>   DW_AT_name        : (indirect string, offset: 0x1a77): array
    <1398>   DW_AT_byte_size   : 9
    <1399>   DW_AT_decl_file   : 10
    <139a>   DW_AT_decl_line   : 107
    <139b>   DW_AT_sibling     : <0x13ad>
 <2><139f>: Abbrev Number: 29 (DW_TAG_member)
    <13a0>   DW_AT_name        : d_
    <13a3>   DW_AT_decl_file   : 10
    <13a4>   DW_AT_decl_line   : 109
    <13a5>   DW_AT_type        : <0x13ad>
    <13a9>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><13ac>: Abbrev Number: 0
 <1><13ad>: Abbrev Number: 11 (DW_TAG_array_type)
    <13ae>   DW_AT_type        : <0x12f4>
    <13b2>   DW_AT_sibling     : <0x13bd>
 <2><13b6>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <13b7>   DW_AT_type        : <0xd50>
    <13bb>   DW_AT_upper_bound : 8
 <2><13bc>: Abbrev Number: 0
 <1><13bd>: Abbrev Number: 97 (DW_TAG_typedef)
    <13be>   DW_AT_name        : (indirect string, offset: 0x134c): mat3
    <13c2>   DW_AT_decl_file   : 10
    <13c3>   DW_AT_decl_line   : 256
    <13c5>   DW_AT_type        : <0x1393>
 <1><13c9>: Abbrev Number: 7 (DW_TAG_const_type)
    <13ca>   DW_AT_type        : <0x13bd>
 <1><13ce>: Abbrev Number: 48 (DW_TAG_structure_type)
    <13cf>   DW_AT_name        : (indirect string, offset: 0xc3d): vec3
    <13d3>   DW_AT_byte_size   : 3
    <13d4>   DW_AT_decl_file   : 10
    <13d5>   DW_AT_decl_line   : 253
    <13d6>   DW_AT_sibling     : <0x13ff>
 <2><13da>: Abbrev Number: 29 (DW_TAG_member)
    <13db>   DW_AT_name        : x
    <13dd>   DW_AT_decl_file   : 10
    <13de>   DW_AT_decl_line   : 253
    <13df>   DW_AT_type        : <0x12e4>
    <13e3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><13e6>: Abbrev Number: 29 (DW_TAG_member)
    <13e7>   DW_AT_name        : y
    <13e9>   DW_AT_decl_file   : 10
    <13ea>   DW_AT_decl_line   : 253
    <13eb>   DW_AT_type        : <0x12e4>
    <13ef>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><13f2>: Abbrev Number: 29 (DW_TAG_member)
    <13f3>   DW_AT_name        : z
    <13f5>   DW_AT_decl_file   : 10
    <13f6>   DW_AT_decl_line   : 253
    <13f7>   DW_AT_type        : <0x12e4>
    <13fb>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><13fe>: Abbrev Number: 0
 <1><13ff>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1400>   DW_AT_name        : (indirect string, offset: 0x1300): uvec3
    <1404>   DW_AT_byte_size   : 3
    <1405>   DW_AT_decl_file   : 10
    <1406>   DW_AT_decl_line   : 254
    <1407>   DW_AT_sibling     : <0x1430>
 <2><140b>: Abbrev Number: 29 (DW_TAG_member)
    <140c>   DW_AT_name        : x
    <140e>   DW_AT_decl_file   : 10
    <140f>   DW_AT_decl_line   : 254
    <1410>   DW_AT_type        : <0xb80>
    <1414>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1417>: Abbrev Number: 29 (DW_TAG_member)
    <1418>   DW_AT_name        : y
    <141a>   DW_AT_decl_file   : 10
    <141b>   DW_AT_decl_line   : 254
    <141c>   DW_AT_type        : <0xb80>
    <1420>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1423>: Abbrev Number: 29 (DW_TAG_member)
    <1424>   DW_AT_name        : z
    <1426>   DW_AT_decl_file   : 10
    <1427>   DW_AT_decl_line   : 254
    <1428>   DW_AT_type        : <0xb80>
    <142c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><142f>: Abbrev Number: 0
 <1><1430>: Abbrev Number: 84 (DW_TAG_structure_type)
    <1431>   DW_AT_name        : (indirect string, offset: 0x1886): phys_box
    <1435>   DW_AT_byte_size   : 8
    <1436>   DW_AT_decl_file   : 10
    <1437>   DW_AT_decl_line   : 261
    <1439>   DW_AT_sibling     : <0x147a>
 <2><143d>: Abbrev Number: 41 (DW_TAG_member)
    <143e>   DW_AT_name        : (indirect string, offset: 0x18d5): size
    <1442>   DW_AT_decl_file   : 10
    <1443>   DW_AT_decl_line   : 263
    <1445>   DW_AT_type        : <0x13ff>
    <1449>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><144c>: Abbrev Number: 59 (DW_TAG_member)
    <144d>   DW_AT_name        : pos
    <1451>   DW_AT_decl_file   : 10
    <1452>   DW_AT_decl_line   : 264
    <1454>   DW_AT_type        : <0x13ce>
    <1458>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><145b>: Abbrev Number: 59 (DW_TAG_member)
    <145c>   DW_AT_name        : yaw
    <1460>   DW_AT_decl_file   : 10
    <1461>   DW_AT_decl_line   : 265
    <1463>   DW_AT_type        : <0xb80>
    <1467>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><146a>: Abbrev Number: 41 (DW_TAG_member)
    <146b>   DW_AT_name        : (indirect string, offset: 0x1049): pitch
    <146f>   DW_AT_decl_file   : 10
    <1470>   DW_AT_decl_line   : 266
    <1472>   DW_AT_type        : <0x12e4>
    <1476>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><1479>: Abbrev Number: 0
 <1><147a>: Abbrev Number: 7 (DW_TAG_const_type)
    <147b>   DW_AT_type        : <0x1430>
 <1><147f>: Abbrev Number: 45 (DW_TAG_typedef)
    <1480>   DW_AT_name        : (indirect string, offset: 0x1ee9): uint32_t
    <1484>   DW_AT_decl_file   : 27
    <1485>   DW_AT_decl_line   : 130
    <1486>   DW_AT_type        : <0xb79>
 <1><148a>: Abbrev Number: 48 (DW_TAG_structure_type)
    <148b>   DW_AT_name        : (indirect string, offset: 0x1692): ctrl
    <148f>   DW_AT_byte_size   : 2
    <1490>   DW_AT_decl_file   : 17
    <1491>   DW_AT_decl_line   : 9
    <1492>   DW_AT_sibling     : <0x14cb>
 <2><1496>: Abbrev Number: 12 (DW_TAG_member)
    <1497>   DW_AT_name        : (indirect string, offset: 0xc0b): dydt
    <149b>   DW_AT_decl_file   : 17
    <149c>   DW_AT_decl_line   : 11
    <149d>   DW_AT_type        : <0xf2a>
    <14a1>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><14a4>: Abbrev Number: 118 (DW_TAG_subprogram)
    <14a5>   DW_AT_name        : (indirect string, offset: 0x10ac): step
    <14a9>   DW_AT_decl_file   : 17
    <14aa>   DW_AT_decl_line   : 16
    <14ab>   DW_AT_type        : <0xf2a>
    <14af>   DW_AT_declaration : 1
    <14b0>   DW_AT_object_pointer: <0x14b4>
 <3><14b4>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <14b5>   DW_AT_type        : <0x6635>
    <14b9>   DW_AT_artificial  : 1
 <3><14ba>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14bb>   DW_AT_type        : <0xf2a>
 <3><14bf>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14c0>   DW_AT_type        : <0xf2a>
 <3><14c4>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <14c5>   DW_AT_type        : <0xb80>
 <3><14c9>: Abbrev Number: 0
 <2><14ca>: Abbrev Number: 0
 <1><14cb>: Abbrev Number: 156 (DW_TAG_enumeration_type)
    <14cd>   DW_AT_name        : st
    <14d0>   DW_AT_enum_class  : 1
    <14d1>   DW_AT_encoding    : 7	(unsigned)
    <14d2>   DW_AT_byte_size   : 1
    <14d3>   DW_AT_type        : <0xa32>
    <14d7>   DW_AT_decl_file   : 10
    <14d8>   DW_AT_decl_line   : 333
    <14da>   DW_AT_sibling     : <0x1522>
 <2><14de>: Abbrev Number: 69 (DW_TAG_enumerator)
    <14df>   DW_AT_name        : (indirect string, offset: 0x3ce): TITLE
    <14e3>   DW_AT_const_value : 0
 <2><14e4>: Abbrev Number: 69 (DW_TAG_enumerator)
    <14e5>   DW_AT_name        : (indirect string, offset: 0xb9f): LEVEL
    <14e9>   DW_AT_const_value : 1
 <2><14ea>: Abbrev Number: 157 (DW_TAG_enumerator)
    <14ec>   DW_AT_name        : AIM
    <14f0>   DW_AT_const_value : 2
 <2><14f1>: Abbrev Number: 69 (DW_TAG_enumerator)
    <14f2>   DW_AT_name        : (indirect string, offset: 0x17e1): ROLLING
    <14f6>   DW_AT_const_value : 3
 <2><14f7>: Abbrev Number: 69 (DW_TAG_enumerator)
    <14f8>   DW_AT_name        : (indirect string, offset: 0x1e06): HOLE
    <14fc>   DW_AT_const_value : 4
 <2><14fd>: Abbrev Number: 69 (DW_TAG_enumerator)
    <14fe>   DW_AT_name        : (indirect string, offset: 0x8e5): SCORE
    <1502>   DW_AT_const_value : 5
 <2><1503>: Abbrev Number: 69 (DW_TAG_enumerator)
    <1504>   DW_AT_name        : (indirect string, offset: 0x1d92): MENU
    <1508>   DW_AT_const_value : 6
 <2><1509>: Abbrev Number: 69 (DW_TAG_enumerator)
    <150a>   DW_AT_name        : (indirect string, offset: 0x5da): OVERVIEW
    <150e>   DW_AT_const_value : 7
 <2><150f>: Abbrev Number: 69 (DW_TAG_enumerator)
    <1510>   DW_AT_name        : (indirect string, offset: 0x1c07): PITCH
    <1514>   DW_AT_const_value : 8
 <2><1515>: Abbrev Number: 69 (DW_TAG_enumerator)
    <1516>   DW_AT_name        : (indirect string, offset: 0x1de3): HISCORES
    <151a>   DW_AT_const_value : 9
 <2><151b>: Abbrev Number: 69 (DW_TAG_enumerator)
    <151c>   DW_AT_name        : (indirect string, offset: 0x570): FX_COURSE
    <1520>   DW_AT_const_value : 10
 <2><1521>: Abbrev Number: 0
 <1><1522>: Abbrev Number: 48 (DW_TAG_structure_type)
    <1523>   DW_AT_name        : (indirect string, offset: 0x1300): uvec3
    <1527>   DW_AT_byte_size   : 3
    <1528>   DW_AT_decl_file   : 10
    <1529>   DW_AT_decl_line   : 254
    <152a>   DW_AT_sibling     : <0x1553>
 <2><152e>: Abbrev Number: 29 (DW_TAG_member)
    <152f>   DW_AT_name        : x
    <1531>   DW_AT_decl_file   : 10
    <1532>   DW_AT_decl_line   : 254
    <1533>   DW_AT_type        : <0xb80>
    <1537>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><153a>: Abbrev Number: 29 (DW_TAG_member)
    <153b>   DW_AT_name        : y
    <153d>   DW_AT_decl_file   : 10
    <153e>   DW_AT_decl_line   : 254
    <153f>   DW_AT_type        : <0xb80>
    <1543>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1546>: Abbrev Number: 29 (DW_TAG_member)
    <1547>   DW_AT_name        : z
    <1549>   DW_AT_decl_file   : 10
    <154a>   DW_AT_decl_line   : 254
    <154b>   DW_AT_type        : <0xb80>
    <154f>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1552>: Abbrev Number: 0
 <1><1553>: Abbrev Number: 84 (DW_TAG_structure_type)
    <1554>   DW_AT_name        : (indirect string, offset: 0x1886): phys_box
    <1558>   DW_AT_byte_size   : 8
    <1559>   DW_AT_decl_file   : 10
    <155a>   DW_AT_decl_line   : 261
    <155c>   DW_AT_sibling     : <0x159d>
 <2><1560>: Abbrev Number: 41 (DW_TAG_member)
    <1561>   DW_AT_name        : (indirect string, offset: 0x18d5): size
    <1565>   DW_AT_decl_file   : 10
    <1566>   DW_AT_decl_line   : 263
    <1568>   DW_AT_type        : <0x1522>
    <156c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><156f>: Abbrev Number: 59 (DW_TAG_member)
    <1570>   DW_AT_name        : pos
    <1574>   DW_AT_decl_file   : 10
    <1575>   DW_AT_decl_line   : 264
    <1577>   DW_AT_type        : <0x13ce>
    <157b>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><157e>: Abbrev Number: 59 (DW_TAG_member)
    <157f>   DW_AT_name        : yaw
    <1583>   DW_AT_decl_file   : 10
    <1584>   DW_AT_decl_line   : 265
    <1586>   DW_AT_type        : <0xb80>
    <158a>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><158d>: Abbrev Number: 41 (DW_TAG_member)
    <158e>   DW_AT_name        : (indirect string, offset: 0x1049): pitch
    <1592>   DW_AT_decl_file   : 10
    <1593>   DW_AT_decl_line   : 266
    <1595>   DW_AT_type        : <0x12e4>
    <1599>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><159c>: Abbrev Number: 0
 <1><159d>: Abbrev Number: 7 (DW_TAG_const_type)
    <159e>   DW_AT_type        : <0x1553>
 <1><15a2>: Abbrev Number: 84 (DW_TAG_structure_type)
    <15a3>   DW_AT_name        : (indirect string, offset: 0x412): level_info_ext
    <15a7>   DW_AT_byte_size   : 21
    <15a8>   DW_AT_decl_file   : 10
    <15a9>   DW_AT_decl_line   : 277
    <15ab>   DW_AT_sibling     : <0x1619>
 <2><15af>: Abbrev Number: 41 (DW_TAG_member)
    <15b0>   DW_AT_name        : (indirect string, offset: 0x6f1): num_verts
    <15b4>   DW_AT_decl_file   : 10
    <15b5>   DW_AT_decl_line   : 279
    <15b7>   DW_AT_type        : <0xb80>
    <15bb>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><15be>: Abbrev Number: 41 (DW_TAG_member)
    <15bf>   DW_AT_name        : (indirect string, offset: 0x1221): pat_faces
    <15c3>   DW_AT_decl_file   : 10
    <15c4>   DW_AT_decl_line   : 280
    <15c6>   DW_AT_type        : <0x1619>
    <15ca>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><15cd>: Abbrev Number: 41 (DW_TAG_member)
    <15ce>   DW_AT_name        : (indirect string, offset: 0x54e): num_faces
    <15d2>   DW_AT_decl_file   : 10
    <15d3>   DW_AT_decl_line   : 281
    <15d5>   DW_AT_type        : <0xb80>
    <15d9>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><15dc>: Abbrev Number: 41 (DW_TAG_member)
    <15dd>   DW_AT_name        : (indirect string, offset: 0x216c): num_boxes
    <15e1>   DW_AT_decl_file   : 10
    <15e2>   DW_AT_decl_line   : 282
    <15e4>   DW_AT_type        : <0xb80>
    <15e8>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><15eb>: Abbrev Number: 41 (DW_TAG_member)
    <15ec>   DW_AT_name        : (indirect string, offset: 0x18cb): ball_pos
    <15f0>   DW_AT_decl_file   : 10
    <15f1>   DW_AT_decl_line   : 283
    <15f3>   DW_AT_type        : <0xf3a>
    <15f7>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><15fa>: Abbrev Number: 41 (DW_TAG_member)
    <15fb>   DW_AT_name        : (indirect string, offset: 0x1c86): flag_pos
    <15ff>   DW_AT_decl_file   : 10
    <1600>   DW_AT_decl_line   : 284
    <1602>   DW_AT_type        : <0xf3a>
    <1606>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><1609>: Abbrev Number: 59 (DW_TAG_member)
    <160a>   DW_AT_name        : par
    <160e>   DW_AT_decl_file   : 10
    <160f>   DW_AT_decl_line   : 285
    <1611>   DW_AT_type        : <0xb80>
    <1615>   DW_AT_data_member_location: 2 byte block: 23 14 	(DW_OP_plus_uconst: 20)
 <2><1618>: Abbrev Number: 0
 <1><1619>: Abbrev Number: 11 (DW_TAG_array_type)
    <161a>   DW_AT_type        : <0xb80>
    <161e>   DW_AT_sibling     : <0x1629>
 <2><1622>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1623>   DW_AT_type        : <0xd50>
    <1627>   DW_AT_upper_bound : 4
 <2><1628>: Abbrev Number: 0
 <1><1629>: Abbrev Number: 84 (DW_TAG_structure_type)
    <162a>   DW_AT_name        : (indirect string, offset: 0x1e59): level_info
    <162e>   DW_AT_byte_size   : 27
    <162f>   DW_AT_decl_file   : 10
    <1630>   DW_AT_decl_line   : 288
    <1632>   DW_AT_sibling     : <0x1673>
 <2><1636>: Abbrev Number: 41 (DW_TAG_member)
    <1637>   DW_AT_name        : (indirect string, offset: 0x6f5): verts
    <163b>   DW_AT_decl_file   : 10
    <163c>   DW_AT_decl_line   : 290
    <163e>   DW_AT_type        : <0x1678>
    <1642>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1645>: Abbrev Number: 41 (DW_TAG_member)
    <1646>   DW_AT_name        : (indirect string, offset: 0x552): faces
    <164a>   DW_AT_decl_file   : 10
    <164b>   DW_AT_decl_line   : 291
    <164d>   DW_AT_type        : <0x1034>
    <1651>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1654>: Abbrev Number: 41 (DW_TAG_member)
    <1655>   DW_AT_name        : (indirect string, offset: 0x2170): boxes
    <1659>   DW_AT_decl_file   : 10
    <165a>   DW_AT_decl_line   : 292
    <165c>   DW_AT_type        : <0x167e>
    <1660>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1663>: Abbrev Number: 59 (DW_TAG_member)
    <1664>   DW_AT_name        : ext
    <1668>   DW_AT_decl_file   : 10
    <1669>   DW_AT_decl_line   : 293
    <166b>   DW_AT_type        : <0x15a2>
    <166f>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1672>: Abbrev Number: 0
 <1><1673>: Abbrev Number: 7 (DW_TAG_const_type)
    <1674>   DW_AT_type        : <0x1629>
 <1><1678>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <1679>   DW_AT_byte_size   : 2
    <167a>   DW_AT_type        : <0x12ef>
 <1><167e>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <167f>   DW_AT_byte_size   : 2
    <1680>   DW_AT_type        : <0x159d>
 <1><1684>: Abbrev Number: 45 (DW_TAG_typedef)
    <1685>   DW_AT_name        : (indirect string, offset: 0x1eea): int32_t
    <1689>   DW_AT_decl_file   : 27
    <168a>   DW_AT_decl_line   : 129
    <168b>   DW_AT_type        : <0x1699>
 <1><168f>: Abbrev Number: 7 (DW_TAG_const_type)
    <1690>   DW_AT_type        : <0x1684>
 <1><1694>: Abbrev Number: 77 (DW_TAG_volatile_type)
    <1695>   DW_AT_type        : <0x1684>
 <1><1699>: Abbrev Number: 57 (DW_TAG_base_type)
    <169a>   DW_AT_byte_size   : 4
    <169b>   DW_AT_encoding    : 5	(signed)
    <169c>   DW_AT_name        : (indirect string, offset: 0x7cd): long int
 <1><16a0>: Abbrev Number: 94 (DW_TAG_typedef)
    <16a1>   DW_AT_name        : u16
    <16a5>   DW_AT_decl_file   : 26
    <16a6>   DW_AT_decl_line   : 30
    <16a7>   DW_AT_type        : <0x16b0>
 <1><16ab>: Abbrev Number: 7 (DW_TAG_const_type)
    <16ac>   DW_AT_type        : <0x16a0>
 <1><16b0>: Abbrev Number: 57 (DW_TAG_base_type)
    <16b1>   DW_AT_byte_size   : 2
    <16b2>   DW_AT_encoding    : 7	(unsigned)
    <16b3>   DW_AT_name        : (indirect string, offset: 0x1fa2): short unsigned int
 <1><16b7>: Abbrev Number: 45 (DW_TAG_typedef)
    <16b8>   DW_AT_name        : (indirect string, offset: 0x13fa): DeviceDescriptor
    <16bc>   DW_AT_decl_file   : 36
    <16bd>   DW_AT_decl_line   : 152
    <16be>   DW_AT_type        : <0x16c7>
 <1><16c2>: Abbrev Number: 7 (DW_TAG_const_type)
    <16c3>   DW_AT_type        : <0x16b7>
 <1><16c7>: Abbrev Number: 63 (DW_TAG_structure_type)
    <16c8>   DW_AT_name        : (indirect string, offset: 0x13fa): DeviceDescriptor
    <16cc>   DW_AT_byte_size   : 18
    <16cd>   DW_AT_decl_file   : 36
    <16ce>   DW_AT_decl_line   : 137
    <16cf>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x13f8): 16DeviceDescriptor
    <16d3>   DW_AT_sibling     : <0x179c>
 <2><16d7>: Abbrev Number: 29 (DW_TAG_member)
    <16d8>   DW_AT_name        : len
    <16dc>   DW_AT_decl_file   : 36
    <16dd>   DW_AT_decl_line   : 138
    <16de>   DW_AT_type        : <0xa1e>
    <16e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><16e5>: Abbrev Number: 12 (DW_TAG_member)
    <16e6>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <16ea>   DW_AT_decl_file   : 36
    <16eb>   DW_AT_decl_line   : 139
    <16ec>   DW_AT_type        : <0xa1e>
    <16f0>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><16f3>: Abbrev Number: 12 (DW_TAG_member)
    <16f4>   DW_AT_name        : (indirect string, offset: 0x3fc): usbVersion
    <16f8>   DW_AT_decl_file   : 36
    <16f9>   DW_AT_decl_line   : 140
    <16fa>   DW_AT_type        : <0x16a0>
    <16fe>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1701>: Abbrev Number: 12 (DW_TAG_member)
    <1702>   DW_AT_name        : (indirect string, offset: 0x1e85): deviceClass
    <1706>   DW_AT_decl_file   : 36
    <1707>   DW_AT_decl_line   : 141
    <1708>   DW_AT_type        : <0xa1e>
    <170c>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><170f>: Abbrev Number: 12 (DW_TAG_member)
    <1710>   DW_AT_name        : (indirect string, offset: 0xaf1): deviceSubClass
    <1714>   DW_AT_decl_file   : 36
    <1715>   DW_AT_decl_line   : 142
    <1716>   DW_AT_type        : <0xa1e>
    <171a>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><171d>: Abbrev Number: 12 (DW_TAG_member)
    <171e>   DW_AT_name        : (indirect string, offset: 0x18b2): deviceProtocol
    <1722>   DW_AT_decl_file   : 36
    <1723>   DW_AT_decl_line   : 143
    <1724>   DW_AT_type        : <0xa1e>
    <1728>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><172b>: Abbrev Number: 12 (DW_TAG_member)
    <172c>   DW_AT_name        : (indirect string, offset: 0xa8d): packetSize0
    <1730>   DW_AT_decl_file   : 36
    <1731>   DW_AT_decl_line   : 144
    <1732>   DW_AT_type        : <0xa1e>
    <1736>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><1739>: Abbrev Number: 12 (DW_TAG_member)
    <173a>   DW_AT_name        : (indirect string, offset: 0x1a95): idVendor
    <173e>   DW_AT_decl_file   : 36
    <173f>   DW_AT_decl_line   : 145
    <1740>   DW_AT_type        : <0x16a0>
    <1744>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1747>: Abbrev Number: 12 (DW_TAG_member)
    <1748>   DW_AT_name        : (indirect string, offset: 0x1a6d): idProduct
    <174c>   DW_AT_decl_file   : 36
    <174d>   DW_AT_decl_line   : 146
    <174e>   DW_AT_type        : <0x16a0>
    <1752>   DW_AT_data_member_location: 2 byte block: 23 a 	(DW_OP_plus_uconst: 10)
 <2><1755>: Abbrev Number: 12 (DW_TAG_member)
    <1756>   DW_AT_name        : (indirect string, offset: 0x833): deviceVersion
    <175a>   DW_AT_decl_file   : 36
    <175b>   DW_AT_decl_line   : 147
    <175c>   DW_AT_type        : <0x16a0>
    <1760>   DW_AT_data_member_location: 2 byte block: 23 c 	(DW_OP_plus_uconst: 12)
 <2><1763>: Abbrev Number: 12 (DW_TAG_member)
    <1764>   DW_AT_name        : (indirect string, offset: 0x142f): iManufacturer
    <1768>   DW_AT_decl_file   : 36
    <1769>   DW_AT_decl_line   : 148
    <176a>   DW_AT_type        : <0xa1e>
    <176e>   DW_AT_data_member_location: 2 byte block: 23 e 	(DW_OP_plus_uconst: 14)
 <2><1771>: Abbrev Number: 12 (DW_TAG_member)
    <1772>   DW_AT_name        : (indirect string, offset: 0x1e45): iProduct
    <1776>   DW_AT_decl_file   : 36
    <1777>   DW_AT_decl_line   : 149
    <1778>   DW_AT_type        : <0xa1e>
    <177c>   DW_AT_data_member_location: 2 byte block: 23 f 	(DW_OP_plus_uconst: 15)
 <2><177f>: Abbrev Number: 12 (DW_TAG_member)
    <1780>   DW_AT_name        : (indirect string, offset: 0x1024): iSerialNumber
    <1784>   DW_AT_decl_file   : 36
    <1785>   DW_AT_decl_line   : 150
    <1786>   DW_AT_type        : <0xa1e>
    <178a>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><178d>: Abbrev Number: 12 (DW_TAG_member)
    <178e>   DW_AT_name        : (indirect string, offset: 0x198f): bNumConfigurations
    <1792>   DW_AT_decl_file   : 36
    <1793>   DW_AT_decl_line   : 151
    <1794>   DW_AT_type        : <0xa1e>
    <1798>   DW_AT_data_member_location: 2 byte block: 23 11 	(DW_OP_plus_uconst: 17)
 <2><179b>: Abbrev Number: 0
 <1><179c>: Abbrev Number: 45 (DW_TAG_typedef)
    <179d>   DW_AT_name        : (indirect string, offset: 0x2097): EndpointDescriptor
    <17a1>   DW_AT_decl_file   : 36
    <17a2>   DW_AT_decl_line   : 191
    <17a3>   DW_AT_type        : <0x17a7>
 <1><17a7>: Abbrev Number: 63 (DW_TAG_structure_type)
    <17a8>   DW_AT_name        : (indirect string, offset: 0x2097): EndpointDescriptor
    <17ac>   DW_AT_byte_size   : 7
    <17ad>   DW_AT_decl_file   : 36
    <17ae>   DW_AT_decl_line   : 184
    <17af>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x2095): 18EndpointDescriptor
    <17b3>   DW_AT_sibling     : <0x180c>
 <2><17b7>: Abbrev Number: 29 (DW_TAG_member)
    <17b8>   DW_AT_name        : len
    <17bc>   DW_AT_decl_file   : 36
    <17bd>   DW_AT_decl_line   : 185
    <17be>   DW_AT_type        : <0xa1e>
    <17c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><17c5>: Abbrev Number: 12 (DW_TAG_member)
    <17c6>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <17ca>   DW_AT_decl_file   : 36
    <17cb>   DW_AT_decl_line   : 186
    <17cc>   DW_AT_type        : <0xa1e>
    <17d0>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><17d3>: Abbrev Number: 12 (DW_TAG_member)
    <17d4>   DW_AT_name        : (indirect string, offset: 0x18c6): addr
    <17d8>   DW_AT_decl_file   : 36
    <17d9>   DW_AT_decl_line   : 187
    <17da>   DW_AT_type        : <0xa1e>
    <17de>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><17e1>: Abbrev Number: 12 (DW_TAG_member)
    <17e2>   DW_AT_name        : (indirect string, offset: 0xc10): attr
    <17e6>   DW_AT_decl_file   : 36
    <17e7>   DW_AT_decl_line   : 188
    <17e8>   DW_AT_type        : <0xa1e>
    <17ec>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><17ef>: Abbrev Number: 12 (DW_TAG_member)
    <17f0>   DW_AT_name        : (indirect string, offset: 0x820): packetSize
    <17f4>   DW_AT_decl_file   : 36
    <17f5>   DW_AT_decl_line   : 189
    <17f6>   DW_AT_type        : <0x16a0>
    <17fa>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><17fd>: Abbrev Number: 12 (DW_TAG_member)
    <17fe>   DW_AT_name        : (indirect string, offset: 0x71f): interval
    <1802>   DW_AT_decl_file   : 36
    <1803>   DW_AT_decl_line   : 190
    <1804>   DW_AT_type        : <0xa1e>
    <1808>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><180b>: Abbrev Number: 0
 <1><180c>: Abbrev Number: 45 (DW_TAG_typedef)
    <180d>   DW_AT_name        : (indirect string, offset: 0x501): InterfaceDescriptor
    <1811>   DW_AT_decl_file   : 36
    <1812>   DW_AT_decl_line   : 180
    <1813>   DW_AT_type        : <0x1817>
 <1><1817>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1818>   DW_AT_name        : (indirect string, offset: 0x501): InterfaceDescriptor
    <181c>   DW_AT_byte_size   : 9
    <181d>   DW_AT_decl_file   : 36
    <181e>   DW_AT_decl_line   : 170
    <181f>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x4ff): 19InterfaceDescriptor
    <1823>   DW_AT_sibling     : <0x18a6>
 <2><1827>: Abbrev Number: 29 (DW_TAG_member)
    <1828>   DW_AT_name        : len
    <182c>   DW_AT_decl_file   : 36
    <182d>   DW_AT_decl_line   : 171
    <182e>   DW_AT_type        : <0xa1e>
    <1832>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1835>: Abbrev Number: 12 (DW_TAG_member)
    <1836>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <183a>   DW_AT_decl_file   : 36
    <183b>   DW_AT_decl_line   : 172
    <183c>   DW_AT_type        : <0xa1e>
    <1840>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1843>: Abbrev Number: 12 (DW_TAG_member)
    <1844>   DW_AT_name        : (indirect string, offset: 0x10fd): number
    <1848>   DW_AT_decl_file   : 36
    <1849>   DW_AT_decl_line   : 173
    <184a>   DW_AT_type        : <0xa1e>
    <184e>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1851>: Abbrev Number: 12 (DW_TAG_member)
    <1852>   DW_AT_name        : (indirect string, offset: 0x172c): alternate
    <1856>   DW_AT_decl_file   : 36
    <1857>   DW_AT_decl_line   : 174
    <1858>   DW_AT_type        : <0xa1e>
    <185c>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><185f>: Abbrev Number: 12 (DW_TAG_member)
    <1860>   DW_AT_name        : (indirect string, offset: 0x914): numEndpoints
    <1864>   DW_AT_decl_file   : 36
    <1865>   DW_AT_decl_line   : 175
    <1866>   DW_AT_type        : <0xa1e>
    <186a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><186d>: Abbrev Number: 12 (DW_TAG_member)
    <186e>   DW_AT_name        : (indirect string, offset: 0x6d4): interfaceClass
    <1872>   DW_AT_decl_file   : 36
    <1873>   DW_AT_decl_line   : 176
    <1874>   DW_AT_type        : <0xa1e>
    <1878>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><187b>: Abbrev Number: 12 (DW_TAG_member)
    <187c>   DW_AT_name        : (indirect string, offset: 0xc90): interfaceSubClass
    <1880>   DW_AT_decl_file   : 36
    <1881>   DW_AT_decl_line   : 177
    <1882>   DW_AT_type        : <0xa1e>
    <1886>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1889>: Abbrev Number: 12 (DW_TAG_member)
    <188a>   DW_AT_name        : (indirect string, offset: 0x128c): protocol
    <188e>   DW_AT_decl_file   : 36
    <188f>   DW_AT_decl_line   : 178
    <1890>   DW_AT_type        : <0xa1e>
    <1894>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><1897>: Abbrev Number: 12 (DW_TAG_member)
    <1898>   DW_AT_name        : (indirect string, offset: 0x1b14): iInterface
    <189c>   DW_AT_decl_file   : 36
    <189d>   DW_AT_decl_line   : 179
    <189e>   DW_AT_type        : <0xa1e>
    <18a2>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><18a5>: Abbrev Number: 0
 <1><18a6>: Abbrev Number: 45 (DW_TAG_typedef)
    <18a7>   DW_AT_name        : (indirect string, offset: 0x1fb7): CDCCSInterfaceDescriptor
    <18ab>   DW_AT_decl_file   : 36
    <18ac>   DW_AT_decl_line   : 215
    <18ad>   DW_AT_type        : <0x18b1>
 <1><18b1>: Abbrev Number: 63 (DW_TAG_structure_type)
    <18b2>   DW_AT_name        : (indirect string, offset: 0x1fb7): CDCCSInterfaceDescriptor
    <18b6>   DW_AT_byte_size   : 5
    <18b7>   DW_AT_decl_file   : 36
    <18b8>   DW_AT_decl_line   : 209
    <18b9>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1fb5): 24CDCCSInterfaceDescriptor
    <18bd>   DW_AT_sibling     : <0x1906>
 <2><18c1>: Abbrev Number: 29 (DW_TAG_member)
    <18c2>   DW_AT_name        : len
    <18c6>   DW_AT_decl_file   : 36
    <18c7>   DW_AT_decl_line   : 210
    <18c8>   DW_AT_type        : <0xa1e>
    <18cc>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><18cf>: Abbrev Number: 12 (DW_TAG_member)
    <18d0>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <18d4>   DW_AT_decl_file   : 36
    <18d5>   DW_AT_decl_line   : 211
    <18d6>   DW_AT_type        : <0xa1e>
    <18da>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><18dd>: Abbrev Number: 12 (DW_TAG_member)
    <18de>   DW_AT_name        : (indirect string, offset: 0xc15): subtype
    <18e2>   DW_AT_decl_file   : 36
    <18e3>   DW_AT_decl_line   : 212
    <18e4>   DW_AT_type        : <0xa1e>
    <18e8>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><18eb>: Abbrev Number: 29 (DW_TAG_member)
    <18ec>   DW_AT_name        : d0
    <18ef>   DW_AT_decl_file   : 36
    <18f0>   DW_AT_decl_line   : 213
    <18f1>   DW_AT_type        : <0xa1e>
    <18f5>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><18f8>: Abbrev Number: 29 (DW_TAG_member)
    <18f9>   DW_AT_name        : d1
    <18fc>   DW_AT_decl_file   : 36
    <18fd>   DW_AT_decl_line   : 214
    <18fe>   DW_AT_type        : <0xa1e>
    <1902>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1905>: Abbrev Number: 0
 <1><1906>: Abbrev Number: 45 (DW_TAG_typedef)
    <1907>   DW_AT_name        : (indirect string, offset: 0x173d): ACMFunctionalDescriptor
    <190b>   DW_AT_decl_file   : 36
    <190c>   DW_AT_decl_line   : 240
    <190d>   DW_AT_type        : <0x1911>
 <1><1911>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1912>   DW_AT_name        : (indirect string, offset: 0x173d): ACMFunctionalDescriptor
    <1916>   DW_AT_byte_size   : 4
    <1917>   DW_AT_decl_file   : 36
    <1918>   DW_AT_decl_line   : 235
    <1919>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x173b): 23ACMFunctionalDescriptor
    <191d>   DW_AT_sibling     : <0x195a>
 <2><1921>: Abbrev Number: 29 (DW_TAG_member)
    <1922>   DW_AT_name        : len
    <1926>   DW_AT_decl_file   : 36
    <1927>   DW_AT_decl_line   : 236
    <1928>   DW_AT_type        : <0xa1e>
    <192c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><192f>: Abbrev Number: 12 (DW_TAG_member)
    <1930>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <1934>   DW_AT_decl_file   : 36
    <1935>   DW_AT_decl_line   : 237
    <1936>   DW_AT_type        : <0xa1e>
    <193a>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><193d>: Abbrev Number: 12 (DW_TAG_member)
    <193e>   DW_AT_name        : (indirect string, offset: 0xc15): subtype
    <1942>   DW_AT_decl_file   : 36
    <1943>   DW_AT_decl_line   : 238
    <1944>   DW_AT_type        : <0xa1e>
    <1948>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><194b>: Abbrev Number: 12 (DW_TAG_member)
    <194c>   DW_AT_name        : (indirect string, offset: 0x1d79): bmCapabilities
    <1950>   DW_AT_decl_file   : 36
    <1951>   DW_AT_decl_line   : 239
    <1952>   DW_AT_type        : <0xa1e>
    <1956>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1959>: Abbrev Number: 0
 <1><195a>: Abbrev Number: 45 (DW_TAG_typedef)
    <195b>   DW_AT_name        : (indirect string, offset: 0x609): CMFunctionalDescriptor
    <195f>   DW_AT_decl_file   : 36
    <1960>   DW_AT_decl_line   : 232
    <1961>   DW_AT_type        : <0x1965>
 <1><1965>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1966>   DW_AT_name        : (indirect string, offset: 0x609): CMFunctionalDescriptor
    <196a>   DW_AT_byte_size   : 5
    <196b>   DW_AT_decl_file   : 36
    <196c>   DW_AT_decl_line   : 226
    <196d>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x607): 22CMFunctionalDescriptor
    <1971>   DW_AT_sibling     : <0x19bc>
 <2><1975>: Abbrev Number: 29 (DW_TAG_member)
    <1976>   DW_AT_name        : len
    <197a>   DW_AT_decl_file   : 36
    <197b>   DW_AT_decl_line   : 227
    <197c>   DW_AT_type        : <0xa1e>
    <1980>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1983>: Abbrev Number: 12 (DW_TAG_member)
    <1984>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <1988>   DW_AT_decl_file   : 36
    <1989>   DW_AT_decl_line   : 228
    <198a>   DW_AT_type        : <0xa1e>
    <198e>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><1991>: Abbrev Number: 12 (DW_TAG_member)
    <1992>   DW_AT_name        : (indirect string, offset: 0xc15): subtype
    <1996>   DW_AT_decl_file   : 36
    <1997>   DW_AT_decl_line   : 229
    <1998>   DW_AT_type        : <0xa1e>
    <199c>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><199f>: Abbrev Number: 12 (DW_TAG_member)
    <19a0>   DW_AT_name        : (indirect string, offset: 0x1d79): bmCapabilities
    <19a4>   DW_AT_decl_file   : 36
    <19a5>   DW_AT_decl_line   : 230
    <19a6>   DW_AT_type        : <0xa1e>
    <19aa>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><19ad>: Abbrev Number: 12 (DW_TAG_member)
    <19ae>   DW_AT_name        : (indirect string, offset: 0xab4): bDataInterface
    <19b2>   DW_AT_decl_file   : 36
    <19b3>   DW_AT_decl_line   : 231
    <19b4>   DW_AT_type        : <0xa1e>
    <19b8>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><19bb>: Abbrev Number: 0
 <1><19bc>: Abbrev Number: 45 (DW_TAG_typedef)
    <19bd>   DW_AT_name        : (indirect string, offset: 0x3d6): IADDescriptor
    <19c1>   DW_AT_decl_file   : 36
    <19c2>   DW_AT_decl_line   : 205
    <19c3>   DW_AT_type        : <0x19c7>
 <1><19c7>: Abbrev Number: 63 (DW_TAG_structure_type)
    <19c8>   DW_AT_name        : (indirect string, offset: 0x3d6): IADDescriptor
    <19cc>   DW_AT_byte_size   : 8
    <19cd>   DW_AT_decl_file   : 36
    <19ce>   DW_AT_decl_line   : 196
    <19cf>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x3d4): 13IADDescriptor
    <19d3>   DW_AT_sibling     : <0x1a48>
 <2><19d7>: Abbrev Number: 29 (DW_TAG_member)
    <19d8>   DW_AT_name        : len
    <19dc>   DW_AT_decl_file   : 36
    <19dd>   DW_AT_decl_line   : 197
    <19de>   DW_AT_type        : <0xa1e>
    <19e2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><19e5>: Abbrev Number: 12 (DW_TAG_member)
    <19e6>   DW_AT_name        : (indirect string, offset: 0x1bae): dtype
    <19ea>   DW_AT_decl_file   : 36
    <19eb>   DW_AT_decl_line   : 198
    <19ec>   DW_AT_type        : <0xa1e>
    <19f0>   DW_AT_data_member_location: 2 byte block: 23 1 	(DW_OP_plus_uconst: 1)
 <2><19f3>: Abbrev Number: 12 (DW_TAG_member)
    <19f4>   DW_AT_name        : (indirect string, offset: 0x10ce): firstInterface
    <19f8>   DW_AT_decl_file   : 36
    <19f9>   DW_AT_decl_line   : 199
    <19fa>   DW_AT_type        : <0xa1e>
    <19fe>   DW_AT_data_member_location: 2 byte block: 23 2 	(DW_OP_plus_uconst: 2)
 <2><1a01>: Abbrev Number: 12 (DW_TAG_member)
    <1a02>   DW_AT_name        : (indirect string, offset: 0x12ac): interfaceCount
    <1a06>   DW_AT_decl_file   : 36
    <1a07>   DW_AT_decl_line   : 200
    <1a08>   DW_AT_type        : <0xa1e>
    <1a0c>   DW_AT_data_member_location: 2 byte block: 23 3 	(DW_OP_plus_uconst: 3)
 <2><1a0f>: Abbrev Number: 12 (DW_TAG_member)
    <1a10>   DW_AT_name        : (indirect string, offset: 0x1388): functionClass
    <1a14>   DW_AT_decl_file   : 36
    <1a15>   DW_AT_decl_line   : 201
    <1a16>   DW_AT_type        : <0xa1e>
    <1a1a>   DW_AT_data_member_location: 2 byte block: 23 4 	(DW_OP_plus_uconst: 4)
 <2><1a1d>: Abbrev Number: 12 (DW_TAG_member)
    <1a1e>   DW_AT_name        : (indirect string, offset: 0xfa3): funtionSubClass
    <1a22>   DW_AT_decl_file   : 36
    <1a23>   DW_AT_decl_line   : 202
    <1a24>   DW_AT_type        : <0xa1e>
    <1a28>   DW_AT_data_member_location: 2 byte block: 23 5 	(DW_OP_plus_uconst: 5)
 <2><1a2b>: Abbrev Number: 12 (DW_TAG_member)
    <1a2c>   DW_AT_name        : (indirect string, offset: 0xf21): functionProtocol
    <1a30>   DW_AT_decl_file   : 36
    <1a31>   DW_AT_decl_line   : 203
    <1a32>   DW_AT_type        : <0xa1e>
    <1a36>   DW_AT_data_member_location: 2 byte block: 23 6 	(DW_OP_plus_uconst: 6)
 <2><1a39>: Abbrev Number: 12 (DW_TAG_member)
    <1a3a>   DW_AT_name        : (indirect string, offset: 0x1b14): iInterface
    <1a3e>   DW_AT_decl_file   : 36
    <1a3f>   DW_AT_decl_line   : 204
    <1a40>   DW_AT_type        : <0xa1e>
    <1a44>   DW_AT_data_member_location: 2 byte block: 23 7 	(DW_OP_plus_uconst: 7)
 <2><1a47>: Abbrev Number: 0
 <1><1a48>: Abbrev Number: 97 (DW_TAG_typedef)
    <1a49>   DW_AT_name        : (indirect string, offset: 0x1d6b): CDCDescriptor
    <1a4d>   DW_AT_decl_file   : 36
    <1a4e>   DW_AT_decl_line   : 259
    <1a50>   DW_AT_type        : <0x1a59>
 <1><1a54>: Abbrev Number: 7 (DW_TAG_const_type)
    <1a55>   DW_AT_type        : <0x1a48>
 <1><1a59>: Abbrev Number: 63 (DW_TAG_structure_type)
    <1a5a>   DW_AT_name        : (indirect string, offset: 0x1d6b): CDCDescriptor
    <1a5e>   DW_AT_byte_size   : 66
    <1a5f>   DW_AT_decl_file   : 36
    <1a60>   DW_AT_decl_line   : 243
    <1a61>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x1d69): 13CDCDescriptor
    <1a65>   DW_AT_sibling     : <0x1af8>
 <2><1a69>: Abbrev Number: 29 (DW_TAG_member)
    <1a6a>   DW_AT_name        : iad
    <1a6e>   DW_AT_decl_file   : 36
    <1a6f>   DW_AT_decl_line   : 245
    <1a70>   DW_AT_type        : <0x19bc>
    <1a74>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1a77>: Abbrev Number: 29 (DW_TAG_member)
    <1a78>   DW_AT_name        : cif
    <1a7c>   DW_AT_decl_file   : 36
    <1a7d>   DW_AT_decl_line   : 248
    <1a7e>   DW_AT_type        : <0x180c>
    <1a82>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><1a85>: Abbrev Number: 12 (DW_TAG_member)
    <1a86>   DW_AT_name        : (indirect string, offset: 0xae1): header
    <1a8a>   DW_AT_decl_file   : 36
    <1a8b>   DW_AT_decl_line   : 249
    <1a8c>   DW_AT_type        : <0x18a6>
    <1a90>   DW_AT_data_member_location: 2 byte block: 23 11 	(DW_OP_plus_uconst: 17)
 <2><1a93>: Abbrev Number: 12 (DW_TAG_member)
    <1a94>   DW_AT_name        : (indirect string, offset: 0xa99): callManagement
    <1a98>   DW_AT_decl_file   : 36
    <1a99>   DW_AT_decl_line   : 250
    <1a9a>   DW_AT_type        : <0x195a>
    <1a9e>   DW_AT_data_member_location: 2 byte block: 23 16 	(DW_OP_plus_uconst: 22)
 <2><1aa1>: Abbrev Number: 12 (DW_TAG_member)
    <1aa2>   DW_AT_name        : (indirect string, offset: 0xfca): controlManagement
    <1aa6>   DW_AT_decl_file   : 36
    <1aa7>   DW_AT_decl_line   : 251
    <1aa8>   DW_AT_type        : <0x1906>
    <1aac>   DW_AT_data_member_location: 2 byte block: 23 1b 	(DW_OP_plus_uconst: 27)
 <2><1aaf>: Abbrev Number: 12 (DW_TAG_member)
    <1ab0>   DW_AT_name        : (indirect string, offset: 0x1f0e): functionalDescriptor
    <1ab4>   DW_AT_decl_file   : 36
    <1ab5>   DW_AT_decl_line   : 252
    <1ab6>   DW_AT_type        : <0x18a6>
    <1aba>   DW_AT_data_member_location: 2 byte block: 23 1f 	(DW_OP_plus_uconst: 31)
 <2><1abd>: Abbrev Number: 12 (DW_TAG_member)
    <1abe>   DW_AT_name        : (indirect string, offset: 0xc85): cifin
    <1ac2>   DW_AT_decl_file   : 36
    <1ac3>   DW_AT_decl_line   : 253
    <1ac4>   DW_AT_type        : <0x179c>
    <1ac8>   DW_AT_data_member_location: 2 byte block: 23 24 	(DW_OP_plus_uconst: 36)
 <2><1acb>: Abbrev Number: 59 (DW_TAG_member)
    <1acc>   DW_AT_name        : dif
    <1ad0>   DW_AT_decl_file   : 36
    <1ad1>   DW_AT_decl_line   : 256
    <1ad3>   DW_AT_type        : <0x180c>
    <1ad7>   DW_AT_data_member_location: 2 byte block: 23 2b 	(DW_OP_plus_uconst: 43)
 <2><1ada>: Abbrev Number: 59 (DW_TAG_member)
    <1adb>   DW_AT_name        : in
    <1ade>   DW_AT_decl_file   : 36
    <1adf>   DW_AT_decl_line   : 257
    <1ae1>   DW_AT_type        : <0x179c>
    <1ae5>   DW_AT_data_member_location: 2 byte block: 23 34 	(DW_OP_plus_uconst: 52)
 <2><1ae8>: Abbrev Number: 59 (DW_TAG_member)
    <1ae9>   DW_AT_name        : out
    <1aed>   DW_AT_decl_file   : 36
    <1aee>   DW_AT_decl_line   : 258
    <1af0>   DW_AT_type        : <0x179c>
    <1af4>   DW_AT_data_member_location: 2 byte block: 23 3b 	(DW_OP_plus_uconst: 59)
 <2><1af7>: Abbrev Number: 0
 <1><1af8>: Abbrev Number: 104 (DW_TAG_structure_type)
    <1af9>   DW_AT_name        : (indirect string, offset: 0x1a77): array
    <1afd>   DW_AT_byte_size   : 400
    <1aff>   DW_AT_decl_file   : 10
    <1b00>   DW_AT_decl_line   : 107
    <1b01>   DW_AT_sibling     : <0x1b34>
 <2><1b05>: Abbrev Number: 29 (DW_TAG_member)
    <1b06>   DW_AT_name        : d_
    <1b09>   DW_AT_decl_file   : 10
    <1b0a>   DW_AT_decl_line   : 109
    <1b0b>   DW_AT_type        : <0x1b34>
    <1b0f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><1b12>: Abbrev Number: 119 (DW_TAG_subprogram)
    <1b13>   DW_AT_external    : 1
    <1b14>   DW_AT_name        : (indirect string, offset: 0x1067): operator[]
    <1b18>   DW_AT_decl_file   : 10
    <1b19>   DW_AT_decl_line   : 112
    <1b1a>   DW_AT_MIPS_linkage_name: (indirect string, offset: 0x117e): _ZN5arrayI5dvec2Lj100EEixEj
    <1b1e>   DW_AT_type        : <0x63be>
    <1b22>   DW_AT_declaration : 1
    <1b23>   DW_AT_object_pointer: <0x1b27>
 <3><1b27>: Abbrev Number: 39 (DW_TAG_formal_parameter)
    <1b28>   DW_AT_type        : <0x63c4>
    <1b2c>   DW_AT_artificial  : 1
 <3><1b2d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <1b2e>   DW_AT_type        : <0x1109>
 <3><1b32>: Abbrev Number: 0
 <2><1b33>: Abbrev Number: 0
 <1><1b34>: Abbrev Number: 11 (DW_TAG_array_type)
    <1b35>   DW_AT_type        : <0x1333>
    <1b39>   DW_AT_sibling     : <0x1b44>
 <2><1b3d>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <1b3e>   DW_AT_type        : <0xd50>
    <1b42>   DW_AT_upper_bound : 99
 <2><1b43>: Abbrev Number: 0
 <1><1b44>: Abbrev Number: 84 (DW_TAG_structure_type)
